//应该在主界面启动
//要用日文,不支持汉化
//其他情况可能导致bug,不负责
//立绘：食指唐与血魔罗请使用初始立绘,其他人格请用三破立绘
//快捷替换：图片=['良死1','良死2','良死3',85]

[初始化]=(
{设置分辨率 | [1618,947]}
//起始设置
//初始选项
%模块合成%={UI|初始选项,自动换模块}
%结算时截图%={UI|初始选项,结算时截图}
%死亡重开%={UI|初始选项,死亡重开}
%入镜重新选人%={UI|初始选项,入镜重新选人}
//功能选择
%地牢%={UI|功能开关,地牢}
%经验%={UI|功能开关,经验}
%纺锤%={UI|功能开关,纺锤}
%一次日常%={UI|功能开关,一次日常}
%经验跳过%={UI|功能开关,经验(跳过)}
%纺锤跳过%={UI|功能开关,纺锤(跳过)}
//完成层数
%三层退%={UI|完成层数,三}
%四层退%={UI|完成层数,四}
//星恩全选
%全选启用%={UI|星恩全选,无+}
%星恩+%={UI|星恩全选,+}
%星恩++%={UI|星恩全选,++}
%星恩Y%=585
%跳过星恩判断%=0
//采掘连战启用
%经验连战%={UI|采掘连战启用,经验}
%纺锤连战%={UI|采掘连战启用,纺锤}
%采掘次数变动%=1
%点击次数%=0
//次数设置
%地牢次数%={UI|地牢次数选择}
%经验次数%={UI|经验次数选择}
%纺锤次数%={UI|纺锤次数选择}
//活动包
%活动1%={UI|活动包,经验记忆}
%活动2%={UI|活动包,无}

//运行设置
//商店各楼层生效功能
%合成-第一层%={UI|合成,1}
%合成-第二层%={UI|合成,2}
%合成-第三层%={UI|合成,3}
%合成-第四层%={UI|合成,4}
%合成-第五层%={UI|合成,5}
%升级-第一层%={UI|升级,1}
%升级-第二层%={UI|升级,2}
%升级-第三层%={UI|升级,3}
%升级-第四层%={UI|升级,4}
%升级-第五层%={UI|升级,5}
%购买-第一层%={UI|购买,1}
%购买-第二层%={UI|购买,2}
%购买-第三层%={UI|购买,3}
%购买-第四层%={UI|购买,4}
%购买-第五层%={UI|购买,5}
%技能-第一层%={UI|技能,1}
%技能-第二层%={UI|技能,2}
%技能-第三层%={UI|技能,3}
%技能-第四层%={UI|技能,4}
%技能-第五层%={UI|技能,5}
//自动拉条
%拉条A%={UI|拉条模式,A}
%拉条B%={UI|拉条模式,B}
%自动拉条%=0
%拉条回合%=0
%困难战斗%=0
//特殊设置
%不领取奖励%={UI|特殊设置,不领取奖励}
%存储一局%={UI|特殊设置,存储一局}
%拉条守备%={UI|特殊设置,回合1拉条守备}
%守备%=0
%中指开局反击%={UI|特殊设置,中指开局反击}
%中指反击%=0
%星光换经费%={UI|特殊设置,盈余星光换经费}
%星光不换经费%=0
%无限死亡重开%={UI|特殊设置,无限死亡重开}

%守备选人1%={UI|守备选人1}
%守备选人2%={UI|守备选人2}
%守备选人3%={UI|守备选人3}
%守备选人4%={UI|守备选人4}
%守备选人5%={UI|守备选人5}
%守备选人6%={UI|守备选人6}
%守备选人7%={UI|守备选人7}
%守备选人8%={UI|守备选人8}

%全灭放弃%={UI|全灭放弃设定,启用}
%旧版全灭%={UI|全灭放弃设定,仅队中无人时判断}
%全灭人数%={UI|全灭判断}

//地牢设置
//难度选择
%普通镜牢%={UI|难度选择,普通}
%困难镜牢%={UI|难度选择,困难}
//加成设置
%加成领取单次%={UI|加成设置,单次}
%加成领取禁用%={UI|加成设置,不用}
//地牢队伍选择
%地牢队伍识别%={UI|地牢队伍,识别}
%地牢队伍固定%={UI|地牢队伍,固定}
%地牢队伍选择%={UI|地牢固定队伍}
%地牢Y%=0
//良死
%良秀死全家[地牢]%={UI|良单开关,启用}
%良秀死全家[经验]%={UI|日常特殊设置,良秀死全家[经验]}
%良秀死全家[纺锤]%={UI|日常特殊设置,良秀死全家[纺锤]}
%此事未成%=0
%连接可行%=0
%尝试次数%=0
%防红玫瑰%=0
//起始饰品
%起始饰品1%={UI|非轮换起始饰品,1}
%起始饰品2%={UI|非轮换起始饰品,2}
%起始饰品3%={UI|非轮换起始饰品,3}
//道中饰品
%回复类%={UI|道中饰品,回复类}
%经济类%={UI|道中饰品,经济类}
%体系二%={UI|道中饰品,体系二}
//起始体系
%体系1%={UI|1顺位饰品}
%体系2%={UI|2顺位饰品}
%起始体系X%=0
%起始体系Y%=0
%饰品坐标X1%=0
%饰品坐标Y1%=0
%饰品坐标X2%=0
%饰品坐标Y2%=0
%饰品坐标X3%=0
%饰品坐标Y3%=0
%饰品坐标X4%=0
%饰品坐标Y4%=0
%饰品坐标X5%=0
%饰品坐标Y5%=0
%饰品坐标X6%=0
%饰品坐标Y6%=0
%饰品坐标X7%=0
%饰品坐标Y7%=0
%饰品坐标X8%=0
%饰品坐标Y8%=0

//日常设置
//经验队伍
%经验队伍识别%={UI|经验队伍,识别}
%经验队伍固定%={UI|经验队伍,固定}
%经验队伍选择%={UI|经验固定队伍}
%经验Y%=0
%经验已选择%=0
//纺锤队伍
%纺锤队伍识别%={UI|纺锤队伍,识别}
%纺锤队伍固定%={UI|纺锤队伍,固定}
%纺锤队伍选择%={UI|纺锤固定队伍}
%纺锤Y%=0
%纺锤已选择%=0
//一次日常次数
%一次日常经验次数%={UI|一次日常经验次数}
%一次日常纺锤次数%={UI|一次日常纺锤次数}
//一次日常跳过
%一次日常经验跳过%={UI|一次日常跳过,经验}
%一次日常纺锤跳过%={UI|一次日常跳过,纺锤}
//一次日常体力购买
%体力购买%={UI|体力购买,启用}
%体力购买次数%={UI|体力购买次数}
%体力已购买次数%=0
%体力购买1%=0
//日常特殊设置
%五点自动日常%={UI|日常特殊设置,五点自动日常}
%邮箱%={UI|日常特殊设置,一次日常领取邮件}
%自动日常%=0
%日常领取%=0
//抗性编队启用
%经验抗性编队%={UI|抗性编队启用,经验}
%纺锤抗性编队%={UI|抗性编队启用,纺锤}
//选择抗性编队
%愤怒编队%={UI|选择抗性编队,暴怒}
%色欲编队%={UI|选择抗性编队,色欲}
%怠惰编队%={UI|选择抗性编队,怠惰}
%暴食编队%={UI|选择抗性编队,暴食}
%忧郁编队%={UI|选择抗性编队,忧郁}
%傲慢编队%={UI|选择抗性编队,傲慢}
%嫉妒编队%={UI|选择抗性编队,嫉妒}
%斩击编队%={UI|选择抗性编队,斩击}
%刺击编队%={UI|选择抗性编队,刺击}
%打击编队%={UI|选择抗性编队,打击}
%愤怒纺锤%=0
%色欲纺锤%=0
%怠惰纺锤%=0
%暴食纺锤%=0
%忧郁纺锤%=0
%傲慢纺锤%=0
%嫉妒纺锤%=0
%斩击经验%=0
%刺击经验%=0
%打击经验%=0

//商店设置
//合成
%合成体系1%={UI|合成体系1}
%合成体系2%={UI|合成体系2}
%启用合成%={UI|合成设置,启用合成}
%避开同系%={UI|合成设置,避开同系}
%星光合成%={UI|合成设置,启用星光}
%三级合成%={UI|合成设置,222→3}
%公式合成%={UI|合成设置,启用公式}
%三级合成1%=0
%升级合成%=0
//商店功能
%商店启用%={UI|商店,启用}
%商店刷新%={UI|商店,刷新}
%商店回复%={UI|商店,回复}
%商店刷新次数%={UI|商店刷新次数}
%商店已刷新次数%=0
//技能组替换
%技能1→2%={UI|技能组替换,1→2}
%技能2→3%={UI|技能组替换,2→3}
%技能1→3%={UI|技能组替换,1→3}
//刷新模式
%经费刷新%={UI|刷新模式,经费刷新}
%定向刷新%={UI|刷新模式,定向刷新}

//星恩设置

%星恩1%={UI|星恩1开关,启用(10)}
%星恩1+%={UI|星恩1强化,+(20)}
%星恩1++%={UI|星恩1强化,++(30)}

%星恩2%={UI|星恩2开关,启用(10)}
%星恩2+%={UI|星恩2强化,+(20)}
%星恩2++%={UI|星恩2强化,++(30)}

%星恩3%={UI|星恩3开关,启用(20)}
%星恩3+%={UI|星恩3强化,+(40)}
%星恩3++%={UI|星恩3强化,++(60)}

%星恩4%={UI|星恩4开关,启用(20)}
%星恩4+%={UI|星恩4强化,+(40)}
%星恩4++%={UI|星恩4强化,++(60)}

%星恩5%={UI|星恩5开关,启用(30)}
%星恩5+%={UI|星恩5强化,+(60)}
%星恩5++%={UI|星恩5强化,++(90)}

%星恩6%={UI|星恩6开关,启用(30)}
%星恩6+%={UI|星恩6强化,+(60)}
%星恩6++%={UI|星恩6强化,++(90)}
%星恩选择6%=0

%星恩7%={UI|星恩7开关,启用(40)}
%星恩7+%={UI|星恩7强化,+(80)}
%星恩7++%={UI|星恩7强化,++(120)}

%星恩8%={UI|星恩8开关,启用(40)}
%星恩8+%={UI|星恩8强化,+(80)}
%星恩8++%={UI|星恩8强化,++(120)}

%星恩9%={UI|星恩9开关,启用(50)}
%星恩9+%={UI|星恩9强化,+(100)}
%星恩9++%={UI|星恩9强化,++(150)}

%星恩10%={UI|星恩10开关,启用(60)}
%星恩10+%={UI|星恩10强化,+(120)}
%星恩10++%={UI|星恩10强化,++(180)}
%星恩选择10%=0

//饰品观测
%启用观测%={UI|观测开关,启用}
%禁用观测%={UI|观测开关,禁用}
%当前观测%=1

%观测启用1%={UI|独立开关,启用1}
%观测启用1-1%=0
%观测启用2%={UI|独立开关,启用2}
%观测启用2-1%=0
%观测启用3%={UI|独立开关,启用3}
%观测启用3-1%=0

%观测体系1%={UI|观测体系1}
%观测体系2%={UI|观测体系2}
%观测体系3%={UI|观测体系3}

%观测饰品1%={UI|观测饰品1}
%观测饰品2%={UI|观测饰品2}
%观测饰品3%={UI|观测饰品3}

%观测白名1%={UI|观测白名1}
%观测白名2%={UI|观测白名2}
%观测白名3%={UI|观测白名3}

//卡包赋值
%坐标X1%=0
%坐标X2%=0
%坐标Y1%=0
%坐标Y2%=0
%卡包刷新%=0
%卡包刷新次数%=0
%超绝哈基米哈气乱窜%=0
%已选卡包%=0
%楼层%=0
%楼层判断%=0
//地图赋值
%寻路Y1%=0
%寻路Y2%=0
%精锐W%=0
%精锐S%=0
%精锐X%=0
%运行Y%=0
%直冲精锐%=0
//商店赋值
%商店范围坐标X1%=0
%商店范围坐标Y1%=0
%商店范围坐标X2%=0
%商店范围坐标Y2%=0
%买过了%=0
%脏东西%=0
%超级商店%=1
//杂项赋值
%反转%=0
%单行道%=0
%报酬饰品获取%=0
%坐标X%=0
%坐标Y%=0
%重新选人%=0
%困难选择%=0
%战斗中%=0
%全灭次数%=0
%星恩3刷新%=0
%刚入下层%=1

//罪人排序
%角色顺位1%={UI|非轮换队选人1}
%角色顺位2%={UI|非轮换队选人2}
%角色顺位3%={UI|非轮换队选人3}
%角色顺位4%={UI|非轮换队选人4}
%角色顺位5%={UI|非轮换队选人5}
%角色顺位6%={UI|非轮换队选人6}
%角色顺位7%={UI|非轮换队选人7}
%角色顺位8%={UI|非轮换队选人8}
%角色顺位9%={UI|非轮换队选人9}
%角色顺位10%={UI|非轮换队选人10}
%角色顺位11%={UI|非轮换队选人11}
%角色顺位12%={UI|非轮换队选人12}

//EGO设置
//输出EGO设置
%输出1位%={UI|输出1位}
%输出2位%={UI|输出2位}
%输出3位%={UI|输出3位}
//回复EGO设置
%回复1位%={UI|回复1位}
%回复2位%={UI|回复2位}
%回复3位%={UI|回复3位}
//释放设置
%五层输出EGO%={UI|第五层释放EGO种类,输出型}
%五层回复EGO%={UI|第五层释放EGO种类,回复型}
%链条EGO%={UI|第五层释放EGO场景,链条战}
%集中EGO%={UI|第五层释放EGO场景,集中战}
%混乱输出EGO%={UI|混乱释放EGO种类,输出型}
%混乱回复EGO%={UI|混乱释放EGO种类,回复型}
%释放EGO%=0
//释放开关
%第五层开始释放EGO%={UI|释放开关,第五层开始释放EGO}
%EGO只释放一次%={UI|释放开关,EGO只释放一次}
%友方混乱使用EGO%={UI|释放开关,友方混乱使用EGO}

//队伍轮换
%队伍轮换%={UI|队伍轮换,启用}
%轮换队伍%={UI|轮换初始队伍}
%启用队伍-始%={UI|启用[始]}
%启用队伍-终%={UI|启用[终]}
%一队体系1%={UI|一队顺位1}
%一队体系2%={UI|一队顺位2}
%二队体系1%={UI|二队顺位1}
%二队体系2%={UI|二队顺位2}
%三队体系1%={UI|三队顺位1}
%三队体系2%={UI|三队顺位2}
%四队体系1%={UI|四队顺位1}
%四队体系2%={UI|四队顺位2}
%五队体系1%={UI|五队顺位1}
%五队体系2%={UI|五队顺位2}
%六队体系1%={UI|六队顺位1}
%六队体系2%={UI|六队顺位2}

%一队饰品1%={UI|一队起始,1}
%一队饰品2%={UI|一队起始,2}
%一队饰品3%={UI|一队起始,3}
%二队饰品1%={UI|二队起始,1}
%二队饰品2%={UI|二队起始,2}
%二队饰品3%={UI|二队起始,3}
%三队饰品1%={UI|三队起始,1}
%三队饰品2%={UI|三队起始,2}
%三队饰品3%={UI|三队起始,3}
%四队饰品1%={UI|四队起始,1}
%四队饰品2%={UI|四队起始,2}
%四队饰品3%={UI|四队起始,3}
%五队饰品1%={UI|五队起始,1}
%五队饰品2%={UI|五队起始,2}
%五队饰品3%={UI|五队起始,3}
%六队饰品1%={UI|六队起始,1}
%六队饰品2%={UI|六队起始,2}
%六队饰品3%={UI|六队起始,3}

%一队选人1%={UI|一队选人1}
%一队选人2%={UI|一队选人2}
%一队选人3%={UI|一队选人3}
%一队选人4%={UI|一队选人4}
%一队选人5%={UI|一队选人5}
%一队选人6%={UI|一队选人6}
%一队选人7%={UI|一队选人7}
%一队选人8%={UI|一队选人8}
%二队选人1%={UI|二队选人1}
%二队选人2%={UI|二队选人2}
%二队选人3%={UI|二队选人3}
%二队选人4%={UI|二队选人4}
%二队选人5%={UI|二队选人5}
%二队选人6%={UI|二队选人6}
%二队选人7%={UI|二队选人7}
%二队选人8%={UI|二队选人8}
%三队选人1%={UI|三队选人1}
%三队选人2%={UI|三队选人2}
%三队选人3%={UI|三队选人3}
%三队选人4%={UI|三队选人4}
%三队选人5%={UI|三队选人5}
%三队选人6%={UI|三队选人6}
%三队选人7%={UI|三队选人7}
%三队选人8%={UI|三队选人8}
%四队选人1%={UI|四队选人1}
%四队选人2%={UI|四队选人2}
%四队选人3%={UI|四队选人3}
%四队选人4%={UI|四队选人4}
%四队选人5%={UI|四队选人5}
%四队选人6%={UI|四队选人6}
%四队选人7%={UI|四队选人7}
%四队选人8%={UI|四队选人8}
%五队选人1%={UI|五队选人1}
%五队选人2%={UI|五队选人2}
%五队选人3%={UI|五队选人3}
%五队选人4%={UI|五队选人4}
%五队选人5%={UI|五队选人5}
%五队选人6%={UI|五队选人6}
%五队选人7%={UI|五队选人7}
%五队选人8%={UI|五队选人8}
%六队选人1%={UI|六队选人1}
%六队选人2%={UI|六队选人2}
%六队选人3%={UI|六队选人3}
%六队选人4%={UI|六队选人4}
%六队选人5%={UI|六队选人5}
%六队选人6%={UI|六队选人6}
%六队选人7%={UI|六队选人7}
%六队选人8%={UI|六队选人8}


//开发者
//截图
%商店截图%={UI|截图,商店截图}
%选择截图%={UI|截图,选择截图}
%卡包截图%={UI|截图,卡包截图}
//测试功能
%仅获取与升级白名单饰品%={UI|测试功能,仅获取与升级白名单饰品}
%合成避开白名单饰品%={UI|测试功能,合成避开白名单饰品}
%2层后选择苦难%={UI|测试功能,2层后选择苦难}
%报酬选择饰品%={UI|测试功能,报酬选择随机饰品}
%搜寻2列事件%={UI|测试功能,搜寻2列事件}
//到点即停
%商店终止%={UI|到点即停,到商店停}
%四层终止%={UI|到点即停,到四层停}
%五层终止%={UI|到点即停,到五层停}

//喵之所需
//经验拉条
%经验拉条%=0
%斩击拉条%={UI|经验拉条开关,斩}
%刺击拉条%={UI|经验拉条开关,刺}
%打击拉条%={UI|经验拉条开关,打}
%斩击拉条回合%={UI|斩击本}
%刺击拉条回合%={UI|刺击本}
%打击拉条回合%={UI|打击本}
//速刷设置
%三层转困%={UI|速刷设置,三层转困难}
%四层转困%={UI|速刷设置,四层转困难}
//困牢设置
%符咒开%={UI|困牢设置,睫紸羲}
%喵派卡包选择%={UI|困牢设置,喵派卡包选择}
%取消拉条%={UI|困牢设置,五层取消拉条}
//杂项
%喵的选人判断%={UI|杂项,裚腔恁�瓚剿}
%打精锐%={UI|杂项,集中战最低优先}
%不先升初始%={UI|杂项,不先升初始饰品}
%仅升四级%={UI|杂项,仅升四级饰品}
)
[UI]=(

{主窗体 | N719_请单开文件夹存放 | 大小=[200,200] | 按键=['是的我同意该协议','请先在其余设置页设定完毕'] | 对齐模式=0 | 背景图='金智勋我真的受不了你了.png'}
{页面 | 分页 | 对齐模式=0 | 选项=['使用协议','起始设置','运行设置','地牢设置','日常设置','商店设置','星恩设置','饰品观测','队伍设置','EGO设置','轮换选人','开发者','裚眳垀剒']}

//说明
{垂直布局 | 使用协议 | 页面='分页.使用协议' | 对齐模式=0}
{标签|本程序使用协议|布局='使用协议'|对齐模式=2|样式='color:rgb(255,0,0);font-weight:600;font-size:20px;'}
{标签|本程序基于屏幕截图与模拟键鼠操作实现,不读取游戏进程内存、不拦截或修改网络封包、不调用游戏内部API、\n不采取任何规避游戏反作弊技术措施的手段。所有图像数据仅在本地处理,不上传不留存。|布局='使用协议'|对齐模式=0|样式='color:rgb(0,0,0);font-weight:600;font-size:13px;'}
{标签|1、您知悉多数游戏官方禁止第三方辅助,自愿使用本程序。因游戏运营方措施导致的账号封禁、数据丢失等后果\n由您自行承担；但因作者故意或重大过失所致损失除外。|布局='使用协议'|对齐模式=0|样式='color:rgb(0,0,0);font-weight:600;font-size:13px;'}
{标签|2、本程序永久免费,仅限个人非营利自用。严禁用于工作室批量挂机、代肝、商业牟利等行为。|布局='使用协议'|对齐模式=0|样式='color:rgb(0,0,0);font-weight:600;font-size:13px;'}
{标签|3、本程序只基于发布时的游戏版本提供,不保证持续适配游戏版本更新；因官方客户端改版导致识别失效属正常\n现象。|布局='使用协议'|对齐模式=0|样式='color:rgb(0,0,0);font-weight:600;font-size:13px;'}
{标签|4、禁止反编译、二次打包、篡改、倒卖、植入错误代码后传播、肆意宣传本软件|布局='使用协议'|对齐模式=0|样式='color:rgb(0,0,0);font-weight:600;font-size:13px;'}
{标签|5、因本软件产生的争议由作者所在地法院管辖；作者违约责任以您实际支付给作者的金额(如有)为上限。|布局='使用协议'|对齐模式=0|样式='color:rgb(0,0,0);font-weight:600;font-size:13px;'}
{标签|点击[同意]即代表您已完整阅读并自愿接受上述全部条款。|布局='使用协议'|对齐模式=2|样式='color:rgb(255,0,0);font-weight:600;font-size:22px;'}

//起始设置
{垂直布局 | 起始设置 | 页面='分页.起始设置' | 对齐模式=0}

{水平布局 | 设置1 | 布局='起始设置' | 对齐模式=0}
{组 | 初始选项 | 布局='设置1' | 对齐模式=0}
{多选 | 初始选项 | 组='初始选项' | 行列=[2,2] | 对齐模式=0 | 选项=['自动换模块','结算时截图','死亡重开','入镜重新选人'] | 选中=[1,0,1,0]}
{组 | 星恩全选 | 布局='设置1' | 对齐模式=0}
{单选 | 星恩全选 | 组='星恩全选' | 行列=[2,2] | 对齐模式=0 | 选项=['禁用','无+','+','++'] | 选中=[1,0,0,0]}

{水平布局 | 设置3 | 布局='起始设置' | 对齐模式=0}
{组 | 功能选择 | 布局='设置3' | 对齐模式=0}
{单选|功能开关|组='功能选择'|行列=[2,3]|对齐模式=0|选项=['地牢','经验','纺锤','一次日常','经验(跳过)','纺锤(跳过)']|选中=[0]}
{组 | 完成层数 | 布局='设置3' | 对齐模式=0}
{单选 | 完成层数 | 组='完成层数' | 行列=[1,3] | 对齐模式=0 | 选项=['三','四','五'] | 选中=[0,0,1]}
{组 | 采掘连战启用 | 布局='设置3' | 对齐模式=0}
{多选 | 采掘连战启用 | 组='采掘连战启用' | 行列=[2,1] | 对齐模式=0 | 选项=['经验','纺锤'] | 选中=[1,1]}

//{水平布局|标签|布局='起始设置'|对齐模式=5}
//{标签|不要覆盖主版本,新建文件夹存放此版本|布局='标签'|对齐模式=5|样式='color:rgb(221,96,12);font-weight:600;font-size:25px;'}

{水平布局 | 设置4 | 布局='起始设置' | 对齐模式=1}
{组 | 次数设置:地牢/经验/纺锤 | 布局='设置4' | 对齐模式=0}
{水平布局 | 次数1 | 组='次数设置:地牢/经验/纺锤' | 对齐模式=1}
{编辑框|地牢次数选择|布局='次数1'|对齐模式=0|提示='地牢次数(必填)'}
{编辑框|经验次数选择|布局='次数1'|对齐模式=0|提示='经验次数(必填)'}
{编辑框|纺锤次数选择|布局='次数1'|对齐模式=0|提示='纺锤次数(必填)'}
{组 | 活动包 | 布局='设置4' | 对齐模式=0}
{多选 | 活动包 | 组='活动包' | 行列=[2,1] | 对齐模式=0 | 选项=['经验记忆','无'] | 选中=[0]}


//运行设置
{垂直布局 | 运行设置 | 页面='分页.运行设置' | 对齐模式=0}

{水平布局 | 设置1 | 布局='运行设置' | 对齐模式=0}
{组|特殊[正常请勿更改]|布局='设置1'|对齐模式=0|样式='color:rgb(202,138,27);font-weight:200;font-size:13px;'}
{多选 | 特殊设置 | 行列=[5,2] | 组='特殊[正常请勿更改]' | 对齐模式=0 | 选项=['回合1拉条守备','中指开局反击','不领取奖励','盈余星光换经费','存储一局','无限死亡重开'] | 选中=[0]}

{组|拉条守备设置[全队共用]|布局='设置1'|对齐模式=1|样式='color:rgb(202,138,27);font-weight:200;font-size:13px;'}
{网格布局 | 守备设置1 | 组='拉条守备设置[全队共用]' | 对齐模式=0 | 行列=[2,4]}
{组 | 守备1 | 布局='守备设置1' | 对齐模式=1}
{水平布局 | 1 | 组='守备1' | 对齐模式=0}
{下拉框 | 守备选人1 | 布局='1' | 对齐模式=0 | 选项=['空','箱_午','浮_卯','浮_黎明','堂_未','堂_憎恶','堂_食指','良_卯','良_地慧','默_拇指','夫_狂猎','夫_酉','罗_巳','罗_绝望','辛_酉','奥_卯','虫_巳','虫_黎明'] | 选中=0}
{组 | 守备2 | 布局='守备设置1' | 对齐模式=1}
{水平布局 | 2 | 组='守备2' | 对齐模式=0}
{下拉框 | 守备选人2 | 布局='2' | 对齐模式=0 | 选项=['空','箱_午','浮_卯','浮_黎明','堂_未','堂_憎恶','堂_食指','良_卯','良_地慧','默_拇指','夫_狂猎','夫_酉','罗_巳','罗_绝望','辛_酉','奥_卯','虫_巳','虫_黎明'] | 选中=0}
{组 | 守备3 | 布局='守备设置1' | 对齐模式=1}
{水平布局 | 3 | 组='守备3' | 对齐模式=0}
{下拉框 | 守备选人3 | 布局='3' | 对齐模式=0 | 选项=['空','箱_午','浮_卯','浮_黎明','堂_未','堂_憎恶','堂_食指','良_卯','良_地慧','默_拇指','夫_狂猎','夫_酉','罗_巳','罗_绝望','辛_酉','奥_卯','虫_巳','虫_黎明'] | 选中=0}
{组 | 守备4 | 布局='守备设置1' | 对齐模式=1}
{水平布局 | 4 | 组='守备4' | 对齐模式=0}
{下拉框 | 守备选人4 | 布局='4' | 对齐模式=0 | 选项=['空','箱_午','浮_卯','浮_黎明','堂_未','堂_憎恶','堂_食指','良_卯','良_地慧','默_拇指','夫_狂猎','夫_酉','罗_巳','罗_绝望','辛_酉','奥_卯','虫_巳','虫_黎明'] | 选中=0}
{组 | 守备5 | 布局='守备设置1' | 对齐模式=1}
{水平布局 | 5 | 组='守备5' | 对齐模式=0}
{下拉框 | 守备选人5 | 布局='5' | 对齐模式=0 | 选项=['空','箱_午','浮_卯','浮_黎明','堂_未','堂_憎恶','堂_食指','良_卯','良_地慧','默_拇指','夫_狂猎','夫_酉','罗_巳','罗_绝望','辛_酉','奥_卯','虫_巳','虫_黎明'] | 选中=0}
{组 | 守备6 | 布局='守备设置1' | 对齐模式=1}
{水平布局 | 6 | 组='守备6' | 对齐模式=0}
{下拉框 | 守备选人6 | 布局='6' | 对齐模式=0 | 选项=['空','箱_午','浮_卯','浮_黎明','堂_未','堂_憎恶','堂_食指','良_卯','良_地慧','默_拇指','夫_狂猎','夫_酉','罗_巳','罗_绝望','辛_酉','奥_卯','虫_巳','虫_黎明'] | 选中=0}
{组 | 守备7 | 布局='守备设置1' | 对齐模式=1}
{水平布局 | 7 | 组='守备7' | 对齐模式=0}
{下拉框 | 守备选人7 | 布局='7' | 对齐模式=0 | 选项=['空','箱_午','浮_卯','浮_黎明','堂_未','堂_憎恶','堂_食指','良_卯','良_地慧','默_拇指','夫_狂猎','夫_酉','罗_巳','罗_绝望','辛_酉','奥_卯','虫_巳','虫_黎明'] | 选中=0}
{组 | 守备8 | 布局='守备设置1' | 对齐模式=1}
{水平布局 | 8 | 组='守备8' | 对齐模式=0}
{下拉框 | 守备选人8 | 布局='8' | 对齐模式=0 | 选项=['空','箱_午','浮_卯','浮_黎明','堂_未','堂_憎恶','堂_食指','良_卯','良_地慧','默_拇指','夫_狂猎','夫_酉','罗_巳','罗_绝望','辛_酉','奥_卯','虫_巳','虫_黎明'] | 选中=0}

{水平布局 | 设置2 | 布局='运行设置' | 对齐模式=0}
{组 | 拉条模式 | 布局='设置2' | 对齐模式=0}
{单选 | 拉条模式 | 组='拉条模式' | 行列=[3,1] | 对齐模式=0 | 选项=['A','B','禁用'] | 选中=[0,0,1]}

{组 | 选人页全灭放弃 | 布局='设置2' | 对齐模式=0}
{网格布局 | 全灭1 | 组='选人页全灭放弃' | 对齐模式=0 | 行列=[2,1]}
{组 | 全灭放弃设定 | 布局='全灭1' | 对齐模式=0}
{多选 | 全灭放弃设定 | 组='全灭放弃设定' | 行列=[1,2] | 对齐模式=0 | 选项=['启用','仅队中无人时判断'] | 选中=[1,1]}
{组 | 死亡人数为[?]时定为全灭 | 布局='全灭1' | 对齐模式=0}
{水平布局 | 全灭2 | 组='全灭1' | 对齐模式=0}
{下拉框 | 全灭判断 | 组='死亡人数为[?]时定为全灭' | 对齐模式=0 | 选项=['4','6','8'] | 选中=0}

{组 | 商店生效层数[1~5] | 布局='设置2' | 对齐模式=1}
{网格布局 | 商店1 | 组='商店生效层数[1~5]' | 对齐模式=0 | 行列=[1,4]}
{组 | 合成 | 布局='商店1' | 对齐模式=0}
{多选 | 合成 | 行列=[5,1] | 组='合成' | 对齐模式=0 | 选项=['1','2','3','4','5'] | 选中=[0]}
{组 | 升级 | 布局='商店1' | 对齐模式=0}
{多选 | 升级 | 行列=[5,1] | 组='升级' | 对齐模式=0 | 选项=['1','2','3','4','5'] | 选中=[0]}
{组 | 购买 | 布局='商店1' | 对齐模式=0}
{多选 | 购买 | 行列=[5,1] | 组='购买' | 对齐模式=0 | 选项=['1','2','3','4','5'] | 选中=[0]}
{组 | 技能 | 布局='商店1' | 对齐模式=0}
{多选 | 技能 | 行列=[5,1] | 组='技能' | 对齐模式=0 | 选项=['1','2','3','4','5'] | 选中=[0]}

//地牢设置
{垂直布局 | 地牢设置 | 页面='分页.地牢设置' | 对齐模式=0}

{水平布局 | 设置1 | 布局='地牢设置' | 对齐模式=1}
{组 | 难度选择 | 布局='设置1' | 对齐模式=0}
{单选 | 难度选择 | 行列=[2,1] | 组='难度选择' | 对齐模式=0 | 选项=['普通','困难'] | 选中=[1,0]}
{组 | 加成设置 | 布局='设置1' | 对齐模式=0}
{单选 | 加成设置 | 行列=[3,1] | 组='加成设置' | 对齐模式=0 | 选项=['单次','所有','不用'] | 选中=[0,0,1]}

{组 | 非轮换体系 | 布局='设置1' | 对齐模式=0}
{网格布局 | 体系1 | 组='非轮换体系' | 对齐模式=0 | 行列=[2,2]}
{组 | 起始饰品 | 布局='体系1' | 对齐模式=0}
{多选 | 非轮换起始饰品 | 行列=[3,1] | 组='起始饰品' | 对齐模式=0 | 选项=['1','2','3'] | 选中=[0]}
{组 | 队伍轮换 | 布局='体系1' | 对齐模式=0}
{多选 | 队伍轮换 | 组='队伍轮换' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[0]}
{组 | 体系一 | 布局='体系1' | 对齐模式=0}
{水平布局 | 顺位1 | 组='体系一' | 对齐模式=0}
{下拉框 | 1顺位饰品 | 布局='顺位1' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 体系二 | 布局='体系1' | 对齐模式=0}
{水平布局 | 顺位2 | 组='体系二' | 对齐模式=0}
{下拉框 | 2顺位饰品 | 布局='顺位2' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}

{组 | 地牢队伍选择 | 布局='设置1' | 对齐模式=0}
{垂直布局 | 队伍1 | 组='地牢队伍选择' | 对齐模式=0}
{组 | 地牢队伍 | 布局='队伍1' | 对齐模式=0}
{单选 | 地牢队伍 | 行列=[1,2] | 组='地牢队伍' | 对齐模式=0 | 选项=['识别','固定'] | 选中=[1,0]}
{组 | 地牢固定队伍 | 布局='队伍1' | 对齐模式=0}
{下拉框 | 地牢固定队伍 | 组='地牢固定队伍' | 对齐模式=0 | 选项=['1','2','3','4','5'] | 选中=0}
{组 | 良秀死全家[地牢] | 布局='设置1' | 对齐模式=0}
{垂直布局 | 良单1 | 组='良秀死全家[地牢]' | 对齐模式=0}
{组 | 开关 | 布局='良单1' | 对齐模式=0}
{多选 | 良单开关 | 组='开关' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[0]}
//{组|相似度|布局='良单1'|对齐模式=0}
//{水平布局|良单2|组='相似度'|对齐模式=0}
//{编辑框|良单相似度|布局='良单2'|对齐模式=0|提示='必填,大于70'}
{标签|良单误判:\n自己脚本内调相似度\n采掘良单同理\n\n位置:\nCTRL+F:良死1|布局='良单1'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}


{水平布局 | 设置2 | 布局='地牢设置' | 对齐模式=1}
{组 | 轮换起始饰品 | 布局='设置2' | 对齐模式=0}
{网格布局 | 轮换起始1 | 组='轮换起始饰品' | 对齐模式=0 | 行列=[1,6]}
{组 | 一队 | 布局='轮换起始1' | 对齐模式=0}
{多选 | 一队起始 | 行列=[3,1] | 组='一队' | 对齐模式=0 | 选项=['1','2','3'] | 选中=[0]}
{组 | 二队 | 布局='轮换起始1' | 对齐模式=0}
{多选 | 二队起始 | 行列=[3,1] | 组='二队' | 对齐模式=0 | 选项=['1','2','3'] | 选中=[0]}
{组 | 三队 | 布局='轮换起始1' | 对齐模式=0}
{多选 | 三队起始 | 行列=[3,1] | 组='三队' | 对齐模式=0 | 选项=['1','2','3'] | 选中=[0]}
{组 | 四队 | 布局='轮换起始1' | 对齐模式=0}
{多选 | 四队起始 | 行列=[3,1] | 组='四队' | 对齐模式=0 | 选项=['1','2','3'] | 选中=[0]}
{组 | 五队 | 布局='轮换起始1' | 对齐模式=0}
{多选 | 五队起始 | 行列=[3,1] | 组='五队' | 对齐模式=0 | 选项=['1','2','3'] | 选中=[0]}
{组 | 六队 | 布局='轮换起始1' | 对齐模式=0}
{多选 | 六队起始 | 行列=[3,1] | 组='六队' | 对齐模式=0 | 选项=['1','2','3'] | 选中=[0]}
{组 | 道中饰品 | 布局='设置2' | 对齐模式=0}
{多选 | 道中饰品 | 行列=[4,1] | 组='道中饰品' | 对齐模式=0 | 选项=['回复类','经济类','体系二'] | 选中=[0]}
{标签|请检查:\n[队伍设置],[轮换选人]\n\n未找到预设卡包时:\n观测卡包\n\n推荐星恩\n普:3,7/10\n困:3,7,10\n良单:1,3,4|布局='设置2'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}

//日常设置
{垂直布局 | 日常设置 | 页面='分页.日常设置' | 对齐模式=0}

{水平布局 | 设置1 | 布局='日常设置' | 对齐模式=0}
{组 | 经验队伍 | 布局='设置1' | 对齐模式=0}
{网格布局 | 经验1 | 组='经验队伍' | 对齐模式=0 | 行列=[1,2]}
{组 | 经验队伍选择 | 布局='经验1' | 对齐模式=0}
{单选 | 经验队伍 | 行列=[2,1] | 组='经验队伍选择' | 对齐模式=0 | 选项=['识别','固定'] | 选中=[1,0]}
{组 | 经验固定队伍 | 布局='经验1' | 对齐模式=0}
{下拉框 | 经验固定队伍 | 组='经验固定队伍' | 对齐模式=0 | 选项=['1','2','3','4','5'] | 选中=0}
{组 | 纺锤队伍 | 布局='设置1' | 对齐模式=0}
{网格布局 | 纺锤1 | 组='纺锤队伍' | 对齐模式=0 | 行列=[1,2]}
{组 | 纺锤队伍选择 | 布局='纺锤1' | 对齐模式=0}
{单选 | 纺锤队伍 | 行列=[2,1] | 组='纺锤队伍选择' | 对齐模式=0 | 选项=['识别','固定'] | 选中=[1,0]}
{组 | 纺锤固定队伍 | 布局='纺锤1' | 对齐模式=0}
{下拉框 | 纺锤固定队伍 | 组='纺锤固定队伍' | 对齐模式=0 | 选项=['1','2','3','4','5'] | 选中=0}
{组 | 日常特殊设置 | 布局='设置1' | 对齐模式=0}
{多选 | 日常特殊设置 | 组='日常特殊设置' | 行列=[5,1] | 对齐模式=0 | 选项=['五点自动日常','一次日常领取邮件','良秀死全家[经验]','良秀死全家[纺锤]'] | 选中=[0]}

{水平布局 | 设置2 | 布局='日常设置' | 对齐模式=0}
{组 | 一次日常次数:经验/纺锤 | 布局='设置2' | 对齐模式=0}
{网格布局 | 一次日常次数 | 组='一次日常次数:经验/纺锤' | 对齐模式=1 | 行列=[2,1]}
{编辑框|一次日常经验次数|布局='一次日常次数'|对齐模式=0|提示='经验(必填)'}
{编辑框|一次日常纺锤次数|布局='一次日常次数'|对齐模式=0|提示='纺锤(必填)'}
{组 | 一次日常跳过 | 布局='设置2' | 对齐模式=0}
{多选 | 一次日常跳过 | 行列=[2,1] | 组='一次日常跳过' | 对齐模式=4 | 选项=['经验','纺锤'] | 选中=[0]}
{组 | 一次日常体力购买 | 布局='设置2' | 对齐模式=0}
{网格布局 | 体力1 | 组='一次日常体力购买' | 对齐模式=0 | 行列=[1,6]}
{组 | 体力购买 | 布局='体力1' | 对齐模式=0}
{多选 | 体力购买 | 组='体力购买' | 行列=[1,1] | 对齐模式=0 | 选项=['启用'] | 选中=[0]}
{组 | 体力购买次数 | 布局='体力1' | 对齐模式=0}
{下拉框 | 体力购买次数 | 组='体力购买次数' | 对齐模式=0 | 选项=['0','1','2','3','4','5','6'] | 选中=0}
{组 | 抗性编队启用 | 布局='设置2' | 对齐模式=0}
{多选 | 抗性编队启用 | 行列=[2,1] | 组='抗性编队启用' | 对齐模式=4 | 选项=['经验','纺锤'] | 选中=[0]}

{水平布局 | 设置3 | 布局='日常设置' | 对齐模式=0}
{组 | 选择抗性编队 | 布局='设置3' | 对齐模式=0}
{多选 | 选择抗性编队 | 行列=[2,5] | 组='选择抗性编队' | 对齐模式=4 | 选项=['暴怒','色欲','怠惰','暴食','忧郁','傲慢','嫉妒','斩击','刺击','打击'] | 选中=[0]}
{标签|抗性编队启用时,固定队伍失效\n\n良秀清除家人仅推荐打连战开启\n必要条件为使用的队伍中存在蜘蛛巢人员与地慧星|布局='设置3'|对齐模式=4|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}

//商店设置
{垂直布局 | 商店设置 | 页面='分页.商店设置' | 对齐模式=0}

{水平布局 | 设置1 | 布局='商店设置' | 对齐模式=0}
{组 | 商店功能 | 布局='设置1' | 对齐模式=0}
{网格布局 | 商店1 | 组='商店功能' | 行列=[2,2] | 对齐模式=0}
{组 | 商店 | 布局='商店1' | 对齐模式=0}
{多选 | 商店 | 组='商店' | 行列=[4,1] | 对齐模式=0 | 选项=['启用','刷新','回复'] | 选中=[1,0,0]}
{组 | 商店刷新次数 | 布局='商店1' | 对齐模式=0}
{编辑框 | 商店刷新次数 | 组='商店刷新次数' | 对齐模式=0 | 提示='商店刷新次数'}
{组 | 刷新模式 | 布局='设置1' | 对齐模式=0}
{单选 | 刷新模式 | 组='刷新模式' | 行列=[3,1] | 对齐模式=1 | 选项=['经费刷新','定向刷新'] | 选中=[1,0]}

{水平布局 | 设置2 | 布局='商店设置' | 对齐模式=0}
{组 | 合成 | 布局='设置2' | 对齐模式=0}
{水平布局 | 合成1 | 组='合成' | 对齐模式=0}
{组 | 合成体系1 | 布局='合成1' | 对齐模式=0}
{下拉框 | 合成体系1 | 组='合成体系1' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 合成体系2 | 布局='合成1' | 对齐模式=0}
{下拉框 | 合成体系2 | 组='合成体系2' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 合成设置 | 布局='合成1' | 对齐模式=0}
{多选 | 合成设置 | 行列=[4,2] | 组='合成设置' | 对齐模式=0 | 选项=['启用合成','避开同系','启用星光','222→3','启用公式'] | 选中=[0]}
{组 | 技能组替换 | 布局='设置2' | 对齐模式=0}
{单选 | 技能组替换 | 组='技能组替换' | 行列=[3,1] | 对齐模式=0 | 选项=['1→2','2→3','1→3'] | 选中=[1]}
{标签|替换技能的罪人为队伍前七人\n\n不建议启用公式合成\n除非你费用真的很多\n否则大概率和普通合成互卡\n且就算很多\n也会被其他饰品卡|布局='设置2'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}

//星恩设置
{垂直布局 | 星恩设置 | 页面='分页.星恩设置' | 对齐模式=0}

{水平布局 | 星恩设置1 | 布局='星恩设置' | 对齐模式=0}
{组|起始之星|布局='星恩设置1'|对齐模式=5|样式='color:rgb(255,221,0);font-weight:500;font-size:14px;'}
{网格布局 | 星恩1 | 组='起始之星' | 对齐模式=0 | 行列=[2,1]}
{组 | 开关 | 布局='星恩1' | 对齐模式=0}
{多选|星恩1开关|行列=[1,1]|组='开关'|对齐模式=5|选项=['启用(10)']|选中=[0]}
{组 | 强化 | 布局='星恩1' | 对齐模式=0}
{多选|星恩1强化|行列=[2,1]|组='强化'|对齐模式=5|选项=['+(20)','++(30)']|选中=[0]}

{组|累积的星群|布局='星恩设置1'|对齐模式=5|样式='color:rgb(255,221,0);font-weight:500;font-size:14px;'}
{网格布局 | 星恩2 | 组='累积的星群' | 对齐模式=0 | 行列=[2,1]}
{组 | 开关 | 布局='星恩2' | 对齐模式=0}
{多选|星恩2开关|行列=[1,1]|组='开关'|对齐模式=5|选项=['启用(10)']|选中=[0]}
{组 | 强化 | 布局='星恩2' | 对齐模式=0}
{多选|星恩2强化|行列=[2,1]|组='强化'|对齐模式=5|选项=['+(20)','++(30)']|选中=[0]}

{组|星间旅行|布局='星恩设置1'|对齐模式=5|样式='color:rgb(255,187,0);font-weight:500;font-size:14px;'}
{网格布局 | 星恩3 | 组='星间旅行' | 对齐模式=0 | 行列=[2,1]}
{组 | 开关 | 布局='星恩3' | 对齐模式=0}
{多选|星恩3开关|行列=[1,1]|组='开关'|对齐模式=5|选项=['启用(20)']|选中=[0]}
{组 | 强化 | 布局='星恩3' | 对齐模式=0}
{多选|星恩3强化|行列=[2,1]|组='强化'|对齐模式=5|选项=['+(40)','++(60)']|选中=[0]}

{组|倾盆的流星|布局='星恩设置1'|对齐模式=5|样式='color:rgb(255,187,0);font-weight:500;font-size:14px;'}
{网格布局 | 星恩4 | 组='倾盆的流星' | 对齐模式=0 | 行列=[2,1]}
{组 | 开关 | 布局='星恩4' | 对齐模式=0}
{多选|星恩4开关|行列=[1,1]|组='开关'|对齐模式=5|选项=['启用(20)']|选中=[0]}
{组 | 强化 | 布局='星恩4' | 对齐模式=0}
{多选|星恩4强化|行列=[2,1]|组='强化'|对齐模式=5|选项=['+(40)','++(60)']|选中=[0]}

{组|双星系商店|布局='星恩设置1'|对齐模式=5|样式='color:rgb(255,153,0);font-weight:500;font-size:14px;'}
{网格布局 | 星恩5 | 组='双星系商店' | 对齐模式=0 | 行列=[2,1]}
{组 | 开关 | 布局='星恩5' | 对齐模式=0}
{多选|星恩5开关|行列=[1,1]|组='开关'|对齐模式=5|选项=['启用(30)']|选中=[0]}
{组 | 强化 | 布局='星恩5' | 对齐模式=0}
{多选|星恩5强化|行列=[2,1]|组='强化'|对齐模式=5|选项=['+(60)','++(90)']|选中=[0]}

{水平布局 | 星恩设置2 | 布局='星恩设置' | 对齐模式=0}
{组|卫星系商店|布局='星恩设置2'|对齐模式=5|样式='color:rgb(255,153,0);font-weight:500;font-size:14px;'}
{网格布局 | 星恩6 | 组='卫星系商店' | 对齐模式=0 | 行列=[2,1]}
{组 | 开关 | 布局='星恩6' | 对齐模式=0}
{多选|星恩6开关|行列=[1,1]|组='开关'|对齐模式=5|选项=['启用(30)']|选中=[0]}
{组 | 强化 | 布局='星恩6' | 对齐模式=0}
{多选|星恩6强化|行列=[2,1]|组='强化'|对齐模式=5|选项=['+(60)','++(90)']|选中=[0]}

{组|星云的宠爱|布局='星恩设置2'|对齐模式=5|样式='color:rgb(255,123,0);font-weight:500;font-size:14px;'}
{网格布局 | 星恩7 | 组='星云的宠爱' | 对齐模式=0 | 行列=[2,1]}
{组 | 开关 | 布局='星恩7' | 对齐模式=0}
{多选|星恩7开关|行列=[1,1]|组='开关'|对齐模式=5|选项=['启用(40)']|选中=[0]}
{组 | 强化 | 布局='星恩7' | 对齐模式=0}
{多选|星恩7强化|行列=[2,1]|组='强化'|对齐模式=5|选项=['+(80)','++(120)']|选中=[0]}

{组|星光的指引|布局='星恩设置2'|对齐模式=5|样式='color:rgb(255,123,0);font-weight:500;font-size:14px;'}
{网格布局 | 星恩8 | 组='星光的指引' | 对齐模式=0 | 行列=[2,1]}
{组 | 开关 | 布局='星恩8' | 对齐模式=0}
{多选|星恩8开关|行列=[1,1]|组='开关'|对齐模式=5|选项=['启用(40)']|选中=[0]}
{组 | 强化 | 布局='星恩8' | 对齐模式=0}
{多选|星恩8强化|行列=[2,1]|组='强化'|对齐模式=5|选项=['+(80)','++(120)']|选中=[0]}

{组|偶然的彗星|布局='星恩设置2'|对齐模式=5|样式='color:rgb(255,72,0);font-weight:500;font-size:14px;'}
{网格布局 | 星恩9 | 组='偶然的彗星' | 对齐模式=0 | 行列=[2,1]}
{组 | 开关 | 布局='星恩9' | 对齐模式=0}
{多选|星恩9开关|行列=[1,1]|组='开关'|对齐模式=5|选项=['启用(50)']|选中=[0]}
{组 | 强化 | 布局='星恩9' | 对齐模式=0}
{多选|星恩9强化|行列=[2,1]|组='强化'|对齐模式=5|选项=['+(100)','++(150)']|选中=[0]}

{组|完全的可能性|布局='星恩设置2'|对齐模式=5|样式='color:rgb(255,0,0);font-weight:500;font-size:14px;'}
{网格布局 | 星恩10 | 组='完全的可能性' | 对齐模式=0 | 行列=[2,1]}
{组 | 开关 | 布局='星恩10' | 对齐模式=0}
{多选|星恩10开关|行列=[1,1]|组='开关'|对齐模式=5|选项=['启用(60)']|选中=[0]}
{组 | 强化 | 布局='星恩10' | 对齐模式=0}
{多选|星恩10强化|行列=[2,1]|组='强化'|对齐模式=5|选项=['+(120)','++(180)']|选中=[0]}

//饰品观测
{垂直布局 | 饰品观测 | 页面='分页.饰品观测' | 对齐模式=0}

{水平布局 | 设置1 | 布局='饰品观测' | 对齐模式=1}

{组 | 独立开关 | 布局='设置1' | 对齐模式=0}
{多选 | 独立开关 | 组='独立开关' | 行列=[3,1] | 对齐模式=0 | 选项=['启用1','启用2','启用3'] | 选中=[0]}

{组 | 观测体系 | 布局='设置1' | 对齐模式=0}
{垂直布局 | 观测2 | 组='观测体系' | 对齐模式=0}
{组 | 观测体系1 | 布局='观测2' | 对齐模式=0}
{下拉框 | 观测体系1 | 组='观测体系1' | 对齐模式=0 | 选项=['空','观测-烧伤','观测-流血','观测-震颤','观测-破裂','观测-沉沦','观测-呼吸','观测-充能','观测-泛用'] | 选中=0}
{组 | 观测体系2 | 布局='观测2' | 对齐模式=0}
{下拉框 | 观测体系2 | 组='观测体系2' | 对齐模式=0 | 选项=['空','观测-烧伤','观测-流血','观测-震颤','观测-破裂','观测-沉沦','观测-呼吸','观测-充能','观测-泛用'] | 选中=0}
{组 | 观测体系3 | 布局='观测2' | 对齐模式=0}
{下拉框 | 观测体系3 | 组='观测体系3' | 对齐模式=0 | 选项=['空','观测-烧伤','观测-流血','观测-震颤','观测-破裂','观测-沉沦','观测-呼吸','观测-充能','观测-泛用'] | 选中=0}

{组 | 观测选择 | 布局='设置1' | 对齐模式=0}
{垂直布局 | 观测1 | 组='观测选择' | 对齐模式=0}
{组 | 观测饰品1 | 布局='观测1' | 对齐模式=0}
{下拉框 | 观测饰品1 | 组='观测饰品1' | 对齐模式=0 | 选项=['空','雾化吸入器','赤红纠缠的蜘蛛巢','翼形蜡烛','饰品自定义1','饰品自定义2','饰品自定义3'] | 选中=0}
{组 | 观测饰品2 | 布局='观测1' | 对齐模式=0}
{下拉框 | 观测饰品2 | 组='观测饰品2' | 对齐模式=0 | 选项=['空','雾化吸入器','赤红纠缠的蜘蛛巢','翼形蜡烛','饰品自定义1','饰品自定义2','饰品自定义3'] | 选中=0}
{组 | 观测饰品3 | 布局='观测1' | 对齐模式=0}
{下拉框 | 观测饰品3 | 组='观测饰品3' | 对齐模式=0 | 选项=['空','雾化吸入器','赤红纠缠的蜘蛛巢','翼形蜡烛','饰品自定义1','饰品自定义2','饰品自定义3'] | 选中=0}

{组 | 观测白名 | 布局='设置1' | 对齐模式=0}
{垂直布局 | 观测3 | 组='观测白名' | 对齐模式=0}
{组 | 观测白名1 | 布局='观测3' | 对齐模式=0}
{下拉框 | 观测白名1 | 组='观测白名1' | 对齐模式=0 | 选项=['空','合成-雾化吸入器','合成-赤红纠缠的蜘蛛巢','合成-翼形蜡烛','合成-饰品自定义1','合成-饰品自定义2','合成-饰品自定义3'] | 选中=0}
{组 | 观测白名2 | 布局='观测3' | 对齐模式=0}
{下拉框 | 观测白名2 | 组='观测白名2' | 对齐模式=0 | 选项=['空','合成-雾化吸入器','合成-赤红纠缠的蜘蛛巢','合成-翼形蜡烛','合成-饰品自定义1','合成-饰品自定义2','合成-饰品自定义3'] | 选中=0}
{组 | 观测白名3 | 布局='观测3' | 对齐模式=0}
{下拉框 | 观测白名3 | 组='观测白名3' | 对齐模式=0 | 选项=['空','合成-雾化吸入器','合成-赤红纠缠的蜘蛛巢','合成-翼形蜡烛','合成-饰品自定义1','合成-饰品自定义2','合成-饰品自定义3'] | 选中=0}

{水平布局 | 设置2 | 布局='饰品观测' | 对齐模式=1}
{组 | 观测开关 | 布局='设置2' | 对齐模式=0}
{单选 | 观测开关 | 组='观测开关' | 行列=[4,1] | 对齐模式=0 | 选项=['启用','禁用'] | 选中=[0,1]}

{组 | 速刷设置 | 布局='设置2' | 对齐模式=1}
{单选 | 速刷设置 | 行列=[3,1] | 组='速刷设置' | 对齐模式=0 | 选项=['三层转困难','四层转困难','禁用'] | 选中=[0,0,1]}
{标签|必须每行严格对应,必须从上往下启用\n1+2体系的观测,2必须位于下两行\n\n白名单独立设置是因不可抗力导致的下策|布局='设置2'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}

//队伍轮换
{垂直布局 | 队伍设置 | 页面='分页.队伍设置' | 对齐模式=1}

{水平布局 | 喵否1 | 布局='队伍设置' | 对齐模式=1}
{组 | 轮换选项 | 布局='喵否1' | 对齐模式=0}
{网格布局 | 设置1 | 组='轮换选项' | 行列=[2,2] | 对齐模式=0}
{组 | 启用[始] | 布局='设置1' | 对齐模式=0}
{下拉框 | 启用[始] | 组='启用[始]' | 对齐模式=0 | 选项=['1','2','3','4','5','6'] | 选中=0 | 提示='启用队伍'}
{组 | 本次初始 | 布局='设置1' | 对齐模式=0}
{下拉框 | 轮换初始队伍 | 组='本次初始' | 对齐模式=0 | 选项=['1','2','3','4','5','6'] | 选中=0 | 提示='轮换初始队伍'}
{组 | 启用[终] | 布局='设置1' | 对齐模式=0}
{下拉框 | 启用[终] | 组='启用[终]' | 对齐模式=0 | 选项=['1','2','3','4','5','6'] | 选中=0 | 提示='启用队伍'}
{标签|启用轮换:\n体系,合成跟随队伍\n仅支持1~6队|布局='设置1'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}
{组 | 非轮换队 | 布局='喵否1' | 对齐模式=0}
{网格布局 | 设置1 | 组='非轮换队' | 行列=[2,6] | 对齐模式=0}
{组 | 1 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人1 | 组='1' | 对齐模式=0}
{下拉框 | 非轮换队选人1 | 布局='非轮换队选人1' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 2 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人2 | 组='2' | 对齐模式=0}
{下拉框 | 非轮换队选人2 | 布局='非轮换队选人2' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 3 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人3 | 组='3' | 对齐模式=0}
{下拉框 | 非轮换队选人3 | 布局='非轮换队选人3' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 4 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人4 | 组='4' | 对齐模式=0}
{下拉框 | 非轮换队选人4 | 布局='非轮换队选人4' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 5 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人5 | 组='5' | 对齐模式=0}
{下拉框 | 非轮换队选人5 | 布局='非轮换队选人5' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 6 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人6 | 组='6' | 对齐模式=0}
{下拉框 | 非轮换队选人6 | 布局='非轮换队选人6' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}

{组 | 7 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人7 | 组='7' | 对齐模式=0}
{下拉框 | 非轮换队选人7 | 布局='非轮换队选人7' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 8 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人8 | 组='8' | 对齐模式=0}
{下拉框 | 非轮换队选人8 | 布局='非轮换队选人8' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 9 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人9 | 组='9' | 对齐模式=0}
{下拉框 | 非轮换队选人9 | 布局='非轮换队选人9' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 10 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人10 | 组='10' | 对齐模式=0}
{下拉框 | 非轮换队选人10 | 布局='非轮换队选人10' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 11 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人11 | 组='11' | 对齐模式=0}
{下拉框 | 非轮换队选人11 | 布局='非轮换队选人11' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 12 | 布局='设置1' | 对齐模式=0}
{水平布局 | 非轮换队选人12 | 组='12' | 对齐模式=0}
{下拉框 | 非轮换队选人12 | 布局='非轮换队选人12' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}

{水平布局 | 喵否2 | 布局='队伍设置' | 对齐模式=0}
{组 | 一队 | 布局='喵否2' | 对齐模式=0}
{网格布局 | 设置2 | 组='一队' | 行列=[1,3] | 对齐模式=0}
{组 | 一队体系1 | 布局='设置2' | 对齐模式=0}
{水平布局 | 一队顺位1 | 组='一队体系1' | 对齐模式=0}
{下拉框 | 一队顺位1 | 布局='一队顺位1' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 一队体系2 | 布局='设置2' | 对齐模式=0}
{水平布局 | 一队顺位2 | 组='一队体系2' | 对齐模式=0}
{下拉框 | 一队顺位2 | 布局='一队顺位2' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 二队 | 布局='喵否2' | 对齐模式=0}
{网格布局 | 设置2 | 组='二队' | 行列=[1,3] | 对齐模式=0}
{组 | 二队体系1 | 布局='设置2' | 对齐模式=0}
{水平布局 | 二队顺位1 | 组='二队体系1' | 对齐模式=0}
{下拉框 | 二队顺位1 | 布局='二队顺位1' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 二队体系2 | 布局='设置2' | 对齐模式=0}
{水平布局 | 二队顺位2 | 组='二队体系2' | 对齐模式=0}
{下拉框 | 二队顺位2 | 布局='二队顺位2' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 三队 | 布局='喵否2' | 对齐模式=0}
{网格布局 | 设置2 | 组='三队' | 行列=[1,3] | 对齐模式=0}
{组 | 三队体系1 | 布局='设置2' | 对齐模式=0}
{水平布局 | 三队顺位1 | 组='三队体系1' | 对齐模式=0}
{下拉框 | 三队顺位1 | 布局='三队顺位1' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 三队体系2 | 布局='设置2' | 对齐模式=0}
{水平布局 | 三队顺位2 | 组='三队体系2' | 对齐模式=0}
{下拉框 | 三队顺位2 | 布局='三队顺位2' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}

{水平布局 | 喵否3 | 布局='队伍设置' | 对齐模式=0}
{组 | 四队 | 布局='喵否3' | 对齐模式=0}
{网格布局 | 设置2 | 组='四队' | 行列=[1,3] | 对齐模式=0}
{组 | 四队体系1 | 布局='设置2' | 对齐模式=0}
{水平布局 | 四队顺位1 | 组='四队体系1' | 对齐模式=0}
{下拉框 | 四队顺位1 | 布局='四队顺位1' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 四队体系2 | 布局='设置2' | 对齐模式=0}
{水平布局 | 四队顺位2 | 组='四队体系2' | 对齐模式=0}
{下拉框 | 四队顺位2 | 布局='四队顺位2' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 五队 | 布局='喵否3' | 对齐模式=0}
{网格布局 | 设置2 | 组='五队' | 行列=[1,3] | 对齐模式=0}
{组 | 五队体系1 | 布局='设置2' | 对齐模式=0}
{水平布局 | 五队顺位1 | 组='五队体系1' | 对齐模式=0}
{下拉框 | 五队顺位1 | 布局='五队顺位1' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 五队体系2 | 布局='设置2' | 对齐模式=0}
{水平布局 | 五队顺位2 | 组='五队体系2' | 对齐模式=0}
{下拉框 | 五队顺位2 | 布局='五队顺位2' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 六队 | 布局='喵否3' | 对齐模式=0}
{网格布局 | 设置2 | 组='六队' | 行列=[1,3] | 对齐模式=0}
{组 | 六队体系1 | 布局='设置2' | 对齐模式=0}
{水平布局 | 六队顺位1 | 组='六队体系1' | 对齐模式=0}
{下拉框 | 六队顺位1 | 布局='六队顺位1' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}
{组 | 六队体系2 | 布局='设置2' | 对齐模式=0}
{水平布局 | 六队顺位2 | 组='六队体系2' | 对齐模式=0}
{下拉框 | 六队顺位2 | 布局='六队顺位2' | 对齐模式=0 | 选项=['烧伤','流血','震颤','破裂','沉沦','呼吸','充能','斩击','刺击','打击','空'] | 选中=10}

//EGO设置
{水平布局 | EGO设置 | 页面='分页.EGO设置' | 对齐模式=0}
{组 | 输出ego设置 | 布局='EGO设置' | 对齐模式=0}
{网格布局 | 输出ego | 组='输出ego设置' | 对齐模式=0 | 行列=[4,1]}
{组 | 输出1位 | 布局='输出ego' | 对齐模式=0}
{下拉框 | 输出1位 | 组='输出1位' | 对齐模式=0 | 选项=['空','EGO_箱_WAW','EGO_堂_WAW_侵蚀','EGO_堂_WAW','EGO_夫_WAW','EGO_玛_WAW','EGO_奥_HE','EGO_奥_WAW'] | 选中=0}
{组 | 输出2位 | 布局='输出ego' | 对齐模式=0}
{下拉框 | 输出2位 | 组='输出2位' | 对齐模式=0 | 选项=['空','EGO_箱_WAW','EGO_堂_WAW_侵蚀','EGO_堂_WAW','EGO_夫_WAW','EGO_玛_WAW','EGO_奥_HE','EGO_奥_WAW'] | 选中=0}
{组 | 输出3位 | 布局='输出ego' | 对齐模式=0}
{下拉框 | 输出3位 | 组='输出3位' | 对齐模式=0 | 选项=['空','EGO_箱_WAW','EGO_堂_WAW_侵蚀','EGO_堂_WAW','EGO_夫_WAW','EGO_玛_WAW','EGO_奥_HE','EGO_奥_WAW'] | 选中=0}
{组 | 第五层释放EGO种类 | 布局='输出ego' | 对齐模式=0}
{多选 | 第五层释放EGO种类 | 组='第五层释放EGO种类' | 行列=[3,1] | 对齐模式=1 | 选项=['输出型','回复型'] | 选中=[1,0]}
{组 | 回复ego设置 | 布局='EGO设置' | 对齐模式=0}
{网格布局 | 回复ego | 组='回复ego设置' | 对齐模式=0 | 行列=[4,1]}
{组 | 回复1位 | 布局='回复ego' | 对齐模式=0}
{下拉框 | 回复1位 | 组='回复1位' | 对齐模式=0 | 选项=['空','EGO_浮_HE','EGO_默_HE','EGO_罗_HE','EGO_辛_HE'] | 选中=0}
{组 | 回复2位 | 布局='回复ego' | 对齐模式=0}
{下拉框 | 回复2位 | 组='回复2位' | 对齐模式=0 | 选项=['空','EGO_浮_HE','EGO_默_HE','EGO_罗_HE','EGO_辛_HE'] | 选中=0}
{组 | 回复3位 | 布局='回复ego' | 对齐模式=0}
{下拉框 | 回复3位 | 组='回复3位' | 对齐模式=0 | 选项=['空','EGO_浮_HE','EGO_默_HE','EGO_罗_HE','EGO_辛_HE'] | 选中=0}
{组 | 混乱释放EGO种类 | 布局='回复ego' | 对齐模式=0}
{多选 | 混乱释放EGO种类 | 组='混乱释放EGO种类' | 行列=[3,1] | 对齐模式=1 | 选项=['输出型','回复型'] | 选中=[0,1]}
{组 | 释放设置 | 布局='EGO设置' | 对齐模式=0}
{网格布局 | 释放设置2 | 组='释放设置' | 对齐模式=1 | 行列=[4,1]}
{组 | 第五层释放EGO场景 | 布局='释放设置2' | 对齐模式=1}
{多选 | 第五层释放EGO场景 | 组='第五层释放EGO场景' | 行列=[3,1] | 对齐模式=1 | 选项=['链条战','集中战'] | 选中=[1,1]}
{组 | 释放开关 | 布局='释放设置2' | 对齐模式=0}
{多选 | 释放开关 | 组='释放开关' | 行列=[4,1] | 对齐模式=1 | 选项=['第五层开始释放EGO','EGO只释放一次','友方混乱使用EGO'] | 选中=[0,0,0]}
{标签|可能存在bug\n仅支持部分人格,且不会很勤快\n需同步3卡面\n拉曼却公主为同步1卡面\n\n添加人格请参考原有方式\n位置在[EGO_{罪人}_{EGO等级}]\n添加过多可能导致无法识别|布局='释放设置2'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}


//轮换选人
{垂直布局 | 轮换选人 | 页面='分页.轮换选人' | 对齐模式=1}

{水平布局 | 喵否选人1 | 布局='轮换选人' | 对齐模式=1}
{组 | 1 | 布局='喵否选人1' | 对齐模式=0}
{水平布局 | 一队选人1 | 组='1' | 对齐模式=0}
{下拉框 | 一队选人1 | 布局='一队选人1' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 2 | 布局='喵否选人1' | 对齐模式=0}
{水平布局 | 一队选人2 | 组='2' | 对齐模式=0}
{下拉框 | 一队选人2 | 布局='一队选人2' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 3 | 布局='喵否选人1' | 对齐模式=0}
{水平布局 | 一队选人3 | 组='3' | 对齐模式=0}
{下拉框 | 一队选人3 | 布局='一队选人3' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 4 | 布局='喵否选人1' | 对齐模式=0}
{水平布局 | 一队选人4 | 组='4' | 对齐模式=0}
{下拉框 | 一队选人4 | 布局='一队选人4' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 5 | 布局='喵否选人1' | 对齐模式=0}
{水平布局 | 一队选人5 | 组='5' | 对齐模式=0}
{下拉框 | 一队选人5 | 布局='一队选人5' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 6 | 布局='喵否选人1' | 对齐模式=0}
{水平布局 | 一队选人6 | 组='6' | 对齐模式=0}
{下拉框 | 一队选人6 | 布局='一队选人6' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 7 | 布局='喵否选人1' | 对齐模式=0}
{水平布局 | 一队选人7 | 组='7' | 对齐模式=0}
{下拉框 | 一队选人7 | 布局='一队选人7' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 8 | 布局='喵否选人1' | 对齐模式=0}
{水平布局 | 一队选人8 | 组='8' | 对齐模式=0}
{下拉框 | 一队选人8 | 布局='一队选人8' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{标签|一队|布局='喵否选人1'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}
{水平布局 | 喵否选人2 | 布局='轮换选人' | 对齐模式=1}
{组 | 1 | 布局='喵否选人2' | 对齐模式=0}
{水平布局 | 二队选人1 | 组='1' | 对齐模式=0}
{下拉框 | 二队选人1 | 布局='二队选人1' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 2 | 布局='喵否选人2' | 对齐模式=0}
{水平布局 | 二队选人2 | 组='2' | 对齐模式=0}
{下拉框 | 二队选人2 | 布局='二队选人2' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 3 | 布局='喵否选人2' | 对齐模式=0}
{水平布局 | 二队选人3 | 组='3' | 对齐模式=0}
{下拉框 | 二队选人3 | 布局='二队选人3' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 4 | 布局='喵否选人2' | 对齐模式=0}
{水平布局 | 二队选人4 | 组='4' | 对齐模式=0}
{下拉框 | 二队选人4 | 布局='二队选人4' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 5 | 布局='喵否选人2' | 对齐模式=0}
{水平布局 | 二队选人5 | 组='5' | 对齐模式=0}
{下拉框 | 二队选人5 | 布局='二队选人5' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 6 | 布局='喵否选人2' | 对齐模式=0}
{水平布局 | 二队选人6 | 组='6' | 对齐模式=0}
{下拉框 | 二队选人6 | 布局='二队选人6' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 7 | 布局='喵否选人2' | 对齐模式=0}
{水平布局 | 二队选人7 | 组='7' | 对齐模式=0}
{下拉框 | 二队选人7 | 布局='二队选人7' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 8 | 布局='喵否选人2' | 对齐模式=0}
{水平布局 | 二队选人8 | 组='8' | 对齐模式=0}
{下拉框 | 二队选人8 | 布局='二队选人8' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{标签|二队|布局='喵否选人2'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}
{水平布局 | 喵否选人3 | 布局='轮换选人' | 对齐模式=1}
{组 | 1 | 布局='喵否选人3' | 对齐模式=0}
{水平布局 | 三队选人1 | 组='1' | 对齐模式=0}
{下拉框 | 三队选人1 | 布局='三队选人1' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 2 | 布局='喵否选人3' | 对齐模式=0}
{水平布局 | 三队选人2 | 组='2' | 对齐模式=0}
{下拉框 | 三队选人2 | 布局='三队选人2' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 3 | 布局='喵否选人3' | 对齐模式=0}
{水平布局 | 三队选人3 | 组='3' | 对齐模式=0}
{下拉框 | 三队选人3 | 布局='三队选人3' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 4 | 布局='喵否选人3' | 对齐模式=0}
{水平布局 | 三队选人4 | 组='4' | 对齐模式=0}
{下拉框 | 三队选人4 | 布局='三队选人4' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 5 | 布局='喵否选人3' | 对齐模式=0}
{水平布局 | 三队选人5 | 组='5' | 对齐模式=0}
{下拉框 | 三队选人5 | 布局='三队选人5' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 6 | 布局='喵否选人3' | 对齐模式=0}
{水平布局 | 三队选人6 | 组='6' | 对齐模式=0}
{下拉框 | 三队选人6 | 布局='三队选人6' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 7 | 布局='喵否选人3' | 对齐模式=0}
{水平布局 | 三队选人7 | 组='7' | 对齐模式=0}
{下拉框 | 三队选人7 | 布局='三队选人7' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 8 | 布局='喵否选人3' | 对齐模式=0}
{水平布局 | 三队选人8 | 组='8' | 对齐模式=0}
{下拉框 | 三队选人8 | 布局='三队选人8' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{标签|三队|布局='喵否选人3'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}
{水平布局 | 喵否选人4 | 布局='轮换选人' | 对齐模式=1}
{组 | 1 | 布局='喵否选人4' | 对齐模式=0}
{水平布局 | 四队选人1 | 组='1' | 对齐模式=0}
{下拉框 | 四队选人1 | 布局='四队选人1' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 2 | 布局='喵否选人4' | 对齐模式=0}
{水平布局 | 四队选人2 | 组='2' | 对齐模式=0}
{下拉框 | 四队选人2 | 布局='四队选人2' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 3 | 布局='喵否选人4' | 对齐模式=0}
{水平布局 | 四队选人3 | 组='3' | 对齐模式=0}
{下拉框 | 四队选人3 | 布局='四队选人3' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 4 | 布局='喵否选人4' | 对齐模式=0}
{水平布局 | 四队选人4 | 组='4' | 对齐模式=0}
{下拉框 | 四队选人4 | 布局='四队选人4' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 5 | 布局='喵否选人4' | 对齐模式=0}
{水平布局 | 四队选人5 | 组='5' | 对齐模式=0}
{下拉框 | 四队选人5 | 布局='四队选人5' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 6 | 布局='喵否选人4' | 对齐模式=0}
{水平布局 | 四队选人6 | 组='6' | 对齐模式=0}
{下拉框 | 四队选人6 | 布局='四队选人6' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 7 | 布局='喵否选人4' | 对齐模式=0}
{水平布局 | 四队选人7 | 组='7' | 对齐模式=0}
{下拉框 | 四队选人7 | 布局='四队选人7' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 8 | 布局='喵否选人4' | 对齐模式=0}
{水平布局 | 四队选人8 | 组='8' | 对齐模式=0}
{下拉框 | 四队选人8 | 布局='四队选人8' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{标签|四队|布局='喵否选人4'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}
{水平布局 | 喵否选人5 | 布局='轮换选人' | 对齐模式=1}
{组 | 1 | 布局='喵否选人5' | 对齐模式=0}
{水平布局 | 五队选人1 | 组='1' | 对齐模式=0}
{下拉框 | 五队选人1 | 布局='五队选人1' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 2 | 布局='喵否选人5' | 对齐模式=0}
{水平布局 | 五队选人2 | 组='2' | 对齐模式=0}
{下拉框 | 五队选人2 | 布局='五队选人2' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 3 | 布局='喵否选人5' | 对齐模式=0}
{水平布局 | 五队选人3 | 组='3' | 对齐模式=0}
{下拉框 | 五队选人3 | 布局='五队选人3' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 4 | 布局='喵否选人5' | 对齐模式=0}
{水平布局 | 五队选人4 | 组='4' | 对齐模式=0}
{下拉框 | 五队选人4 | 布局='五队选人4' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 5 | 布局='喵否选人5' | 对齐模式=0}
{水平布局 | 五队选人5 | 组='5' | 对齐模式=0}
{下拉框 | 五队选人5 | 布局='五队选人5' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 6 | 布局='喵否选人5' | 对齐模式=0}
{水平布局 | 五队选人6 | 组='6' | 对齐模式=0}
{下拉框 | 五队选人6 | 布局='五队选人6' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 7 | 布局='喵否选人5' | 对齐模式=0}
{水平布局 | 五队选人7 | 组='7' | 对齐模式=0}
{下拉框 | 五队选人7 | 布局='五队选人7' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 8 | 布局='喵否选人5' | 对齐模式=0}
{水平布局 | 五队选人8 | 组='8' | 对齐模式=0}
{下拉框 | 五队选人8 | 布局='五队选人8' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{标签|五队|布局='喵否选人5'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}
{水平布局 | 喵否选人6 | 布局='轮换选人' | 对齐模式=1}
{组 | 1 | 布局='喵否选人6' | 对齐模式=0}
{水平布局 | 六队选人1 | 组='1' | 对齐模式=0}
{下拉框 | 六队选人1 | 布局='六队选人1' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 2 | 布局='喵否选人6' | 对齐模式=0}
{水平布局 | 六队选人2 | 组='2' | 对齐模式=0}
{下拉框 | 六队选人2 | 布局='六队选人2' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 3 | 布局='喵否选人6' | 对齐模式=0}
{水平布局 | 六队选人3 | 组='3' | 对齐模式=0}
{下拉框 | 六队选人3 | 布局='六队选人3' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 4 | 布局='喵否选人6' | 对齐模式=0}
{水平布局 | 六队选人4 | 组='4' | 对齐模式=0}
{下拉框 | 六队选人4 | 布局='六队选人4' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 5 | 布局='喵否选人6' | 对齐模式=0}
{水平布局 | 六队选人5 | 组='5' | 对齐模式=0}
{下拉框 | 六队选人5 | 布局='六队选人5' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 6 | 布局='喵否选人6' | 对齐模式=0}
{水平布局 | 六队选人6 | 组='6' | 对齐模式=0}
{下拉框 | 六队选人6 | 布局='六队选人6' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 7 | 布局='喵否选人6' | 对齐模式=0}
{水平布局 | 六队选人7 | 组='7' | 对齐模式=0}
{下拉框 | 六队选人7 | 布局='六队选人7' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{组 | 8 | 布局='喵否选人6' | 对齐模式=0}
{水平布局 | 六队选人8 | 组='8' | 对齐模式=0}
{下拉框 | 六队选人8 | 布局='六队选人8' | 对齐模式=0 | 选项=['空','箱','浮','堂','良','默','宝','夫','玛','罗','辛','奥','虫'] | 选中=0}
{标签|六队|布局='喵否选人6'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}

//开发者
{垂直布局 | 开发者 | 页面='分页.开发者' | 对齐模式=1}
{水平布局 | 开发1 | 布局='开发者' | 对齐模式=0}
{组 | 截图 | 布局='开发1' | 对齐模式=1}
{多选 | 截图 | 行列=[3,1] | 组='截图' | 对齐模式=0 | 选项=['商店截图','选择截图','卡包截图'] | 选中=[0]}
{组 | 测试功能 | 布局='开发1' | 对齐模式=1}
{多选 | 测试功能 | 行列=[4,2] | 组='测试功能' | 对齐模式=0 | 选项=['仅获取与升级白名单饰品','合成避开白名单饰品','2层后选择苦难','报酬选择随机饰品','搜寻2列事件'] | 选中=[0]}
{组 | 到点即停 | 布局='开发1' | 对齐模式=1}
{多选 | 到点即停 | 行列=[4,1] | 对齐模式=0 | 组='到点即停' | 选项=['到商店停','到四层停','到五层停'] | 选中=[0]}

{垂直布局 | 裚眳垀剒 | 页面='分页.裚眳垀剒' | 对齐模式=1}
{水平布局 | 喵需1 | 布局='裚眳垀剒' | 对齐模式=1}
{组 | 经验拉条[抗性编队需要] | 布局='喵需1' | 对齐模式=1}
{网格布局 | 经验1 | 组='经验拉条[抗性编队需要]' | 行列=[1,2] | 对齐模式=0}
{组 | 拉条开关 | 布局='经验1' | 对齐模式=1}
{多选 | 经验拉条开关 | 行列=[1,3] | 组='拉条开关' | 对齐模式=0 | 选项=['斩','刺','打'] | 选中=[0]}
{组 | 拉条回合 | 布局='经验1' | 对齐模式=1}
{网格布局 | 回合 | 组='拉条回合' | 对齐模式=1 | 行列=[1,3]}
{编辑框 | 斩击本 | 布局='回合' | 对齐模式=0 | 提示='斩击'}
{编辑框 | 刺击本 | 布局='回合' | 对齐模式=0 | 提示='刺击'}
{编辑框 | 打击本 | 布局='回合' | 对齐模式=0 | 提示='打击'}
{水平布局 | 喵需2 | 布局='裚眳垀剒' | 对齐模式=1}
{组 | 困牢设置 | 布局='喵需2' | 对齐模式=1}
{多选 | 困牢设置 | 行列=[4,1] | 组='困牢设置' | 对齐模式=0 | 选项=['睫紸羲','喵派卡包选择','五层取消拉条'] | 选中=[0]}
{组 | 杂项 | 布局='喵需2' | 对齐模式=1}
{多选 | 杂项 | 行列=[4,1] | 组='杂项' | 对齐模式=1 | 选项=['裚腔恁�瓚剿','集中战最低优先','不先升初始饰品','仅升四级饰品'] | 选中=[0]}
{标签|想知道有什么用？\n我只能说别用\n这不是面向大众的功能\n\n看不懂的东西绝对别用\n也不要问是什么功能,正常人用不上|布局='喵需2'|对齐模式=0|样式='color:rgb(12,96,121);font-weight:600;font-size:15px;'}
)

[设定]=(

{找图 | 返回 | 点击=['T',0,0,50] | 偏移=[20,0] | 循环=['T',10,500] | 范围=[[61,17,178,99]] | 图片=['退回','退回2',77]}
{找图 | 合成 | 点击=['T',658,736,50] | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}
{找图 | 活动关闭 | 点击=['T',1467,695,50] | 循环=['T',999,100] | 范围=[[1029,24,1555,426]] | 图片=['活动关闭',85]}
{赋值 | [[{'第一次经验本'},1],[{'第一次纺锤本'},1]]}
{赋值 | [[{'经验'},1]] | 开关={'经验跳过'}}
{赋值 | [[{'纺锤'},1]] | 开关={'纺锤跳过'}}
{赋值 | [[{'经验拉条'},1]] | 开关={'斩击拉条'}}
{赋值 | [[{'经验拉条'},1]] | 开关={'刺击拉条'}}
{赋值 | [[{'经验拉条'},1]] | 开关={'打击拉条'}}
{判断 | [[{'纺锤队伍选择'},'等于',1],{赋值=['T',[{'纺锤Y'},388]]}]}
{判断 | [[{'纺锤队伍选择'},'等于',2],{赋值=['T',[{'纺锤Y'},438]]}]}
{判断 | [[{'纺锤队伍选择'},'等于',3],{赋值=['T',[{'纺锤Y'},480]]}]}
{判断 | [[{'纺锤队伍选择'},'等于',4],{赋值=['T',[{'纺锤Y'},525]]}]}
{判断 | [[{'纺锤队伍选择'},'等于',5],{赋值=['T',[{'纺锤Y'},575]]}]}

{判断 | [[{'经验队伍选择'},'等于',1],{赋值=['T',[{'经验Y'},388]]}]}
{判断 | [[{'经验队伍选择'},'等于',2],{赋值=['T',[{'经验Y'},438]]}]}
{判断 | [[{'经验队伍选择'},'等于',3],{赋值=['T',[{'经验Y'},480]]}]}
{判断 | [[{'经验队伍选择'},'等于',4],{赋值=['T',[{'经验Y'},525]]}]}
{判断 | [[{'经验队伍选择'},'等于',5],{赋值=['T',[{'经验Y'},575]]}]}

{判断 | [[{'地牢队伍选择'},'等于',1],{赋值=['T',[{'地牢Y'},388]]}]}
{判断 | [[{'地牢队伍选择'},'等于',2],{赋值=['T',[{'地牢Y'},438]]}]}
{判断 | [[{'地牢队伍选择'},'等于',3],{赋值=['T',[{'地牢Y'},480]]}]}
{判断 | [[{'地牢队伍选择'},'等于',4],{赋值=['T',[{'地牢Y'},525]]}]}
{判断 | [[{'地牢队伍选择'},'等于',5],{赋值=['T',[{'地牢Y'},575]]}]}

{赋值 | [[{'自动拉条'},1]] | 开关={'拉条A'}}
{赋值 | [[{'自动拉条'},1]] | 开关={'拉条B'}}
{组 | '重置条件' | 开关={'地牢'}}
{跳转 | '运行'}
)

[重置条件]=(
{找图 | 活动关闭 | 点击=['T',1467,695,50] | 循环=['T',999,100] | 范围=[[1029,24,1555,426]] | 图片=['活动关闭',85]}
{赋值 | [[{'当前观测'},1],[{'观测数量'},0],[{'已观测数量'},0]]}
{空参 | 观1 | 赋值=['TF',[{'观测启用1-1'},{'观测启用1'}]] | 计算=['TF',[{'观测数量'},'+',1,{'观测数量'}]] | 开关={'观测启用1'}}
{空参 | 观2 | 赋值=['TF',[{'观测启用2-1'},{'观测启用2'}]] | 计算=['TF',[{'观测数量'},'+',1,{'观测数量'}]] | 开关={'观测启用2'}}
{空参 | 观3 | 赋值=['TF',[{'观测启用3-1'},{'观测启用3'}]] | 计算=['TF',[{'观测数量'},'+',1,{'观测数量'}]] | 开关={'观测启用3'}}
{赋值 | [[{'此事未成'},1],[{'防红玫瑰'},0]] | 开关={'良秀死全家[地牢]'}}
{赋值 | [[{'困难镜牢'},0],[{'普通镜牢'},1]] | 开关={'三层转困'}}
{赋值 | [[{'困难镜牢'},0],[{'普通镜牢'},1]] | 开关={'四层转困'}}
{赋值 | [[{'重新选人'},1]] | 开关={'入镜重新选人'}}
{赋值 | [[{'烧伤'},0],[{'流血'},0],[{'震颤'},0],[{'破裂'},0],[{'沉沦'},0],[{'呼吸'},0],[{'充能'},0],[{'斩击'},0],[{'刺击'},0],[{'打击'},0]]}
{赋值 | [[{'合成1'},0],[{'合成2'},0]]}
{赋值 | [[{'烧伤合成1'},0],[{'流血合成1'},0],[{'震颤合成1'},0],[{'破裂合成1'},0],[{'沉沦合成1'},0],[{'呼吸合成1'},0],[{'充能合成1'},0],[{'斩击合成1'},0],[{'刺击合成1'},0],[{'打击合成1'},0]]}
{赋值 | [[{'烧伤合成2'},0],[{'流血合成2'},0],[{'震颤合成2'},0],[{'破裂合成2'},0],[{'沉沦合成2'},0],[{'呼吸合成2'},0],[{'充能合成2'},0],[{'斩击合成2'},0],[{'刺击合成2'},0],[{'打击合成2'},0]]}
{赋值 | [[{'全选启用'},1],[{'星恩Y'},710],[{'星恩10+'},1],[{'星恩9+'},1],[{'星恩8+'},1],[{'星恩7+'},1],[{'星恩6+'},1],[{'星恩5+'},1],[{'星恩4+'},1],[{'星恩3+'},1],[{'星恩2+'},1],[{'星恩1+'},1]] | 开关={'星恩+'}}
{赋值 | [[{'全选启用'},1],[{'星恩Y'},744],[{'星恩10++'},1],[{'星恩9++'},1],[{'星恩8++'},1],[{'星恩7++'},1],[{'星恩6++'},1],[{'星恩5++'},1],[{'星恩4++'},1],[{'星恩3++'},1],[{'星恩2++'},1],[{'星恩1++'},1]] | 开关={'星恩++'}}
{赋值 | [[{'跳过星恩判断'},1],[{'星恩10'},1],[{'星恩9'},1],[{'星恩8'},1],[{'星恩7'},1],[{'星恩6'},1],[{'星恩5'},1],[{'星恩4'},1],[{'星恩3'},1],[{'星恩2'},1],[{'星恩1'},1]] | 开关={'全选启用'}}
{判断 | [[{'星光换经费'},'等于',0],{赋值=['T',[{'星光不换经费'},1]]}]}
{赋值 | [[{'星恩3刷新'},1]] | 开关={'星恩3+'}}
{赋值 | [[{'星恩3刷新'},2]] | 开关={'星恩3++'}}
{组 | '轮换条件' | 开关={'队伍轮换'}}
{赋值 | [[{'合成赋值'},0],[{'体系赋值'},1]]}
{组 | {'体系1'}}
{赋值 | [[{'起始体系X'},266],[{'起始体系Y'},209]] | 开关={'烧伤'}}
{赋值 | [[{'起始体系X'},453],[{'起始体系Y'},210]] | 开关={'流血'}}
{赋值 | [[{'起始体系X'},638],[{'起始体系Y'},206]] | 开关={'震颤'}}
{赋值 | [[{'起始体系X'},824],[{'起始体系Y'},208]] | 开关={'破裂'}}
{赋值 | [[{'起始体系X'},266],[{'起始体系Y'},462]] | 开关={'沉沦'}}
{赋值 | [[{'起始体系X'},452],[{'起始体系Y'},463]] | 开关={'呼吸'}}
{赋值 | [[{'起始体系X'},634],[{'起始体系Y'},464]] | 开关={'充能'}}
{赋值 | [[{'起始体系X'},823],[{'起始体系Y'},465]] | 开关={'斩击'}}
{赋值 | [[{'起始体系X'},264],[{'起始体系Y'},700]] | 开关={'刺击'}}
{赋值 | [[{'起始体系X'},451],[{'起始体系Y'},701]] | 开关={'打击'}}
{判断 | [[{'破裂'},'等于',1],{赋值=['T',[{'超绝哈基米哈气乱窜'},1]]}] | 开关={'符咒开'}}
{组 | {'体系2'}}
{赋值 | [[{'合成赋值'},1],[{'体系赋值'},0]]}
{赋值 | [[{'合成1'},1],[{'合成2'},0]]}
{组 | {'合成体系1'}}
{赋值 | [[{'合成1'},0],[{'合成2'},1]]}
{组 | {'合成体系2'}}
{赋值 | [[{'合成赋值'},0]]}
{赋值 | [[{'已合成1'},0],[{'已合成2'},0]]}
{赋值 | [[{'初始饰品升级完毕'},0]]}
{赋值 | [[{'初始饰品升级完毕'},1]] | 开关={'不先升初始'}}
{跳出 | 'TF'}
)

[轮换条件]=(

{判断 | [[{'启用队伍-终'},'小于',{'启用队伍-始'}],{赋值=['T',[{'启用队伍-终'},{'启用队伍-始'}]]}]}
{判断 | [[{'轮换队伍'},'小于',{'启用队伍-始'}],{赋值=['T',[{'轮换队伍'},{'启用队伍-始'}]]}]}
{判断 | [[{'轮换队伍'},'大于',{'启用队伍-终'}],{赋值=['T',[{'轮换队伍'},{'启用队伍-始'}]]}]}
{判断 | [[{'轮换队伍'},'等于',1],{赋值=['T',[{'体系1'},{'一队体系1'}],[{'体系2'},{'一队体系2'}],[{'合成体系1'},{'一队体系1'}],[{'合成体系2'},{'一队体系2'}],[{'地牢Y'},388],[{'起始饰品1'},{'一队饰品1'}],[{'起始饰品2'},{'一队饰品2'}],[{'起始饰品3'},{'一队饰品3'}]]}]}
{判断 | [[{'轮换队伍'},'等于',2],{赋值=['T',[{'体系1'},{'二队体系1'}],[{'体系2'},{'二队体系2'}],[{'合成体系1'},{'二队体系1'}],[{'合成体系2'},{'二队体系2'}],[{'地牢Y'},438],[{'起始饰品1'},{'二队饰品1'}],[{'起始饰品2'},{'二队饰品2'}],[{'起始饰品3'},{'二队饰品3'}]]}]}
{判断 | [[{'轮换队伍'},'等于',3],{赋值=['T',[{'体系1'},{'三队体系1'}],[{'体系2'},{'三队体系2'}],[{'合成体系1'},{'三队体系1'}],[{'合成体系2'},{'三队体系2'}],[{'地牢Y'},480],[{'起始饰品1'},{'三队饰品1'}],[{'起始饰品2'},{'三队饰品2'}],[{'起始饰品3'},{'三队饰品3'}]]}]}
{判断 | [[{'轮换队伍'},'等于',4],{赋值=['T',[{'体系1'},{'四队体系1'}],[{'体系2'},{'四队体系2'}],[{'合成体系1'},{'四队体系1'}],[{'合成体系2'},{'四队体系2'}],[{'地牢Y'},525],[{'起始饰品1'},{'四队饰品1'}],[{'起始饰品2'},{'四队饰品2'}],[{'起始饰品3'},{'四队饰品3'}]]}]}
{判断 | [[{'轮换队伍'},'等于',5],{赋值=['T',[{'体系1'},{'五队体系1'}],[{'体系2'},{'五队体系2'}],[{'合成体系1'},{'五队体系1'}],[{'合成体系2'},{'五队体系2'}],[{'地牢Y'},575],[{'起始饰品1'},{'五队饰品1'}],[{'起始饰品2'},{'五队饰品2'}],[{'起始饰品3'},{'五队饰品3'}]]}]}
{判断 | [[{'轮换队伍'},'等于',6],{赋值=['T',[{'体系1'},{'六队体系1'}],[{'体系2'},{'六队体系2'}],[{'合成体系1'},{'六队体系1'}],[{'合成体系2'},{'六队体系2'}],[{'地牢Y'},615],[{'起始饰品1'},{'六队饰品1'}],[{'起始饰品2'},{'六队饰品2'}],[{'起始饰品3'},{'六队饰品3'}]]}]}

{判断 | [[{'轮换队伍'},'等于',1],{赋值=['T',[{'角色顺位1'},{'一队选人1'}],[{'角色顺位2'},{'一队选人2'}],[{'角色顺位3'},{'一队选人3'}],[{'角色顺位4'},{'一队选人4'}],[{'角色顺位5'},{'一队选人5'}],[{'角色顺位6'},{'一队选人6'}],[{'角色顺位7'},{'一队选人7'}],[{'角色顺位8'},{'一队选人8'}]]}]}
{判断 | [[{'轮换队伍'},'等于',2],{赋值=['T',[{'角色顺位1'},{'二队选人1'}],[{'角色顺位2'},{'二队选人2'}],[{'角色顺位3'},{'二队选人3'}],[{'角色顺位4'},{'二队选人4'}],[{'角色顺位5'},{'二队选人5'}],[{'角色顺位6'},{'二队选人6'}],[{'角色顺位7'},{'二队选人7'}],[{'角色顺位8'},{'二队选人8'}]]}]}
{判断 | [[{'轮换队伍'},'等于',3],{赋值=['T',[{'角色顺位1'},{'三队选人1'}],[{'角色顺位2'},{'三队选人2'}],[{'角色顺位3'},{'三队选人3'}],[{'角色顺位4'},{'三队选人4'}],[{'角色顺位5'},{'三队选人5'}],[{'角色顺位6'},{'三队选人6'}],[{'角色顺位7'},{'三队选人7'}],[{'角色顺位8'},{'三队选人8'}]]}]}
{判断 | [[{'轮换队伍'},'等于',4],{赋值=['T',[{'角色顺位1'},{'四队选人1'}],[{'角色顺位2'},{'四队选人2'}],[{'角色顺位3'},{'四队选人3'}],[{'角色顺位4'},{'四队选人4'}],[{'角色顺位5'},{'四队选人5'}],[{'角色顺位6'},{'四队选人6'}],[{'角色顺位7'},{'四队选人7'}],[{'角色顺位8'},{'四队选人8'}]]}]}
{判断 | [[{'轮换队伍'},'等于',5],{赋值=['T',[{'角色顺位1'},{'五队选人1'}],[{'角色顺位2'},{'五队选人2'}],[{'角色顺位3'},{'五队选人3'}],[{'角色顺位4'},{'五队选人4'}],[{'角色顺位5'},{'五队选人5'}],[{'角色顺位6'},{'五队选人6'}],[{'角色顺位7'},{'五队选人7'}],[{'角色顺位8'},{'五队选人8'}]]}]}
{判断 | [[{'轮换队伍'},'等于',6],{赋值=['T',[{'角色顺位1'},{'六队选人1'}],[{'角色顺位2'},{'六队选人2'}],[{'角色顺位3'},{'六队选人3'}],[{'角色顺位4'},{'六队选人4'}],[{'角色顺位5'},{'六队选人5'}],[{'角色顺位6'},{'六队选人6'}],[{'角色顺位7'},{'六队选人7'}],[{'角色顺位8'},{'六队选人8'}]]}]}

{跳出 | 'TF'}
)
[运行]=(
//测试
//{跳转|'良秀全家活暗暗-纺锤'}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}

{组 | '日常开启' | 开关={'一次日常'}}
{组 | '日常开启' | 时间=[0,['大于','5:10:00'],['小于','6:30:00']] | 开关={'自动日常'}}
{组 | '模块合成' | 开关={'体力购买1'}}
{找色 | 体力条 | 跳转=['T模块合成'] | 范围=[[426,819,488,857]] | 颜色=['#00B940','10,0,#01CE46/1,13,#00BF41/11,12,#01BD41',80] | 开关={'模块合成'}}
{跳转 | '经验运行' | 开关={'经验'}}
{跳转 | '纺锤运行' | 开关={'纺锤'}}
{跳转 | '日常领取' | 开关={'日常领取'}}
{跳转 | '房间检索' | 开关={'地牢'}}
{空参 | 结束了}
{空参 | 停在结算换体力是正常的,因为停下时换不了}
{停止 | 脚本}
)

[模块合成]=(

{点击 | [487,841,50] | 延时=500}
{跳转 | '体力购买' | 开关={'体力购买1'}}
{空参 | 合成}
{点击 | [1008,413,50] | 延时=200}
{点击 | [972,668,50] | 延时=200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{点击 | [663,665,50,'2L'] | 延时=500}

{找图 | 直到加载 | 跳至=['T','结算','直到加载'] | 范围=[[318,240,550,379]] | 图片=['追加奖励',85]}
{跳转 | '运行'}
)

[体力购买]=(
{判断 | [[{'体力购买次数'},'等于',0],{赋值=['T',[{'体力购买1'},0]] | 跳出='T'}]}
{点击 | [795,281,50] | 延时=200}
{找图 | 第一次 | 赋值=['T',[{'体力已购买次数'},0]] | 范围=[[583,323,1056,448]] | 图片=['第一次体力购买',85]}
{找图 | 第二次 | 赋值=['T',[{'体力已购买次数'},1]] | 范围=[[583,323,1056,448]] | 图片=['第二次体力购买',85]}
{找图 | 第三次 | 赋值=['T',[{'体力已购买次数'},2]] | 范围=[[583,323,1056,448]] | 图片=['第三次体力购买',85]}
{找图 | 第四次 | 赋值=['T',[{'体力已购买次数'},3]] | 范围=[[583,323,1056,448]] | 图片=['第四次体力购买',85]}
{找图 | 第五次 | 赋值=['T',[{'体力已购买次数'},4]] | 范围=[[583,323,1056,448]] | 图片=['第五次体力购买',85]}
{找图 | 第六次 | 赋值=['T',[{'体力已购买次数'},5]] | 范围=[[583,323,1056,448]] | 图片=['第六次体力购买',85]}
{空参 | 确认购买}
{判断 | [[{'体力已购买次数'},'大于等于',{'体力购买次数'}],{跳至=['T','体力购买','买完了']}]}
{点击 | [964,668,50] | 延时=100}
{计算 | [[{'体力已购买次数'},'+',1,{'体力已购买次数'}]]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 200}
{判断 | [[{'体力已购买次数'},'小于',{'体力购买次数'}],{跳至=['T','体力购买','确认购买']}]}

{空参 | 买完了}
{赋值 | [[{'体力购买1'},0]]}
{点击 | [621,282,50] | 延时=200}
{跳至 | ['模块合成','合成']}
)

[重连]=(
{找图 | 重连 | 循环=['T',9999,100] | 范围=[[1280,43,1541,143]] | 图片=['重连',85]}
{找图 | 重连尝试 | 点击=['T',833,583,20] | 循环=['T',999,500] | 范围=[[730,337,1005,494],[1280,43,1541,143]] | 图片=['重连尝试','重连',85]}
{找图 | 重连失败 | 点击=['T',754,581,50,'2L'] | 跳至=['T','运行','结束了'] | 范围=[[730,337,1005,494]] | 图片=['重连失败','重连失败2',85]}
{延时 | 100}
{跳出 | 'TF'}
)

[■■■■处理-日常■■■■]=()

[日常开启]=(
{赋值 | [[{'自动日常'},0]]}
{赋值 | [[{'一次日常'},0]]}
{赋值 | [[{'经验'},1]]}
{赋值 | [[{'纺锤'},1]]}
{赋值 | [[{'经验次数'},{'一次日常经验次数'}]]}
{赋值 | [[{'纺锤次数'},{'一次日常纺锤次数'}]]}
{赋值 | [[{'经验跳过'},{'一次日常经验跳过'}]]}
{赋值 | [[{'纺锤跳过'},{'一次日常纺锤跳过'}]]}
{赋值 | [[{'第一次经验本'},1],[{'第一次纺锤本'},1]]}
{赋值 | [[{'日常领取'},1]]}
{赋值 | [[{'体力购买1'},1]] | 开关={'体力购买'}}
{赋值 | [[{'体力已购买次数'},0]]}
{组 | '邮箱' | 开关={'邮箱'}}
{跳出 | 'TF'}
)
[邮箱]=(
{找图 | 主页 | 跳出='F' | 范围=[[539,740,752,892]] | 图片=['主页1','主页2',75]}
{点击 | [1027,814,50,'2L']}
{找图 | 起始页 | 循环=['F',200,200] | 范围=[[1430,88,1562,225]] | 图片=['起始页','起始页2',75]}
{延时 | 300}
{找图 | 感叹号 | 点击=['T',0,0,50] | 偏移=[-20,20] | 跳出='F' | 延时=1000 | 范围=[[1356,87,1458,206]] | 图片=['感叹号','感叹号2',75]}
{点击 | [1209,685,50] | 延时=200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 500}
{按键 | ['enter',50]}
{延时 | 500}
{点击 | [968,685,50] | 延时=500}
{跳出 | 'TF'}
)
[日常领取]=(
{找图 | 返回 | 点击=['T',0,0,50] | 偏移=[20,0] | 循环=['T',3,1000] | 范围=[[1,1,265,136]] | 图片=['退回','退回2',77]}
//通行证任务
{空参 | 通行证}
{找图 | 主页 | 点击=['T',1027,814,50,'2L'] | 延时=500 | 范围=[[539,740,752,892]] | 图片=['主页1','主页2',75]}
{找图 | 去通行证界面 | 循环=['F',200,200] | 范围=[[1430,88,1562,225]] | 图片=['起始页','起始页2',85]}
{延时 | 300}
{点击 | [1300,300,40,'2L'] | 延时=500}
{点击 | [466,73,40,'2L'] | 延时=200}
{找图 | 领取奖励 | 点击=['T',0,0,50,'2L'] | 偏移=[-10,10] | 延时=200 | 范围=[[779,214,890,783]] | 图片=['感叹号','感叹号2',75]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 未圆满 | 跳至=['T','日常领取','领取奖励'] | 范围=[[779,214,890,783]] | 图片=['感叹号','感叹号2',75]}
{找图 | 周常奖励 | 点击=['T',0,0,50,'2L'] | 偏移=[-10,10] | 跳至=['T','日常领取','领取奖励'] | 延时=200 | 范围=[[306,392,385,480]] | 图片=['感叹号','感叹号2',75]}
{找图 | 跳至首页 | 跳转=['T运行'] | 延时=500 | 范围=[[539,740,752,892]] | 图片=['主页1','主页2',75]}
{赋值 | [[{'日常领取'},0]]}
{找图 | 返回 | 点击=['T',0,0,50] | 偏移=[20,0] | 循环=['T',3,1000] | 范围=[[61,17,178,99]] | 图片=['退回','退回2',77]}
{跳转 | '运行'}
)
[-=-=特殊处理=-=-]=()

[良秀全家活暗暗-经验]=(

{空参 | 经验}

{延时 | 200}

{找图 | 我说结束了 | 点击=['T',0,0,0] | 范围=[[588,305,999,613]] | 图片=['我说我赢了','我说我输了',80]}

{找图 | 重连尝试 | 组=['T经验结算'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 跳转=['T经验结算'] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',82]}
{找图 | 运转 | 跳转=['F良秀全家活暗暗-经验'] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{延时 | 200}
{找图 | 良死 | 赋值=['T',[{'此事未成'},0]] | 范围=[[2,118,86,222]] | 图片=['良死1','良死2','良死3',85]}

{找图 | 查找良秀 | 跳至=['F','良秀全家活暗暗-经验','经验跑路'] | 范围=[[170,766,1479,894]] | 图片=['良_地慧',75]}
{找图 | 点击良秀 | 点击=['T',0,0,50] | 范围=[[170,766,1479,894]] | 图片=['良_地慧',75] | 开关={'此事未成'}}
{找图 | 拉条起点 | 赋值=['T',[{'坐标X1'},{'x'}]] | 范围=[[76,656,805,777]] | 图片=['道中作战',75]}
{找图 | 拉条终点 | 赋值=['T',[{'坐标X2'},{'x'}]] | 范围=[[400,656,1535,893]] | 图片=['拉条终点',75]}

{赋值 | [[{'坐标Y1'},842]]}

{跳至 | ['良秀全家活暗暗-经验','良三完'] | 开关={'此事未成'}}
{找图 | 良三 | 赋值=['T',[{'坐标Y1'},{'y'}]] | 范围=[[266,630,1274,778]] | 图片=['良三1','良三2','良三3','良三4',75]}
{判断 | [[{'坐标Y1'},'大于',702],{赋值=['T',[{'坐标Y1'},842]]}]}
{判断 | [[{'坐标Y1'},'小于',702],{赋值=['T',[{'坐标Y1'},760]]}]}
{空参 | 良三完}

{点击 | ['T',{'坐标X1'},700,50,'L',1]}
{移动 | [{'坐标X1'},842,25]}
{移动 | [{'坐标X2'},842,25]}
{点击 | ['T',{'坐标X2'},700,0,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{移动 | [1500,800,200]}
{跳转 | '良秀全家活暗暗-经验'}

{空参 | 经验跑路}
{跳转 | '仪表盘重新赋值' | 开关={'经验拉条'}}
{跳转 | '经验战斗'}
)

[良秀全家活暗暗-纺锤]=(
{空参 | 纺锤}
{延时 | 200}
{找图 | 我说结束了 | 点击=['T',0,0,0] | 范围=[[588,305,999,613]] | 图片=['我说我赢了','我说我输了',80]}

{找图 | 事件 | 点击=['T',1500,800,0,'L',2] | 跳转=['T事件'] | 赋值=['T',[{'战斗中'},1]] | 范围=[[361,59,512,181]] | 图片=['事件',85]}
{找图 | 重连尝试 | 组=['T纺锤结算'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 跳转=['T纺锤结算'] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',82]}
{找图 | 运转 | 跳转=['F良秀全家活暗暗-纺锤'] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | bug | 点击=['T',1500,800,50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}

{延时 | 200}
{找图 | 良死 | 跳转=['T纺锤战斗'] | 范围=[[2,118,86,222]] | 图片=['良死1','良死2','良死3',84]}
{找图 | 查找良秀 | 跳转=['F纺锤战斗'] | 范围=[[170,766,1479,894]] | 图片=['良_地慧',75]}
{按键 | ['P',50]}
{找图 | 点击良秀 | 赋值=['T',[{'坐标X1'},{'x'}]] | 点击=['T',0,0,50] | 范围=[[170,766,1479,894]] | 图片=['良_地慧',75]}
{延时 | 200}
{移动 | [{'坐标X1'},740,25]}
{延时 | 100}
{组 | '判断部位'}
{空参 | 连接}
{移动 | [{'坐标X2'},{'坐标Y2'},25]}
{移动 | [{'坐标X2'},{'坐标Y2'},25]}
{跳至 | ['良秀全家活暗暗-纺锤','连接完成'] | 开关={'连接可行'}}
{延时 | 300}
{找图 | 单位等级 | 跳至=['T','良秀全家活暗暗-纺锤','连接完成'] | 范围=[[1487,5,1559,59]] | 图片=['单位等级',75]}
{计算 | [[{'尝试次数'},'+',1,{'尝试次数'}]]}
{判断 | [[{'尝试次数'},'等于',1],{计算=['T',[{'坐标X2'},'-',75,{'坐标X2'}]]}]}
{判断 | [[{'尝试次数'},'等于',2],{计算=['T',[{'坐标X2'},'+',150,{'坐标X2'}]]}]}
{判断 | [[{'尝试次数'},'等于',3],{跳至=['T','良秀全家活暗暗-纺锤','纺锤跑路']}]}
{跳至 | ['良秀全家活暗暗-纺锤','连接']}

{空参 | 连接完成}
{移动 | [{'坐标X2'},{'坐标Y2'},25]}
{延时 | 200}
{点击 | ['T',{'坐标X2'},{'坐标Y2'},0,'L',2]}
{延时 | 100}

{按键 | ['ENTER',50]}
{延时 | 1000}
{赋值 | [[{'尝试次数'},0],[{'连接可行'},0]]}

{移动 | [1500,800,200]}

{跳转 | '良秀全家活暗暗-纺锤'}

{空参 | 纺锤跑路}
{点击 | ['T',{'坐标X2'},{'坐标Y2'},0,'L',2]}
{延时 | 400}
{找图 | 点击良秀 | 点击=['T',0,0,50] | 范围=[[170,766,1479,894]] | 图片=['良_地慧',75]}
{跳转 | '纺锤战斗'}
)
[良秀全家活暗暗-地牢]=(
{空参 | 地牢}
{延时 | 200}
{找图 | 我说结束了 | 点击=['T',0,0,0] | 范围=[[588,305,999,613]] | 图片=['我说我赢了','我说我输了',80]}
{找图 | 暂时性处理 | 跳转=['T房间检索'] | 范围=[[466,27,1581,784]] | 图片=['地图','地图2','地图3','战后奖励选择','EGO饰品选择',85]}

{找图 | 事件 | 点击=['T',1500,800,0,'L',2] | 跳转=['T事件'] | 赋值=['T',[{'战斗中'},1]] | 范围=[[361,59,512,181]] | 图片=['事件',85]}
{找图 | 重连尝试 | 组=['T房间检索'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 跳转=['T房间检索'] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',82]}
{找图 | 运转 | 跳转=['F良秀全家活暗暗-地牢'] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | bug | 点击=['T',1500,800,50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}

{延时 | 200}
{找图 | 良死 | 赋值=['T',[{'此事未成'},0]] | 范围=[[2,118,86,222]] | 图片=['良死1','良死2','良死3',84]}
{判断 | [[{'此事未成'},'等于',0],{跳转=['T战斗N']}] | 开关={'集中战'}}
{跳至 | ['良秀全家活暗暗-地牢','链条'] | 开关={'链条战'}}
{跳至 | ['良秀全家活暗暗-地牢','集中'] | 开关={'集中战'}}

{空参 | 链条}
{找图 | 查找良秀 | 跳转=['F战斗N'] | 范围=[[170,766,1479,894]] | 图片=['良_地慧',75]}
{找图 | 点击良秀 | 点击=['T',0,0,50] | 范围=[[170,766,1479,894]] | 图片=['良_地慧',75] | 开关={'此事未成'}}
{找图 | 拉条起点 | 赋值=['T',[{'坐标X1'},{'x'}]] | 范围=[[76,656,805,777]] | 图片=['道中作战',75]}
{找图 | 拉条终点 | 赋值=['T',[{'坐标X2'},{'x'}]] | 范围=[[400,656,1535,893]] | 图片=['拉条终点',75]}

{赋值 | [[{'坐标Y1'},842]]}

{跳至 | ['良秀全家活暗暗-地牢','良三完'] | 开关={'此事未成'}}
{找图 | 良三 | 赋值=['T',[{'坐标Y1'},{'y'}]] | 范围=[[266,630,1274,778]] | 图片=['良三1','良三2','良三3','良三4',75]}
{判断 | [[{'坐标Y1'},'大于',702],{赋值=['T',[{'坐标Y1'},842]]}]}
{判断 | [[{'坐标Y1'},'小于',702],{赋值=['T',[{'坐标Y1'},760]]}]}
{空参 | 良三完}

{点击 | ['T',{'坐标X1'},700,50,'L',1]}
{移动 | [{'坐标X1'},{'坐标Y1'},25]}
{移动 | [{'坐标X2'},{'坐标Y1'},25]}
{点击 | ['T',{'坐标X2'},700,0,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['良秀全家活暗暗-地牢','移动']}

{空参 | 集中}
{找图 | 查找良秀 | 跳转=['F战斗N'] | 范围=[[170,766,1479,894]] | 图片=['良_地慧',75]}
{按键 | ['P',50]}
{找图 | 点击良秀 | 赋值=['T',[{'坐标X1'},{'x'}]] | 点击=['T',0,0,50] | 范围=[[170,766,1479,894]] | 图片=['良_地慧',75]}
{延时 | 200}
{移动 | [{'坐标X1'},740,25]}
{延时 | 100}
{组 | '判断部位'}
{空参 | 连接}
{移动 | [{'坐标X2'},{'坐标Y2'},25]}
{移动 | [{'坐标X2'},{'坐标Y2'},25]}
{跳至 | ['良秀全家活暗暗-地牢','连接完成'] | 开关={'连接可行'}}
{延时 | 300}
{找图 | 单位等级 | 跳至=['T','良秀全家活暗暗-地牢','连接完成'] | 范围=[[1487,5,1559,59]] | 图片=['单位等级',75]}
{计算 | [[{'尝试次数'},'+',1,{'尝试次数'}]]}
{判断 | [[{'尝试次数'},'等于',1],{计算=['T',[{'坐标X2'},'-',75,{'坐标X2'}]]}]}
{判断 | [[{'尝试次数'},'等于',2],{计算=['T',[{'坐标X2'},'+',150,{'坐标X2'}]]}]}
{判断 | [[{'尝试次数'},'等于',3],{跳至=['T','良秀全家活暗暗-地牢','集中跑路']}]}
{跳至 | ['良秀全家活暗暗-地牢','连接']}

{空参 | 连接完成}
{移动 | [{'坐标X2'},{'坐标Y2'},25]}
{延时 | 200}
{点击 | ['T',{'坐标X2'},{'坐标Y2'},0,'L',2]}
{延时 | 100}

{按键 | ['ENTER',50]}
{延时 | 1000}
{赋值 | [[{'尝试次数'},0],[{'连接可行'},0]]}
{跳至 | ['良秀全家活暗暗-地牢','移动']}

{空参 | 集中跑路}
{点击 | ['T',{'坐标X2'},{'坐标Y2'},0,'L',2]}
{延时 | 400}
{找图 | 点击良秀 | 点击=['T',0,0,50] | 范围=[[170,766,1479,894]] | 图片=['良_地慧',75]}
{跳转 | '战斗N'}

{空参 | 移动}

{移动 | [1500,800,200]}
{跳转 | '良秀全家活暗暗-地牢'}
)
[判断部位]=(
//下优先
{点击 | ['T',{'坐标X1'},740,50,'L',1]}
{延时 | 1300}
{找图 | 尾部 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}]] | 范围=[[596,3,1433,628]] | 图片=['部位-尾部',73]}
{找图 | 足部 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}]] | 范围=[[596,3,1433,628]] | 图片=['部位-足部','部位-足部2',73]}
{找图 | 右手 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}]] | 范围=[[596,3,1433,628]] | 图片=['部位-右手','部位-右手2','部位-右手3',73]}
{找图 | 左手 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}]] | 范围=[[596,3,1433,628]] | 图片=['部位-左手','部位-左手2','部位-左手3',73]}
{找图 | 背部 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}]] | 范围=[[596,3,1433,628]] | 图片=['部位-背部','部位-背部2',73]}
{找图 | 头部 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}]] | 范围=[[596,3,1433,628]] | 图片=['部位-头部','部位-头部2',73]}
{找图 | 躯干1 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}]] | 范围=[[596,3,1433,628]] | 图片=['部位-躯干','部位-躯干2','部位-躯干3','部位-躯干4','部位-躯干5',73]}
{找图 | 躯干2 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}]] | 范围=[[596,3,1433,628]] | 图片=['部位-躯干6','部位-躯干7','部位-躯干8','部位-躯干9','部位-躯干10',73]}
{找图 | 躯干3 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}]] | 范围=[[596,3,1433,628]] | 图片=['部位-躯干11',73]}
{计算 | [[{'坐标Y2'},'+',65,{'坐标Y2'}]]}
{找图 | 空槽 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}],[{'连接可行'},1]] | 范围=[[596,3,1433,628]] | 图片=['部位空槽1',75]}
{找图 | 混乱1 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}],[{'连接可行'},1]] | 范围=[[596,3,1433,628]] | 图片=['部位混乱1','部位混乱2','部位混乱3','部位混乱4','部位混乱5',75]}
{找图 | 混乱2 | 赋值=['T',[{'坐标X2'},{'x'}],[{'坐标Y2'},{'y'}],[{'连接可行'},1]] | 范围=[[596,3,1433,628]] | 图片=['部位混乱6','部位混乱7',75]}
{跳出 | 'TF'}
)

[-=-=经验处理=-=-]=()
[经验运行]=(
{点击 | [1232,805,50,'2L']}
{找图 | 驾驶席 | 循环=['F',25,200] | 范围=[[925,335,1081,496]] | 图片=['驾驶席',75]}
{找图 | 再点一次 | 跳转=['F经验运行'] | 范围=[[925,335,1081,496]] | 图片=['驾驶席',75]}
{延时 | 300}
{找图 | 没进去 | 点击=['T',559,251,50,'2L'] | 循环=['T',99,200] | 范围=[[925,335,1081,496]] | 图片=['驾驶席',75]}
{空参 | 准备}
{找图 | 采掘 | 循环=['F',999,100] | 范围=[[103,200,258,306]] | 图片=['采掘',85]}
{判断 | [[{'经验次数'},'小于等于',0],{赋值=['T',[{'经验'},0]] | 跳至=['F','经验运行','准备2']}] | 开关={'经验'}}
{判断 | [[{'纺锤次数'},'小于等于',0],{赋值=['T',[{'纺锤'},0]] | 跳转=['T日常领取'] | 跳至=['F','纺锤运行','准备']}] | 开关={'纺锤'}}
{空参 | 准备2}
{点击 | [188,337,50,'2L'] | 延时=500}
{找图 | 经验本-斩击 | 赋值=['T',[{'斩击经验'},1]] | 范围=[[1429,359,1555,493]] | 图片=['经验本-斩击',75]}
{找图 | 经验本-刺击 | 赋值=['T',[{'刺击经验'},1]] | 范围=[[1429,359,1555,493]] | 图片=['经验本-刺击',75]}
{找图 | 经验本-打击 | 赋值=['T',[{'打击经验'},1]] | 范围=[[1429,359,1555,493]] | 图片=['经验本-打击',75]}
{赋值 | [[{'拉条回合'},2]] | 开关={'经验拉条'}}

{空参 | 经验连战}
{判断 | [[{'经验连战'},'等于',0],{跳至=['T','经验运行','选队']}]}
{判断 | [[{'经验次数'},'小于',2],{跳至=['T','经验运行','选队']}]}
{找图 | 次数未展开 | 点击=['T',1327,320,50] | 延时=200 | 范围=[[1486,288,1529,339]] | 图片=['次数未展开1',85]}
{判断 | [[{'经验次数'},'小于',10],{跳至=['T','经验运行','次数小于10']}]}
{点击 | [1510,355,50] | 延时=100}
{赋值 | [[{'采掘次数变动'},10]]}
{跳至 | ['经验运行','选队']}

{空参 | 次数小于10}

//不知为何此方法仅在第一次进入时生效,结算后再次输入会出错
//{点击|[1390,355,50]|延时=200}
//{按键|[{'经验次数'},50]}

//只能退而求次循环点击了,反正消耗的时间差不多
{点击 | [1260,355,50] | 延时=100}
{计算 | [[{'经验次数'},'-',1,{'点击次数'}]]}
{找图 | 保证运行 | 点击=['T',1475,355,50] | 循环=['T',{'点击次数'},50] | 范围=[[103,200,258,306]] | 图片=['采掘',85]}

{延时 | 100}
{赋值 | [[{'采掘次数变动'},{'经验次数'}]]}

{空参 | 选队}
{跳转 | '经验跳过' | 开关={'经验跳过'}}
{点击 | [1403,599,50] | 延时=500}

{判断 | [[{'第一次经验本'},'等于',0],{跳至=['T','经验运行','开始']}]}
{赋值 | [[{'第一次经验本'},0]]}
{延时 | 300}
{点击 | ['T',162,394,50,'L',1]}
{移动 | [53,827,25]}
{点击 | ['T',53,827,0,'L',2] | 延时=400}
{点击 | ['T',217,{'经验Y'},50] | 跳至=['T','经验运行','开始'] | 开关={'经验队伍固定'}}
{找图 | 经验采掘 | 点击=['T',0,0,50] | 延时=50 | 范围=[[89,361,235,668]] | 图片=['经验采掘',75]}

{判断 | [[{'经验抗性编队'},'等于',0],{跳至=['T','经验运行','开始']}]}
{空参 | 尝试}
{点击 | [40,830,50] | 延时=100}
{空参 | 打击 | 判断=['T',[{'打击编队'},'等于',0],{跳至=['T','经验运行','刺击']}]}
{找图 | 队伍-打击 | 点击=['T',0,0,50] | 跳至=['T','经验运行','开始'] | 延时=200 | 范围=[[89,361,235,668]] | 图片=['队伍-打击',75] | 开关={'打击经验'}}
{空参 | 刺击 | 判断=['T',[{'刺击编队'},'等于',0],{跳至=['T','经验运行','斩击']}]}
{找图 | 队伍-刺击 | 点击=['T',0,0,50] | 跳至=['T','经验运行','开始'] | 延时=200 | 范围=[[89,361,235,668]] | 图片=['队伍-刺击',75] | 开关={'刺击经验'}}
{空参 | 斩击 | 判断=['T',[{'斩击编队'},'等于',0],{跳至=['T','经验运行','无']}]}
{找图 | 队伍-斩击 | 点击=['T',0,0,50] | 跳至=['T','经验运行','开始'] | 延时=200 | 范围=[[89,361,235,668]] | 图片=['队伍-斩击',75] | 开关={'斩击经验'}}
{空参 | 无}
{找图 | 经验采掘 | 点击=['T',0,0,50] | 赋值=['T',[{'经验已选择'},1]] | 延时=50 | 范围=[[89,361,235,668]] | 图片=['经验采掘',70]}
{判断 | [[{'经验已选择'},'等于',0],{跳至=['T','经验运行','检索']}]}
{判断 | [[{'斩击经验'},'等于',0],{跳至=['T','经验运行','开始']}] | 开关={'斩击经验'}}
{判断 | [[{'刺击经验'},'等于',0],{跳至=['T','经验运行','开始']}] | 开关={'刺击经验'}}
{判断 | [[{'打击经验'},'等于',0],{跳至=['T','经验运行','开始']}] | 开关={'打击经验'}}
{空参 | 检索}
{空参 | 次数计次 | 计次=['T','经验本选择',4,{赋值=['T',[{'第一次经验本'},0]] | 跳至=['T','经验运行','开始']}]}
{点击 | ['T',162,618,50,'L',1]}
{移动 | [53,388,7]}
{点击 | ['T',53,388,500,'L',2]}
{跳至 | ['经验运行','尝试']}

{空参 | 开始}
{点击 | [1431,753,50] | 延时=100}
{延时 | 100}
{移动 | [1500,800,200]}
{延时 | 200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 战斗中 | 循环=['F',999,100] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{赋值 | [[{'经验拉条回合'},0]]}
{赋值 | [[{'此事未成'},1]] | 开关={'良秀死全家[经验]'}}
{跳转 | '良秀全家活暗暗-经验' | 开关={'良秀死全家[经验]'}}
{跳转 | '仪表盘重新赋值' | 开关={'经验拉条'}}
{跳转 | '经验战斗'}
)
[经验跳过]=(
{点击 | [1403,645,50] | 延时=500}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',75]}
{跳转 | '经验结算'}
)
[经验战斗]=(
{找图 | P | 按键=['T','P',50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | ENTER | 按键=['T','ENTER',50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 我说结束了 | 点击=['T',0,0,50] | 范围=[[588,305,999,613]] | 图片=['我说我赢了','我说我输了',80]}

{找图 | 重连尝试 | 组=['T经验结算'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 跳转=['T经验结算'] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',85]}
{跳转 | '经验战斗'}

)
[经验结算]=(
{按键 | ['F12',50] | 开关={'结算时截图'}}

{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 循环=['T',999,200] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',85]}
{延时 | 800}

{赋值 | [[{'此事未成'},1]]}

{找图 | 失败 | 计算=['T',[{'经验次数'},'+',{'采掘次数变动'},{'经验次数'}]] | 范围=[[1291,135,1485,264]] | 图片=['失败',85]}
{找图 | 采掘 | 计算=['T',[{'经验次数'},'-',{'采掘次数变动'},{'经验次数'}]] | 按键=['F','ENTER',50] | 循环=['F',999,100] | 范围=[[103,200,258,306]] | 图片=['采掘',85]}

{判断 | [[{'经验次数'},'小于等于',0],{赋值=['T',[{'经验'},0],[{'经验已选择'},0]] | 跳至=['F','经验运行','准备']}] | 开关={'经验'}}
{判断 | [[{'纺锤次数'},'小于等于',0],{赋值=['T',[{'纺锤'},0],[{'纺锤已选择'},0]] | 跳至=['F','纺锤运行','准备']}] | 开关={'纺锤'}}
{跳转 | '日常领取' | 开关={'日常领取'}}
{点击 | [129,62,50] | 延时=500}
{点击 | [129,62,50] | 延时=500}

{找图 | 主页 | 跳转=['T运行'] | 范围=[[539,740,752,892]] | 图片=['主页1','主页2',75]}
)
[-=-=纺锤处理=-=-]=()

[纺锤运行]=(
{点击 | [1232,805,50,'2L']}
{找图 | 驾驶席 | 循环=['F',25,200] | 范围=[[925,335,1081,496]] | 图片=['驾驶席',75]}
{找图 | 再点一次 | 跳转=['F纺锤运行'] | 范围=[[925,335,1081,496]] | 图片=['驾驶席',75]}
{延时 | 300}
{找图 | 没进去 | 点击=['T',559,251,50,'2L'] | 循环=['T',99,200] | 范围=[[925,335,1081,496]] | 图片=['驾驶席',75]}
{空参 | 准备}
{找图 | 采掘 | 循环=['F',999,100] | 范围=[[103,200,258,306]] | 图片=['采掘',85]}
{判断 | [[{'纺锤次数'},'小于等于',0],{赋值=['T',[{'纺锤'},0]] | 跳转=['T日常领取']}] | 开关={'纺锤'}}
{点击 | [188,414,50,'2L'] | 延时=500}
{找图 | 纺锤本-嫉妒 | 赋值=['T',[{'嫉妒纺锤'},1]] | 范围=[[376,182,551,283]] | 图片=['纺锤本-嫉妒',75]}
{找图 | 纺锤本-傲慢 | 赋值=['T',[{'傲慢纺锤'},1]] | 范围=[[376,182,551,283]] | 图片=['纺锤本-傲慢',75]}
{找图 | 纺锤本-忧郁 | 赋值=['T',[{'忧郁纺锤'},1]] | 范围=[[376,182,551,283]] | 图片=['纺锤本-忧郁',75]}
{找图 | 纺锤本-暴食 | 赋值=['T',[{'暴食纺锤'},1]] | 范围=[[376,182,551,283]] | 图片=['纺锤本-暴食',75]}
{找图 | 纺锤本-怠惰 | 赋值=['T',[{'怠惰纺锤'},1]] | 范围=[[376,182,551,283]] | 图片=['纺锤本-怠惰',75]}
{找图 | 纺锤本-色欲 | 赋值=['T',[{'色欲纺锤'},1]] | 范围=[[376,182,551,283]] | 图片=['纺锤本-色欲',75]}
{找图 | 纺锤本-愤怒 | 赋值=['T',[{'愤怒纺锤'},1]] | 范围=[[376,182,551,283]] | 图片=['纺锤本-愤怒',75]}

{空参 | 纺锤连战}
{判断 | [[{'纺锤连战'},'等于',0],{跳至=['T','纺锤运行','选队']}]}
{判断 | [[{'纺锤次数'},'小于',2],{跳至=['T','纺锤运行','选队']}]}
{找图 | 次数未展开 | 点击=['T',400,285,50] | 延时=200 | 范围=[[577,264,616,302]] | 图片=['次数未展开1',85]}
{判断 | [[{'纺锤次数'},'小于',10],{跳至=['T','纺锤运行','次数小于10']}]}
{点击 | [590,325,50] | 延时=100}
{赋值 | [[{'采掘次数变动'},10]]}
{跳至 | ['纺锤运行','选队']}

{空参 | 次数小于10}

//不知为何此方法仅在第一次进入时生效,结算后再次输入会出错
//{点击|[1390,355,50]|延时=200}
//{按键|[{'经验次数'},50]}

//只能退而求次循环点击了,反正消耗的时间差不多
{点击 | [340,325,50] | 延时=100}
{计算 | [[{'纺锤次数'},'-',1,{'点击次数'}]]}
{找图 | 保证运行 | 点击=['T',545,325,50] | 循环=['T',{'点击次数'},50] | 范围=[[103,200,258,306]] | 图片=['采掘',85]}

{延时 | 100}
{赋值 | [[{'采掘次数变动'},{'纺锤次数'}]]}

{空参 | 选队}
{跳转 | '纺锤跳过' | 开关={'纺锤跳过'}}
{点击 | [403,599,50] | 延时=500}
{点击 | [870,636,50] | 延时=500}

{赋值 | [[{'纺锤单通变量'},0]]}
{判断 | [[{'第一次纺锤本'},'等于',0],{跳至=['T','纺锤运行','开始']}]}
{赋值 | [[{'第一次纺锤本'},0]]}
{延时 | 300}
{点击 | ['T',162,394,50,'L',1]}
{移动 | [53,827,25]}
{点击 | ['T',53,827,0,'L',2] | 延时=400}
{点击 | ['T',217,{'纺锤Y'},50] | 跳至=['T','纺锤运行','开始'] | 开关={'纺锤队伍固定'}}
{找图 | 纺锤采掘 | 点击=['T',0,0,50] | 延时=50 | 范围=[[89,361,235,668]] | 图片=['纺锤采掘',80]}

{判断 | [[{'纺锤抗性编队'},'等于',0],{跳至=['T','纺锤运行','开始']}]}
{空参 | 尝试}
{点击 | [40,830,50] | 延时=100}
{空参 | 嫉妒 | 判断=['T',[{'嫉妒编队'},'等于',0],{跳至=['T','纺锤运行','傲慢']}]}
{找图 | 队伍-嫉妒 | 点击=['T',0,0,50] | 跳至=['T','纺锤运行','开始'] | 延时=300 | 范围=[[89,361,235,668]] | 图片=['队伍-嫉妒',80] | 开关={'嫉妒纺锤'}}
{空参 | 傲慢 | 判断=['T',[{'傲慢编队'},'等于',0],{跳至=['T','纺锤运行','忧郁']}]}
{找图 | 队伍-傲慢 | 点击=['T',0,0,50] | 跳至=['T','纺锤运行','开始'] | 延时=300 | 范围=[[89,361,235,668]] | 图片=['队伍-傲慢',80] | 开关={'傲慢纺锤'}}
{空参 | 忧郁 | 判断=['T',[{'忧郁编队'},'等于',0],{跳至=['T','纺锤运行','暴食']}]}
{找图 | 队伍-忧郁 | 点击=['T',0,0,50] | 跳至=['T','纺锤运行','开始'] | 延时=300 | 范围=[[89,361,235,668]] | 图片=['队伍-忧郁',77] | 开关={'忧郁纺锤'}}
{空参 | 暴食 | 判断=['T',[{'暴食编队'},'等于',0],{跳至=['T','纺锤运行','怠惰']}]}
{找图 | 队伍-暴食 | 点击=['T',0,0,50] | 跳至=['T','纺锤运行','开始'] | 延时=300 | 范围=[[89,361,235,668]] | 图片=['队伍-暴食',80] | 开关={'暴食纺锤'}}
{空参 | 怠惰 | 判断=['T',[{'怠惰编队'},'等于',0],{跳至=['T','纺锤运行','色欲']}]}
{找图 | 队伍-怠惰 | 点击=['T',0,0,50] | 跳至=['T','纺锤运行','开始'] | 延时=300 | 范围=[[89,361,235,668]] | 图片=['队伍-怠惰',80] | 开关={'怠惰纺锤'}}
{空参 | 色欲 | 判断=['T',[{'色欲编队'},'等于',0],{跳至=['T','纺锤运行','愤怒']}]}
{找图 | 队伍-色欲 | 点击=['T',0,0,50] | 跳至=['T','纺锤运行','开始'] | 延时=300 | 范围=[[89,361,235,668]] | 图片=['队伍-色欲',80] | 开关={'色欲纺锤'}}
{空参 | 愤怒 | 判断=['T',[{'愤怒编队'},'等于',0],{跳至=['T','纺锤运行','无']}]}
{找图 | 队伍-愤怒 | 点击=['T',0,0,50] | 跳至=['T','纺锤运行','开始'] | 延时=300 | 范围=[[89,361,235,668]] | 图片=['队伍-愤怒',80] | 开关={'愤怒纺锤'}}
{空参 | 无}
{找图 | 纺锤采掘 | 点击=['T',0,0,50] | 赋值=['T',[{'纺锤已选择'},1]] | 延时=50 | 范围=[[89,361,235,668]] | 图片=['纺锤采掘',70]}
{判断 | [[{'纺锤已选择'},'等于',0],{跳至=['T','纺锤运行','检索']}]}
{判断 | [[{'嫉妒编队'},'等于',0],{跳至=['T','纺锤运行','开始']}] | 开关={'嫉妒纺锤'}}
{判断 | [[{'傲慢编队'},'等于',0],{跳至=['T','纺锤运行','开始']}] | 开关={'傲慢纺锤'}}
{判断 | [[{'忧郁编队'},'等于',0],{跳至=['T','纺锤运行','开始']}] | 开关={'忧郁纺锤'}}
{判断 | [[{'暴食编队'},'等于',0],{跳至=['T','纺锤运行','开始']}] | 开关={'暴食纺锤'}}
{判断 | [[{'怠惰编队'},'等于',0],{跳至=['T','纺锤运行','开始']}] | 开关={'怠惰纺锤'}}
{判断 | [[{'色欲编队'},'等于',0],{跳至=['T','纺锤运行','开始']}] | 开关={'色欲纺锤'}}
{判断 | [[{'愤怒编队'},'等于',0],{跳至=['T','纺锤运行','开始']}] | 开关={'愤怒纺锤'}}
{空参 | 检索}
{空参 | 次数计次 | 计次=['T','纺锤本选择',4,{赋值=['T',[{'第一次纺锤本'},0]] | 跳至=['T','纺锤运行','开始']}]}
{点击 | ['T',162,618,50,'L',1]}
{移动 | [53,388,7]}
{点击 | ['T',53,388,500,'L',2]}
{跳至 | ['纺锤运行','尝试']}

{空参 | 开始}
{点击 | [1431,753,50] | 延时=100}
{延时 | 100}
{移动 | [1500,800,200]}
{延时 | 200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 战斗中 | 循环=['F',999,100] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}

{跳转 | '良秀全家活暗暗-纺锤' | 开关={'良秀死全家[纺锤]'}}
{跳转 | '纺锤战斗'}
)
[纺锤跳过]=(
{点击 | [403,645,50] | 延时=500}
{点击 | [870,636,50] | 延时=500}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',75]}
{跳转 | '纺锤结算'}
)
[纺锤战斗]=(
{找图 | bug | 点击=['T',1500,800,50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | P | 按键=['T','P',50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | ENTER | 按键=['T','ENTER',50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 事件 | 跳转=['T事件'] | 赋值=['T',[{'战斗中'},1]] | 范围=[[361,59,512,181]] | 图片=['事件',85]}
{找图 | 我说结束了 | 点击=['T',0,0,50] | 范围=[[588,305,999,613]] | 图片=['我说我赢了','我说我输了',80]}

{找图 | 重连尝试 | 组=['T纺锤结算'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 跳转=['T纺锤结算'] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',85]}
{跳转 | '纺锤战斗'}

)
[纺锤结算]=(
{按键 | ['F12',50] | 开关={'结算时截图'}}

{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 循环=['T',999,200] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',85]}
{延时 | 800}

{找图 | 失败 | 计算=['T',[{'纺锤次数'},'+',{'采掘次数变动'},{'纺锤次数'}]] | 范围=[[1291,135,1485,264]] | 图片=['失败',85]}
{找图 | 采掘 | 计算=['T',[{'纺锤次数'},'-',{'采掘次数变动'},{'纺锤次数'}]] | 按键=['F','ENTER',50] | 循环=['F',999,100] | 范围=[[103,200,258,306]] | 图片=['采掘',85]}

{判断 | [[{'纺锤次数'},'小于等于',0],{赋值=['T',[{'纺锤'},0],[{'纺锤已选择'},0]] | 跳至=['F','纺锤运行','准备']}] | 开关={'纺锤'}}
{跳转 | '日常领取' | 开关={'日常领取'}}
{点击 | [129,62,50] | 延时=500}
{点击 | [129,62,50] | 延时=500}

{找图 | 主页 | 跳转=['T运行'] | 范围=[[539,740,752,892]] | 图片=['主页1','主页2',75]}
)
[■■■■处理-地牢■■■■]=()

[房间检索]=(

{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 循环=['T',999,200] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',85]}
{找图 | 主页 | 跳转=['T入场'] | 范围=[[539,740,752,892]] | 图片=['主页1','主页2',75]}
{找图 | 战斗中 | 跳转=['T战斗中'] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 选人页 | 跳转=['T选人页'] | 范围=[[1307,538,1409,654]] | 图片=['选人页',85]}
{找图 | 事件 | 跳转=['T事件'] | 范围=[[361,59,512,181]] | 图片=['事件',85]}
{找图 | 商店 | 跳转=['T商店'] | 范围=[[385,428,521,560]] | 图片=['商店',85]}
{找图 | 卡包选择 | 跳转=['T卡包选择'] | 范围=[[1457,6,1571,387]] | 图片=['卡包选择','卡包选择2',85]}
{找图 | 战后奖励选择 | 跳转=['T战后奖励选择'] | 范围=[[466,110,706,217]] | 图片=['战后奖励选择',85]}
{找图 | EGO饰品选择 | 跳转=['TEGO饰品选择'] | 范围=[[1077,667,1297,784]] | 图片=['EGO饰品选择',85]}
{找图 | 结算 | 跳转=['T结算'] | 范围=[[14,98,180,403]] | 图片=['结算',85]}
{找图 | 地图 | 跳转=['T地图'] | 范围=[[1457,6,1571,387]] | 图片=['地图','地图2','地图3',85]}
//无法加载的通知太坏了
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[507,592,1093,649]] | 图片=['确认3','确认2','确认1',85]}
{跳转 | '房间检索'}
)
[周四重置]=(
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 300}
{点击 | [526,690,50]}
{延时 | 300}
{跳出 | 'TF'}
)
[入场]=(
{判断 | [[{'地牢次数'},'小于等于',0],{赋值=['T',[{'地牢'},0]] | 跳转=['T运行']}]}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=700 | 范围=[[419,125,1568,871]] | 图片=['确认2',85]}
{点击 | [1232,805,50,'2L']}
{找图 | 驾驶席 | 循环=['F',25,200] | 范围=[[925,335,1081,496]] | 图片=['驾驶席',75]}
{找图 | 再点一次 | 跳转=['F入场'] | 范围=[[925,335,1081,496]] | 图片=['驾驶席',75]}
{延时 | 300}
{点击 | [559,379,50,'2L'] | 延时=200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}

{找图 | 地牢入口 | 循环=['F',999,200] | 范围=[[599,405,1011,712]] | 图片=['地牢入口','周四重置',85]}
{找图 | 周四重置 | 组=['T周四重置'] | 范围=[[599,405,1011,712]] | 图片=['周四重置',85]}
{找图 | 平行叠加 | 点击=['T',1316,465,5] | 范围=[[1318,391,1421,464]] | 图片=['平行叠加',85]}
{点击 | [804,568,50,'2L'] | 延时=600}
{找图 | 地牢探索中 | 点击=['T',799,497,50,'2L'] | 跳至=['T','入场','续局检查'] | 范围=[[510,288,1064,402]] | 图片=['地牢未成','地牢未成2',77]}
{点击 | [950,613,50,'2L'] | 延时=200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}

{找图 | 星恩标识 | 循环=['F',999,200] | 范围=[[1410,642,1460,696]] | 图片=['星恩标识','星恩标识2',75]}
{空参 | 续局1}
{延时 | 200}
{点击 | ['T',162,394,50,'L',1]}
{移动 | [164,827,25]}
{点击 | ['T',164,827,0,'L',2] | 延时=400}
{空参 | 选队}
{点击 | [217,{'地牢Y'},50,'2L'] | 延时=200 | 开关={'队伍轮换'}}
{跳至 | ['入场','进入'] | 开关={'队伍轮换'}}
{找图 | 地牢队伍 | 点击=['T',0,0,50,'2L'] | 延时=200 | 范围=[[89,361,235,668]] | 图片=['地牢队伍',85] | 开关={'地牢队伍识别'}}
{点击 | [217,{'地牢Y'},50,'2L'] | 延时=200 | 开关={'地牢队伍固定'}}
{空参 | 进入}
{点击 | [1429,734,50,'2L'] | 延时=300}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',65]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}

{找图 | 星恩页 | 循环=['F',999,100] | 范围=[[752,210,880,264]] | 图片=['星恩页',75]}
{空参 | 续局2}
{延时 | 300}
{跳至 | ['入场','星恩全选'] | 开关={'跳过星恩判断'}}
{组 | '星恩10' | 开关={'星恩10'}}
{组 | '星恩9' | 开关={'星恩9'}}
{组 | '星恩8' | 开关={'星恩8'}}
{组 | '星恩7' | 开关={'星恩7'}}
{组 | '星恩6' | 开关={'星恩6'}}
{组 | '星恩5' | 开关={'星恩5'}}
{组 | '星恩4' | 开关={'星恩4'}}
{组 | '星恩3' | 开关={'星恩3'}}
{组 | '星恩2' | 开关={'星恩2'}}
{组 | '星恩1' | 开关={'星恩1'}}
{空参 | 跳过星恩判断}

{点击 | [1495,838,50,'2L'] | 延时=500}
{找图 | 星光转换 | 点击=['T',0,0,50] | 范围=[[851,401,950,503]] | 图片=['星光转换',85] | 开关={'星光不换经费'}}
{找图 | 星光不转换 | 点击=['T',0,0,50] | 范围=[[851,401,950,503]] | 图片=['星光不转换',85] | 开关={'星光换经费'}}
{点击 | [950,671,50,'2L'] | 延时=200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 700}

{空参 | 续局3}
{找图 | 不观测饰品 | 点击=['T',0,0,50] | 循环=['T',5,100] | 范围=[[1361,158,1479,242]] | 图片=['不观测饰品',85] | 开关={'禁用观测'}}
{找图 | 观测饰品 | 点击=['T',0,0,50] | 循环=['T',5,100] | 范围=[[1422,176,1471,213]] | 图片=['观测饰品',85] | 开关={'启用观测'}}

{点击 | [{'起始体系X'},{'起始体系Y'},50,'2L'] | 延时=300}
{点击 | [1025,324,50] | 延时=200 | 开关={'起始饰品1'}}
{点击 | [1025,440,50] | 延时=200 | 开关={'起始饰品2'}}
{点击 | [1025,570,50] | 延时=200 | 开关={'起始饰品3'}}
{点击 | [1344,731,50] | 延时=100}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 300}

{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=400 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=400 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=400 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}

{延时 | 1000 | 开关={'启用观测'}}
{找图 | 前往观测 | 跳至=['T','喵派观测法则','选页'] | 范围=[[320,15,448,100]] | 图片=['饰品观测',75] | 开关={'启用观测'}}

{空参 | 最终处理}

{赋值 | [[{'楼层'},0],[{'楼层判断'},1]]}
{赋值 | [[{'星恩选择6'},1],[{'星恩6已选择'},2]] | 开关={'星恩6'}}
{赋值 | [[{'星恩6已选择'},1]] | 开关={'星恩6+'}}
{赋值 | [[{'星恩6已选择'},0]] | 开关={'星恩6++'}}
{赋值 | [[{'星恩选择10'},1],[{'星恩10已选择'},2]] | 开关={'星恩10'}}
{赋值 | [[{'星恩10已选择'},1]] | 开关={'星恩10+'}}
{赋值 | [[{'星恩10已选择'},0]] | 开关={'星恩10++'}}
{跳转 | '房间检索'}

{空参 | 续局检查}
{找图 | 地牢探索中 | 点击=['T',799,497,50,'2L'] | 跳至=['T','入场','续局检查'] | 范围=[[510,288,1064,402]] | 图片=['地牢未成','地牢未成2',77]}
{移动 | [1500,800,100]}
{延时 | 2000}
{找图 | 星恩标识 | 跳至=['T','入场','续局1'] | 范围=[[1410,642,1460,696]] | 图片=['星恩标识','星恩标识2',75]}
{找图 | 星恩页 | 跳至=['T','入场','续局2'] | 范围=[[752,210,880,264]] | 图片=['星恩页',75]}
{找图 | 起始饰品页 | 跳至=['T','入场','续局3'] | 范围=[[292,386,796,485]] | 图片=['起始饰品页',75]}
{找图 | 观测页 | 跳至=['T','喵派观测法则','选页'] | 范围=[[320,15,448,100]] | 图片=['饰品观测',75] | 开关={'启用观测'}}
{跳转 | '房间检索'}

{空参 | 星恩全选}
{点击 | [1500,633,50] | 延时=20}
{点击 | [1500,{'星恩Y'},50] | 延时=20}
{跳至 | ['入场','跳过星恩判断']}
)

[楼层判断]=(
{计算 | [[{'楼层'},'+',1,{'楼层'}]] | 开关={'楼层判断'}}
{判断 | [[{'楼层'},'大于',3],{跳转=['T走人']}] | 开关={'三层退'}}
{判断 | [[{'楼层'},'大于',4],{跳转=['T走人']}] | 开关={'四层退'}}
{判断 | [[{'楼层'},'等于',3],{赋值=['T',[{'困难镜牢'},1],[{'普通镜牢'},0]]}] | 开关={'三层转困'}}
{判断 | [[{'楼层'},'等于',4],{赋值=['T',[{'困难镜牢'},1],[{'普通镜牢'},0]]}] | 开关={'四层转困'}}
{跳出 | 'T' | 开关={'楼层判断'}}
{点击 | [1540,54,50] | 延时=500}
{赋值 | [[{'楼层'},1],[{'楼层判断'},1]]}
{找图 | 阶层1 | 赋值=['T',[{'楼层'},2]] | 范围=[[591,305,675,378]] | 图片=['阶层完成',77]}
{找图 | 阶层2 | 赋值=['T',[{'楼层'},3]] | 范围=[[674,304,758,379]] | 图片=['阶层完成',77]}
{找图 | 阶层3 | 赋值=['T',[{'楼层'},4]] | 范围=[[759,305,839,380]] | 图片=['阶层完成',77]}
{找图 | 阶层4 | 赋值=['T',[{'楼层'},5]] | 范围=[[838,297,925,383]] | 图片=['阶层完成',77]}
{判断 | [[{'楼层'},'大于',3],{跳转=['T走人']}] | 开关={'三层退'}}
{判断 | [[{'楼层'},'大于',4],{跳转=['T走人']}] | 开关={'四层退'}}
{判断 | [[{'楼层'},'大于等于',3],{赋值=['T',[{'困难镜牢'},1],[{'普通镜牢'},0]]}] | 开关={'三层转困'}}
{判断 | [[{'楼层'},'大于等于',4],{赋值=['T',[{'困难镜牢'},1],[{'普通镜牢'},0]]}] | 开关={'四层转困'}}
{点击 | [798,546,50] | 延时=500}
{跳出 | 'TF'}
)

[卡包选择]=(

{延时 | 200}
{组 | '楼层判断'}
{找图 | 困难 | 点击=['F',1145,60,50] | 范围=[[1117,24,1217,93]] | 图片=['困难镜牢',80] | 开关={'困难镜牢'}}
{找图 | 普通 | 点击=['T',1145,60,50] | 范围=[[1117,24,1217,93]] | 图片=['困难镜牢',80] | 开关={'普通镜牢'}}
{空参 | 继续}
{移动 | [1452,153,200]}
{判断 | [[{'楼层'},'等于',4],{跳至=['T','运行','结束了']}] | 开关={'四层终止'}}
{判断 | [[{'楼层'},'等于',5],{跳至=['T','运行','结束了']}] | 开关={'五层终止'}}
{延时 | 2800}
{赋值 | [[{'卡包刷新次数'},2]]}
{赋值 | [[{'卡包刷新'},0]]}
{赋值 | [[{'单行道'},0]]}
//我认为,同一层连续全灭已经没有继续的必要了,开新局也会先遇见卡包,所以放这里了
{赋值 | [[{'全灭次数'},0]]}
{判断 | [[{'星恩3刷新'},'等于',1],{赋值=['T',[{'卡包刷新次数'},1]]}] | 开关={'星恩3'}}
{判断 | [[{'星恩3刷新'},'等于',2],{赋值=['T',[{'卡包刷新次数'},0]]}] | 开关={'星恩3'}}
{跳至 | ['卡包选择','搜寻'] | 开关={'普通镜牢'}}
{判断 | [[{'楼层'},'大于',4],{赋值=['T',[{'重新选人'},1]]}] | 开关={'喵的选人判断'}}

{空参 | 搜寻}
{按键 | ['F12',50] | 开关={'卡包截图'}}
{组 | '卡包N' | 开关={'普通镜牢'}}
{组 | '卡包H' | 开关={'困难镜牢'}}
{空参 | 刷新}
{点击 | [1347,52,50] | 延时=150}
{移动 | [1452,153,200]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 3300}
{计算 | [[{'卡包刷新次数'},'+',1,{'卡包刷新次数'}]]}
{判断 | [[{'卡包刷新次数'},'小于',5],{跳至=['T','卡包选择','搜寻']}] | 开关={'星恩3'}}
{赋值 | [[{'卡包刷新'},1]]}
{跳至 | ['卡包选择','搜寻']}

{空参 | 无奈}
{赋值 | [[{'坐标X1'},730]]}
{空参 | 选择}
{重置计次 | '观测计次'}
{滑动 | [{'坐标X1'},350,{'坐标X1'},630]}
{赋值 | [[{'坐标X1'},0]]}
{赋值 | [[{'超绝哈基米哈气乱窜'},0]]}
{判断 | [[{'楼层'},'等于',1],{赋值=['F',[{'已选卡包'},1]]}]}
{延时 | 300}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 1000}
{跳转 | '房间检索'}

{空参 | 观测}
{点击 | [249,65,50] | 延时=250}
{找图 | 卡包观测 | 点击=['T',0,0,50] | 跳至=['F','卡包选择','观测'] | 延时=500 | 范围=[[186,220,1436,320]] | 图片=['卡包观测',85]}
{点击 | [677,151,50] | 延时=50}
{赋值 | [[{'观测Xa1'},1699],[{'观测Xa2'},1999],[{'观测Xb1'},1699],[{'观测Xb2'},1999],[{'观测Xc1'},1699],[{'观测Xc2'},1999],[{'观测Xd1'},1699],[{'观测Xd2'},1999],[{'观测Xe1'},1699],[{'观测Xe2'},1999]]}
{空参 | 观测排除}
{找图 | 无法观测1 | 赋值=['F',[{'观测Xa1'},727],[{'观测Xa2'},879]] | 范围=[[727,228,879,465]] | 图片=['无法观测',75]}
{找图 | 无法观测2 | 赋值=['F',[{'观测Xb1'},881],[{'观测Xb2'},1027]] | 范围=[[881,228,1027,465]] | 图片=['无法观测',75]}
{找图 | 无法观测3 | 赋值=['F',[{'观测Xc1'},1023],[{'观测Xc2'},1173]] | 范围=[[1023,228,1173,465]] | 图片=['无法观测',75]}
{找图 | 无法观测4 | 赋值=['F',[{'观测Xd1'},1167],[{'观测Xd2'},1326]] | 范围=[[1167,228,1326,465]] | 图片=['无法观测',75]}
{找图 | 无法观测5 | 赋值=['F',[{'观测Xe1'},1317],[{'观测Xe2'},1468]] | 范围=[[1317,228,1468,465]] | 图片=['无法观测',75]}

{判断 | [[{'楼层'},'等于',1],{跳至=['T','卡包选择','B1']}] | 开关={'困难镜牢'}}
{判断 | [[{'楼层'},'等于',2],{跳至=['T','卡包选择','B2']}] | 开关={'困难镜牢'}}
{判断 | [[{'楼层'},'等于',3],{跳至=['T','卡包选择','B3']}] | 开关={'困难镜牢'}}
{判断 | [[{'楼层'},'等于',4],{跳至=['T','卡包选择','B4']}] | 开关={'困难镜牢'}}
{判断 | [[{'楼层'},'等于',5],{跳至=['T','卡包选择','B5']}] | 开关={'困难镜牢'}}

{判断 | [[{'楼层'},'等于',1],{跳至=['T','卡包选择','A1']}]}
{判断 | [[{'楼层'},'等于',2],{跳至=['T','卡包选择','A2']}]}
{判断 | [[{'楼层'},'等于',3],{跳至=['T','卡包选择','A3']}]}
{判断 | [[{'楼层'},'等于',4],{跳至=['T','卡包选择','A4']}]}
{判断 | [[{'楼层'},'等于',5],{跳至=['T','卡包选择','A5']}]}

{空参 | 普牢观测}
{空参 | A1}
{找图 | 1 | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-被遗忘者们',75]}
{跳至 | ['卡包选择','下轮观测']}
{空参 | A2}
{找图 | 2 | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-地狱鸡',75]}
{跳至 | ['卡包选择','下轮观测']}
{空参 | A3}
{找图 | nya | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-憎恶与绝望',75] | 开关={'喵派卡包选择'}}
{跳至 | ['卡包选择','下轮观测'] | 开关={'喵派卡包选择'}}
{找图 | 3 | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-当斩之物',75]}
{跳至 | ['卡包选择','下轮观测']}
{空参 | A4}
{找图 | 4 | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-吞噬的暴食',75]}
{跳至 | ['卡包选择','下轮观测']}
{空参 | A5}
{找图 | 5 | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-堕落的忧郁',75]}
{跳至 | ['卡包选择','下轮观测']}

{空参 | 困牢观测}
{空参 | B1}
{找图 | 1 | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-被遗忘者们',75]}
{跳至 | ['卡包选择','下轮观测']}
{空参 | B2}
{找图 | 2 | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-地狱鸡',75]}
{跳至 | ['卡包选择','下轮观测']}
{空参 | B3}
{找图 | nya | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-憎恶与绝望',75] | 开关={'喵派卡包选择'}}
{跳至 | ['卡包选择','下轮观测'] | 开关={'喵派卡包选择'}}
{找图 | 3 | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-缭乱的波动',75]}
{跳至 | ['卡包选择','下轮观测']}
{空参 | B4}
{找图 | nya | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-2号线',75] | 开关={'喵派卡包选择'}}
{跳至 | ['卡包选择','下轮观测'] | 开关={'喵派卡包选择'}}
{找图 | 4 | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-吞噬的暴食',75]}
{跳至 | ['卡包选择','下轮观测']}
{空参 | B5}
{找图 | nya | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-4号线-3',75] | 开关={'喵派卡包选择'}}
{跳至 | ['卡包选择','下轮观测'] | 开关={'喵派卡包选择'}}
{找图 | 5 | 点击=['T',0,0,50] | 跳至=['T','卡包选择','已观测'] | 范围=[[{'观测Xa1'},403,{'观测Xa2'},608],[{'观测Xb1'},403,{'观测Xb2'},608],[{'观测Xc1'},403,{'观测Xc2'},608],[{'观测Xd1'},403,{'观测Xd2'},608],[{'观测Xe1'},403,{'观测Xe2'},608]] | 图片=['卡包观测-异常地震带',75]}

{空参 | 下轮观测 | 计次=['T','观测计次',10,{跳至=['T','卡包选择','观测棍木']}]}
{找图 | 观测结束 | 跳至=['T','卡包选择','观测棍木'] | 延时=500 | 范围=[[1300,359,1472,415]] | 图片=['观测结束',85]}
{点击 | ['T',1467,502,50,'L',1]}
{移动 | [1467,223,7]}
{点击 | ['T',1467,223,500,'L',2]}
{延时 | 200}
{跳至 | ['卡包选择','观测排除']}

{空参 | 观测棍木}
{点击 | ['T',628,720,50,'2L'] | 延时=500}
{跳至 | ['卡包选择','无奈']}

{空参 | 已观测}
{延时 | 300}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=700 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 3300}
{跳至 | ['卡包选择','搜寻']}

)

[卡包N]=(
{判断 | [[{'楼层'},'等于',1],{跳至=['T','卡包N','第一层']}]}
{判断 | [[{'楼层'},'等于',2],{跳至=['T','卡包N','第二层']}]}
{判断 | [[{'楼层'},'等于',3],{跳至=['T','卡包N','第三层']}]}
{判断 | [[{'楼层'},'等于',4],{跳至=['T','卡包N','第四层']}]}
{判断 | [[{'楼层'},'等于',5],{跳至=['T','卡包N','第五层']}]}
{空参 | 第一层}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-被遗忘者们','楼层卡包-身无分文的赌徒','楼层卡包-钉与锤','楼层卡包-无归属者',77]}
{跳至 | ['卡包选择','观测'] | 开关={'卡包刷新'}}
{跳至 | ['卡包选择','刷新']}


{空参 | 第二层}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-地狱鸡',77]}
{跳至 | ['卡包选择','观测'] | 开关={'卡包刷新'}}
{跳至 | ['卡包选择','刷新']}


{空参 | 第三层}
{找图 | 超绝哈基米哈气乱窜 | 赋值=['T',[{'坐标X1'},{'x'}],[{'单行道'},1]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-憎恶与绝望',77] | 开关={'喵派卡包选择'}}
{判断 | [[{'卡包刷新'},'等于',1],{跳至=['T','卡包选择','观测']}] | 开关={'喵派卡包选择'}}
{跳至 | ['卡包选择','刷新'] | 开关={'喵派卡包选择'}}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-当斩之物','楼层卡包-被情感评判者','楼层卡包-对情感饥渴者',77]}
{找图 | 1. | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-无作为者','楼层卡包-向情感屈从者','楼层卡包-待情感懒惰者',77]}
{跳至 | ['卡包选择','观测'] | 开关={'卡包刷新'}}
{跳至 | ['卡包选择','刷新']}


{空参 | 第四层}
{找图 | 当期活动 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-经验记忆',77] | 开关={'活动1'}}
{找图 | 当期活动 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-xxxx',77] | 开关={'活动2'}}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-吞噬的暴食','楼层卡包-堕落的忧郁','楼层卡包-某个世界',77]}
{跳至 | ['卡包选择','观测'] | 开关={'卡包刷新'}}
{跳至 | ['卡包选择','刷新']}


{空参 | 第五层}
{找图 | 当期活动 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-经验记忆',77] | 开关={'活动1'}}
{找图 | 当期活动 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-xxxx',77] | 开关={'活动2'}}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-堕落的忧郁','楼层卡包-吞噬的暴食','楼层卡包-某个世界',77]}
{找图 | 2 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-斩切者们','楼层卡包-穿刺者们',85]}
{跳至 | ['卡包选择','观测'] | 开关={'卡包刷新'}}
{跳至 | ['卡包选择','刷新']}
)

[卡包H]=(
{判断 | [[{'楼层'},'等于',1],{跳至=['T','卡包H','第一层']}]}
{判断 | [[{'楼层'},'等于',2],{跳至=['T','卡包H','第二层']}]}
{判断 | [[{'楼层'},'等于',3],{跳至=['T','卡包H','第三层']}]}
{判断 | [[{'楼层'},'等于',4],{跳至=['T','卡包H','第四层']}]}
{判断 | [[{'楼层'},'等于',5],{跳至=['T','卡包H','第五层']}]}
{空参 | 第一层}
{找图 | 超绝哈基米哈气乱窜 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[91,540,1443,760]] | 图片=['黑兽破裂之基石',77] | 开关={'超绝哈基米哈气乱窜'}}
{判断 | [[{'卡包刷新'},'等于',1],{跳至=['T','卡包H','继续一层']}] | 开关={'超绝哈基米哈气乱窜'}}
{跳至 | ['卡包选择','刷新'] | 开关={'超绝哈基米哈气乱窜'}}
{空参 | 继续一层}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-被遗忘者们','楼层卡包-身无分文的赌徒','楼层卡包-钉与锤',77]}
{找图 | 1. | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-当斩之物',77]}
{跳至 | ['卡包选择','观测'] | 开关={'卡包刷新'}}
{跳至 | ['卡包选择','刷新']}


{空参 | 第二层}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-地狱鸡',77]}
{跳至 | ['卡包选择','观测'] | 开关={'卡包刷新'}}
{跳至 | ['卡包选择','刷新']}


{空参 | 第三层}
{找图 | 超绝哈基米哈气乱窜 | 赋值=['T',[{'坐标X1'},{'x'}],[{'单行道'},1]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-憎恶与绝望',77] | 开关={'喵派卡包选择'}}
{判断 | [[{'卡包刷新'},'等于',1],{跳至=['T','卡包选择','观测']}] | 开关={'喵派卡包选择'}}
{跳至 | ['卡包选择','刷新'] | 开关={'喵派卡包选择'}}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-缭乱的波动','楼层卡包-堕落的忧郁','楼层卡包-渗出的赤血',77]}
{找图 | 1. | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-吞噬的暴食','楼层卡包-无作为者',77]}
{跳至 | ['卡包选择','观测'] | 开关={'卡包刷新'}}
{跳至 | ['卡包选择','刷新']}


{空参 | 第四层}
{找图 | 当期活动 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-经验记忆',77] | 开关={'活动1'}}
{找图 | 当期活动 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-xxxx',77] | 开关={'活动2'}}
{找图 | 超绝哈基米哈气乱窜 | 赋值=['T',[{'坐标X1'},{'x'}],[{'单行道'},1]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-2号线',77] | 开关={'喵派卡包选择'}}
{判断 | [[{'卡包刷新'},'等于',1],{跳至=['T','卡包选择','观测']}] | 开关={'喵派卡包选择'}}
{跳至 | ['卡包选择','刷新'] | 开关={'喵派卡包选择'}}
{找图 | 1. | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-堕落的忧郁','楼层卡包-吞噬的暴食','楼层卡包-某个世界',77]}
{跳至 | ['卡包选择','观测'] | 开关={'卡包刷新'}}
{跳至 | ['卡包选择','刷新']}


{空参 | 第五层}
{找图 | 当期活动 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-经验记忆',77] | 开关={'活动1'}}
{找图 | 当期活动 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-xxxx',77] | 开关={'活动2'}}
{找图 | 超绝哈基米哈气乱窜 | 赋值=['T',[{'坐标X1'},{'x'}],[{'单行道'},1]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-4号线-3',77] | 开关={'喵派卡包选择'}}
{判断 | [[{'卡包刷新'},'等于',1],{跳至=['T','卡包选择','观测']}] | 开关={'喵派卡包选择'}}
{跳至 | ['卡包选择','刷新'] | 开关={'喵派卡包选择'}}
{找图 | 1 | 赋值=['T',[{'坐标X1'},{'x'}]] | 跳至=['T','卡包选择','选择'] | 范围=[[119,418,1490,658]] | 图片=['楼层卡包-异常地震带',77]}
{跳至 | ['卡包选择','观测'] | 开关={'卡包刷新'}}
{跳至 | ['卡包选择','刷新']}
)
[效果选择]=(
{点击 | [627,464,50] | 延时=300}
{找图 | 加速 | 点击=['T',0,0,50] | 延时=200 | 范围=[[525,304,1129,385]] | 图片=['效果选择-加速',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{跳出 | 'TF'}
)
[地图]=(
{空参 | 等待 | 延时=2500 | 开关={'已选卡包'}}
{赋值 | [[{'已选卡包'},0]]}
//因为某个星光,所以它在这里
{找图 | EGO饰品选择 | 跳转=['TEGO饰品选择'] | 范围=[[1077,667,1297,784]] | 图片=['EGO饰品选择',85]}
{重置计次 | '事件寻找'}
{重置计次 | '链条寻找'}
{找图 | 效果选择 | 组=['T效果选择'] | 范围=[[608,156,788,275]] | 图片=['效果选择',70]}
{找图 | 获得EGO | 点击=['T',800,666,50,'2L'] | 延时=600 | 范围=[[558,170,742,283]] | 图片=['EGO饰品获取',85]}
{找图 | 获得EGO | 点击=['T',800,666,50,'2L'] | 延时=200 | 范围=[[558,170,742,283]] | 图片=['EGO饰品获取',85]}

{判断 | [[{'楼层'},'等于',0],{组=['T楼层判断']}]}
{延时 | 1000 | 开关={'困难镜牢'}}
{延时 | 300 | 开关={'困难战斗'}}
//无法加载的通知太坏了
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[507,592,1093,649]] | 图片=['确认3','确认2','确认1',85]}

{找图 | 寻路 | 点击=['T',584,355,5] | 延时=200 | 范围=[[1457,6,1571,387]] | 图片=['地图','地图2',80]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 入场 | 点击=['T',1508,686,50,'2L'] | 跳转=['T地图纠错'] | 范围=[[1258,604,1587,746]] | 图片=['入场',85]}

{点击 | [911,407,50] | 延时=200 | 开关={'单行道'}}
{延时 | 100 | 开关={'单行道'}}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85] | 开关={'单行道'}}
{找图 | 入场 | 点击=['T',1508,686,50,'2L'] | 跳转=['T地图纠错'] | 范围=[[1258,604,1587,746]] | 图片=['入场',85] | 开关={'单行道'}}

{判断 | [[{'搜寻2列事件'},'等于',0],{跳至=['T','地图','寻找事件']}]}
{找图 | 车头 | 点击=['T',0,0,50,'L',1] | 范围=[[471,206,721,470]] | 图片=['车头',85]}
{找图 | 车头 | 点击=['T',0,0,50,'L',1] | 延时=100 | 范围=[[471,206,721,470]] | 图片=['车头',85]}
{移动 | [587,385,12]}
{点击 | [587,385,400,'L',2]}

{空参 | 寻找事件}
{赋值 | [[{'寻路Y1'},33],[{'寻路Y2'},253],[{'第2列事件'},0]]}
{找图 | 事件点 | 跳至=['T','地图','运行1'] | 计算=['F',[{'寻路Y1'},'+',270,{'寻路Y1'}],[{'寻路Y2'},'+',270,{'寻路Y2'}]] | 循环=['F',3,0] | 范围=[[825,{'寻路Y1'},984,{'寻路Y2'}]] | 图片=['问号1','问号2','问号3','问号4','问号5','问号6','问号7','问号8','问号-善意的巡礼',65]}
{判断 | [[{'搜寻2列事件'},'等于',0],{跳至=['T','地图','寻找链条战']}]}
{赋值 | [[{'寻路Y1'},33],[{'寻路Y2'},253],[{'第2列事件'},1]]}
{找图 | 事件点2 | 跳至=['T','地图','运行1'] | 计算=['F',[{'寻路Y1'},'+',270,{'寻路Y1'}],[{'寻路Y2'},'+',270,{'寻路Y2'}]] | 循环=['F',3,0] | 范围=[[1132,{'寻路Y1'},1332,{'寻路Y2'}]] | 图片=['问号1','问号2','问号3','问号4','问号5','问号6','问号7','问号8','问号-善意的巡礼',65]}

{空参 | 寻找链条战}
{赋值 | [[{'寻路Y1'},33],[{'寻路Y2'},253]]}
{找图 | 链条战 | 跳至=['T','地图','运行2'] | 计算=['F',[{'寻路Y1'},'+',270,{'寻路Y1'}],[{'寻路Y2'},'+',270,{'寻路Y2'}]] | 循环=['F',3,0] | 范围=[[825,{'寻路Y1'},984,{'寻路Y2'}]] | 图片=['链条战1','链条战2','链条战3','链条战4','链条战5','链条战6','链条战7','链条战8',55]}

{空参 | 寻找精锐战}
{判断 | [[{'打精锐'},'等于',0],{跳至=['T','地图','避开精锐战']}]}
{找图 | 精锐战斗S | 跳至=['T','地图','没辙了'] | 赋值=['T',[{'精锐S'},1]] | 范围=[[777,260,999,543]] | 图片=['精锐战斗',70]}
{找图 | 精锐战斗W | 跳至=['T','地图','没辙了'] | 赋值=['T',[{'精锐W'},1]] | 范围=[[777,15,999,276]] | 图片=['精锐战斗',70]}
{找图 | 精锐战斗X | 跳至=['T','地图','没辙了'] | 赋值=['T',[{'精锐X'},1]] | 范围=[[777,523,999,783]] | 图片=['精锐战斗',70]}

{空参 | 避开精锐战}
{赋值 | [[{'精锐W'},0],[{'精锐S'},0],[{'精锐X'},0]]}
{找图 | 精锐战斗S | 赋值=['T',[{'精锐S'},1]] | 范围=[[777,260,999,543]] | 图片=['精锐战斗',70]}
{找图 | 精锐战斗W | 赋值=['T',[{'精锐W'},1]] | 范围=[[777,15,999,276]] | 图片=['精锐战斗',70]}
{找图 | 精锐战斗X | 赋值=['T',[{'精锐X'},1]] | 范围=[[777,523,999,783]] | 图片=['精锐战斗',70]}

{跳至 | ['地图','A'] | 开关={'精锐S'}}
{点击 | [911,407,50] | 延时=200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 100}
{找图 | 入场 | 点击=['T',1508,686,50,'2L'] | 跳转=['T地图纠错'] | 范围=[[1258,604,1587,746]] | 图片=['入场',85]}
{空参 | A}
{跳至 | ['地图','B'] | 开关={'精锐W'}}
{点击 | [911,146,50] | 延时=300}
{找图 | 入场 | 点击=['T',1508,686,50,'2L'] | 跳转=['T地图纠错'] | 范围=[[1258,604,1587,746]] | 图片=['入场',85]}
{空参 | B}
{跳至 | ['地图','没辙了'] | 开关={'精锐X'}}
{点击 | [911,680,50] | 延时=300}
{找图 | 入场 | 点击=['T',1508,686,50,'2L'] | 跳转=['T地图纠错'] | 范围=[[1258,604,1587,746]] | 图片=['入场',85]}
{判断 | [[{'打精锐'},'等于',1],{跳转=['T地图']}]}

{空参 | 没辙了}
{点击 | [911,407,50] | 延时=200 | 开关={'精锐S'}}
{延时 | 100}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 入场 | 点击=['T',1508,686,50,'2L'] | 跳转=['T地图纠错'] | 范围=[[1258,604,1587,746]] | 图片=['入场',85]}
{点击 | [911,146,50] | 延时=300 | 开关={'精锐W'}}
{找图 | 入场 | 点击=['T',1508,686,50,'2L'] | 跳转=['T地图纠错'] | 范围=[[1258,604,1587,746]] | 图片=['入场',85]}
{点击 | [911,680,50] | 延时=300 | 开关={'精锐X'}}
{找图 | 入场 | 点击=['T',1508,686,50,'2L'] | 跳转=['T地图纠错'] | 范围=[[1258,604,1587,746]] | 图片=['入场',85]}
{判断 | [[{'打精锐'},'等于',1],{跳至=['T','地图','避开精锐战']}]}
{跳转 | '地图'}

{空参 | 运行1 | 计次=['T','事件寻找',5,{跳至=['T','地图','寻找链条战']}]}
{计算 | [[{'寻路Y1'},'+',75,{'运行Y'}]]}
{点击 | [882,{'运行Y'},50] | 延时=300}
{找图 | 入场 | 点击=['T',1508,686,50,'2L'] | 跳转=['T地图纠错'] | 计算=['F',[{'寻路Y1'},'+',270,{'寻路Y1'}],[{'寻路Y2'},'+',270,{'寻路Y2'}]] | 跳至=['F','地图','事件点2'] | 范围=[[1258,604,1587,746]] | 图片=['入场',85] | 开关={'第2列事件'}}
{找图 | 入场 | 点击=['T',1508,686,50,'2L'] | 跳转=['T地图纠错'] | 计算=['F',[{'寻路Y1'},'+',270,{'寻路Y1'}],[{'寻路Y2'},'+',270,{'寻路Y2'}]] | 跳至=['F','地图','事件点'] | 范围=[[1258,604,1587,746]] | 图片=['入场',85]}

{空参 | 运行2 | 计次=['T','链条寻找',3,{跳至=['T','地图','寻找精锐战']}]}
{计算 | [[{'寻路Y1'},'+',75,{'运行Y'}]]}
{点击 | [882,{'运行Y'},50] | 延时=300}
{找图 | 入场 | 点击=['T',1508,686,50,'2L'] | 跳转=['T地图纠错'] | 计算=['F',[{'寻路Y1'},'+',270,{'寻路Y1'}],[{'寻路Y2'},'+',270,{'寻路Y2'}]] | 跳至=['F','地图','链条战'] | 范围=[[1258,604,1587,746]] | 图片=['入场',85]}

)

[地图纠错]=(
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 选人页 | 跳转=['T选人页'] | 范围=[[1307,538,1409,654]] | 图片=['选人页',85]}
{找图 | 事件 | 跳转=['T事件'] | 范围=[[361,59,512,181]] | 图片=['事件',85]}
{找图 | 商店 | 跳转=['T商店'] | 范围=[[385,428,521,560]] | 图片=['商店',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}

{跳转 | '地图纠错'}
)

[战后奖励选择]=(
//BYD这里怎么要等这么久
{延时 | 1200}

{找图 | 报酬选择-星光 | 点击=['T',0,0,50] | 跳至=['T','战后奖励选择','确认'] | 范围=[[98,176,1540,669]] | 图片=['报酬选择-星光',75]}
{找图 | 报酬选择-饰品 | 点击=['T',0,0,50] | 跳至=['T','战后奖励选择','确认'] | 赋值=['T',[{'报酬饰品获取'},1]] | 范围=[[98,176,1540,669]] | 图片=['报酬选择-饰品',75] | 开关={'报酬选择饰品'}}
{找图 | 报酬选择-经费与饰品 | 点击=['T',0,0,50] | 跳至=['T','战后奖励选择','确认'] | 赋值=['T',[{'报酬饰品获取'},1]] | 范围=[[98,176,1540,669]] | 图片=['报酬选择-经费与饰品',75]}
{找图 | 报酬选择-经费 | 点击=['T',0,0,50] | 跳至=['T','战后奖励选择','确认'] | 范围=[[98,176,1540,669]] | 图片=['报酬选择-经费',85]}
{找图 | 报酬选择-E.G.O资源 | 点击=['T',0,0,50] | 跳至=['T','战后奖励选择','确认'] | 范围=[[98,176,1540,669]] | 图片=['报酬选择-EGO资源',75]}
{找图 | 报酬选择-饰品 | 点击=['T',0,0,50] | 跳至=['T','战后奖励选择','确认'] | 赋值=['T',[{'报酬饰品获取'},1]] | 范围=[[98,176,1540,669]] | 图片=['报酬选择-饰品',75]}

{空参 | 确认}
{按键 | ['ENTER',50]}
{延时 | 200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 500 | 开关={'报酬饰品获取'}}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 700}
{赋值 | [[{'报酬饰品获取'},0]]}
{找图 | 房间检索 | 跳转=['T房间检索'] | 循环=['F',13,100] | 范围=[[1457,6,1571,387],[1077,667,1297,784]] | 图片=['地图','地图2','EGO饰品选择',85]}
{跳转 | '房间检索'}
)

[结算]=(
{按键 | ['F12',50] | 开关={'结算时截图'}}
{组 | '不领取奖励' | 开关={'不领取奖励'}}
{空参 | 直到加成}
{按键 | ['ENTER',50]}
{延时 | 500}
{找图 | 直到加成 | 跳至=['F','结算','直到加成'] | 范围=[[318,240,550,379]] | 图片=['追加奖励',85]}
{跳转 | '存储一局' | 开关={'存储一局'}}
{点击 | [827,315,50] | 延时=500 | 开关={'加成领取单次'}}
{点击 | [693,315,50] | 延时=500 | 开关={'加成领取禁用'}}

{空参 | 直到加载}
{按键 | ['ENTER',50]}
{找图 | 无法结算 | 点击=['T',961,611,50] | 跳至=['T','模块合成','合成'] | 计次=['T','无法结算',2,{跳至=['T','运行','结束了']}] | 延时=600 | 范围=[[832,384,957,496]] | 图片=['无法结算',85]}
{延时 | 500}
{找图 | 主页 | 跳至=['T','结算','计算'] | 范围=[[539,740,752,892]] | 图片=['主页1','主页2',75]}
{找图 | 直到加载 | 跳至=['F','结算','直到加载'] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',85]}
{找图 | 主页 | 循环=['F',999,200] | 范围=[[539,740,752,892]] | 图片=['主页1','主页2',75]}

{空参 | 计算}
{重置计次 | '无法结算'}
{计算 | [[{'地牢次数'},'-',1,{'地牢次数'}]]}
{计算 | [[{'轮换队伍'},'+',1,{'轮换队伍'}]] | 开关={'队伍轮换'}}
{组 | '重置条件'}

{赋值 | [[{'自动日常'},1]] | 时间=[0,['大于','3:30:00'],['小于','5:00:00']] | 开关={'五点自动日常'}}
{跳转 | '运行'}
)
[走人]=(
{找图 | 走人 | 点击=['F',1511,60,50] | 范围=[[536,425,683,576]] | 图片=['走人',85]}
{延时 | 500}
{点击 | [671,549,50] | 延时=500}
{点击 | [960,609,50] | 延时=500}
{跳转 | '结算'}
)

[重新开始这一把]=(
{延时 | 1000}
{找图 | 返回 | 点击=['T',0,0,50] | 偏移=[20,0] | 循环=['T',3,1000] | 范围=[[61,17,178,99]] | 图片=['退回','退回2',77]}
{点击 | [1543,55,50] | 延时=500}
{点击 | [681,537,50] | 延时=500}
{点击 | [960,611,50] | 延时=500}

{组 | '不领取奖励'}
)
[不领取奖励]=(

{计算 | [[{'轮换队伍'},'+',1,{'轮换队伍'}]] | 开关={'队伍轮换'}}
{组 | '重置条件'}

{空参 | 试图结算}
{点击 | [1385,730,50] | 延时=500}
{点击 | [1385,730,50] | 延时=500}
{找图 | 走 | 点击=['T',491,685,50] | 延时=500 | 范围=[[318,240,550,379]] | 图片=['追加奖励',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 延时=500 | 偏移=[25,0] | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',75]}
{找图 | 主页 | 跳转=['T运行'] | 范围=[[539,740,752,892]] | 图片=['主页1','主页2',75]}
{跳至 | ['不领取奖励','试图结算']}
)
[存储一局]=(
{点击 | [797,681,50] | 延时=500}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',75]}
{停止 | 脚本}
)

[-=-=地牢战斗处理=-=-]=()

[选人页]=(
{跳至 | ['选人页','走了'] | 开关={'良秀死全家[地牢]'}}
{判断 | [[{'困难战斗'},'等于',1],{赋值=['T',[{'重新选人'},1]]}] | 开关={'喵的选人判断'}}
{跳至 | ['选人页','选人'] | 开关={'重新选人'}}
{判断 | [[{'旧版全灭'},'等于',0],{跳至=['T','选人页','选人']}] | 开关={'全灭放弃'}}
{跳至 | ['选人页','走了']}

{空参 | 选人}
{点击 | [1357,607,50] | 延时=500 | 开关={'重新选人'}}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=500 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',75]}
{赋值 | [[{'重新选人'},0]]}
{赋值 | [[{'死亡人数'},0]]}
{组 | {'角色顺位1'}}
{组 | {'角色顺位2'}}
{组 | {'角色顺位3'}}
{组 | {'角色顺位4'}}
{组 | {'角色顺位5'}}
{组 | {'角色顺位6'}}
{组 | {'角色顺位7'}}
{判断 | [[{'死亡人数'},'大于等于',{'全灭人数'}],{组=['T重新开始这一把']}] | 开关={'全灭放弃'}}
{判断 | [[{'困难战斗'},'等于',0],{跳至=['T','选人页','走了']}] | 开关={'喵的选人判断'}}
{组 | {'角色顺位8'}}
{跳至 | ['选人页','走了'] | 开关={'队伍轮换'}}
{组 | {'角色顺位9'}}
{组 | {'角色顺位10'}}
{组 | {'角色顺位11'}}
{组 | {'角色顺位12'}}

{空参 | 走了}
{按键 | ['ENTER',50]}
{延时 | 500}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 跳至=['T','选人页','选人'] | 延时=500 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',75]}
{移动 | [1500,800,200]}
{延时 | 800}
{跳转 | '房间检索'}
)

[战斗中]=(
{找图 | 集中战 | 赋值=['F',[{'集中战'},1],[{'链条战'},0]] | 范围=[[71,611,814,880]] | 图片=['道中作战',85]}
{找图 | 链条战 | 赋值=['T',[{'集中战'},0],[{'链条战'},1]] | 范围=[[71,611,814,880]] | 图片=['道中作战',85]}
{跳转 | '良秀全家活暗暗-地牢' | 开关={'良秀死全家[地牢]'}}
{判断 | [[{'楼层'},'等于',5],{赋值=['T',[{'释放EGO'},1]]}] | 开关={'第五层开始释放EGO'}}
{跳转 | '战斗H' | 开关={'困难战斗'}}
{判断 | [[{'楼层'},'小于',5],{跳至=['T','战斗中','继续']}] | 开关={'困难镜牢'}}
{判断 | [[{'取消拉条'},'等于',1],{组=['T战斗N']}] | 开关={'困难镜牢'}}
{空参 | 继续}
{找图 | 自动拉条 | 跳转=['T自动拉条'] | 范围=[[290,634,527,788]] | 图片=['道中作战',85] | 开关={'自动拉条'}}
{跳转 | '战斗N'}
)

[战斗N]=(
{找图 | bug | 点击=['T',1500,800,50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 混乱 | 组=['T混乱EGO释放'] | 范围=[[806,771,1402,888]] | 图片=['混乱','混乱+','混乱++',75] | 开关={'友方混乱使用EGO'}}
{组 | '五层EGO释放' | 开关={'释放EGO'}}
{空参 | 开P}
{点击 | ['T',1500,800,0,'L',2]}
{找图 | P | 按键=['T','P',50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 死亡重开 | 跳转=['T死亡重开'] | 范围=[[403,774,1587,897]] | 图片=['死亡',85] | 开关={'死亡重开'}}
{找图 | ENTER | 按键=['T','ENTER',50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{点击 | ['T',1500,800,0,'L',1]}
{空参 | 检查}
{找图 | 我说结束了 | 点击=['T',0,0,0] | 范围=[[588,305,999,613]] | 图片=['我说我赢了','我说我输了',80]}
{找图 | 死完了 | 跳转=['T全灭'] | 范围=[[437,368,742,573]] | 图片=['死完了',85]}

{找图 | 事件 | 点击=['T',1500,800,0,'L',2] | 跳转=['T事件'] | 赋值=['T',[{'战斗中'},1]] | 范围=[[361,59,512,181]] | 图片=['事件',85]}
{找图 | 重连尝试 | 点击=['T',1500,800,0,'L',2] | 组=['T房间检索'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 点击=['T',1500,800,0,'L',2] | 跳转=['T房间检索'] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',85]}
{找图 | 运转 | 跳至=['F','战斗N','检查'] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}

{跳转 | '战斗N'}
)

[战斗H]=(
{找图 | bug | 点击=['T',1500,800,50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 混乱 | 组=['T混乱EGO释放'] | 范围=[[806,771,1402,888]] | 图片=['混乱','混乱+','混乱++',75]}
{组 | '五层EGO释放' | 开关={'释放EGO'}}
{空参 | 开P}
{点击 | ['T',1500,800,0,'L',2]}
{找图 | P | 按键=['T','P',50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 死亡重开 | 跳转=['T死亡重开'] | 范围=[[403,774,1587,897]] | 图片=['死亡',85] | 开关={'无限死亡重开'}}
{找图 | ENTER | 按键=['T','ENTER',50] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{点击 | ['T',1500,800,0,'L',1]}
{空参 | 检查}
{找图 | 我说结束了 | 点击=['T',0,0,0] | 范围=[[588,305,999,613]] | 图片=['我说我赢了','我说我输了',80]}
{找图 | 死完了 | 跳转=['T全灭'] | 范围=[[437,368,742,573]] | 图片=['死完了',85]}

{找图 | 事件 | 点击=['T',1500,800,0,'L',2] | 跳转=['T事件'] | 赋值=['T',[{'战斗中'},1]] | 范围=[[361,59,512,181]] | 图片=['事件',85]}
{找图 | 重连尝试 | 点击=['T',1500,800,0,'L',2] | 组=['T房间检索'] | 赋值=['T',[{'困难战斗'},0]] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 点击=['T',1500,800,0,'L',2] | 跳转=['T房间检索'] | 赋值=['T',[{'困难战斗'},0]] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',85]}
{找图 | 运转 | 跳至=['F','战斗H','检查'] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{跳转 | '战斗H'}
)

[五层EGO释放]=(
{判断 | [[{'集中EGO'},'等于',0],{赋值=['T',[{'释放EGO'},0]] | 跳出='T'}] | 开关={'集中战'}}
{判断 | [[{'链条EGO'},'等于',0],{赋值=['T',[{'释放EGO'},0]] | 跳出='T'}] | 开关={'链条战'}}

{空参 | 输出型}
{判断 | [[{'五层输出EGO'},'等于',0],{跳至=['T','五层EGO释放','回复型']}]}
{组 | {'输出1位'}}
{组 | {'输出2位'}}
{组 | {'输出3位'}}

{判断 | [[{'五层回复EGO'},'等于',1],{跳至=['T','五层EGO释放','回复型']}]}
{跳至 | ['五层EGO释放','走了']}

{空参 | 回复型}
{判断 | [[{'五层回复EGO'},'等于',0],{跳至=['T','五层EGO释放','走了']}]}
{组 | {'回复1位'}}
{组 | {'回复2位'}}
{组 | {'回复3位'}}

{空参 | 走了}
{赋值 | [[{'释放EGO'},0]] | 开关={'EGO只释放一次'}}
{跳至 | ['战斗H','开P'] | 开关={'困难战斗'}}
{跳至 | ['战斗N','开P']}
)
[混乱EGO释放]=(

{空参 | 输出型}
{判断 | [[{'混乱输出EGO'},'等于',0],{跳至=['T','混乱EGO释放','回复型']}]}
{组 | {'输出1位'}}
{组 | {'输出2位'}}
{组 | {'输出3位'}}

{判断 | [[{'混乱回复EGO'},'等于',1],{跳至=['T','混乱EGO释放','回复型']}]}
{跳至 | ['混乱EGO释放','走了']}

{空参 | 回复型}
{判断 | [[{'混乱输出EGO'},'等于',0],{跳至=['T','混乱EGO释放','走了']}]}
{组 | {'回复1位'}}
{组 | {'回复2位'}}
{组 | {'回复3位'}}

{空参 | 走了}
{跳至 | ['战斗H','开P'] | 开关={'困难战斗'}}
{跳至 | ['战斗N','开P']}
)

[自动拉条]=(
{赋值 | [[{'守备'},1]] | 开关={'拉条守备'}}
{赋值 | [[{'中指反击'},1]] | 开关={'中指开局反击'}}
{找图 | 7 | 跳转=['T仪表盘重新赋值'] | 赋值=['T',[{'拉条回合'},2]] | 范围=[[296,658,342,747]] | 图片=['道中作战',80]}
{找图 | 6 | 跳转=['T仪表盘重新赋值'] | 赋值=['T',[{'拉条回合'},1]] | 范围=[[344,658,388,747]] | 图片=['道中作战',80]}
{组 | '战斗N'}
)
[道中检测A]=(
{空参 | 准备}
{找图 | 死亡重开 | 跳转=['T死亡重开'] | 范围=[[403,774,1587,897]] | 图片=['死亡',75] | 开关={'死亡重开'}}
{找图 | 战斗中 | 跳至=['T','道中检测A','开拉'] | 计算=['T',[{'拉条回合'},'+',1,{'拉条回合'}]] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 我说结束了 | 点击=['T',0,0,50] | 范围=[[588,305,999,613]] | 图片=['我说我赢了','我说我输了',70]}
{找图 | 死完了 | 跳转=['T全灭'] | 范围=[[437,368,742,573]] | 图片=['死完了',85]}

{找图 | 重连尝试 | 跳转=['T经验结算'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85] | 开关={'经验'}}
{找图 | 加载中 | 跳转=['T经验结算'] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',82] | 开关={'经验'}}
{延时 | 200 | 开关={'经验'}}
{跳至 | ['道中检测A','准备'] | 开关={'经验'}}
{找图 | 暂时性处理 | 跳转=['T房间检索'] | 范围=[[466,27,1581,784]] | 图片=['地图','地图2','地图3','战后奖励选择','EGO饰品选择',85]}
{找图 | 重连尝试 | 跳转=['T房间检索'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 跳转=['T房间检索'] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',82]}
{延时 | 200}
{跳至 | ['道中检测A','准备']}

{空参 | 检测}
{找图 | 战斗中 | 跳转=['T经验战斗'] | 跳转=['F仪表盘重新赋值'] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75] | 开关={'经验'}}
{找图 | 战斗中 | 跳转=['T战斗N'] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{组 | '仪表盘重新赋值'}

{空参 | 开拉}
{找图 | 1 | 判断=['T',[{'拉条回合'},'等于',1],{跳至=['T','道中检测A','A1']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 2 | 判断=['T',[{'拉条回合'},'等于',2],{跳至=['T','道中检测A','A2']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 3 | 判断=['T',[{'拉条回合'},'等于',3],{跳至=['T','道中检测A','A3']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 4 | 判断=['T',[{'拉条回合'},'等于',4],{跳至=['T','道中检测A','A4']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 5 | 判断=['T',[{'拉条回合'},'等于',5],{跳至=['T','道中检测A','A5']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 6 | 判断=['T',[{'拉条回合'},'等于',6],{跳至=['T','道中检测A','A6']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 7 | 判断=['T',[{'拉条回合'},'等于',7],{跳至=['T','道中检测A','A7']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 8 | 判断=['T',[{'拉条回合'},'等于',8],{跳至=['T','道中检测A','A8']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{跳至 | ['道中检测A','准备']}

{空参 | A1}
//这里没有存在的意义了

{空参 | A2}
{找图 | 1 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[459,785,561,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 2 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[561,785,663,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 3 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[663,785,765,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 4 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[765,785,867,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 5 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[867,785,969,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 6 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[969,785,1071,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}

{空参 | A01}
{找图 | 1 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[459,785,561,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 2 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[561,785,663,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 3 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[663,785,765,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 4 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[765,785,867,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 5 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[867,785,969,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 6 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[969,785,1071,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}

{赋值 | [[{'守备'},0]]}
{赋值 | [[{'中指反击'},0]]}
{移动 | [611,732,200,2]}
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[518,620,602,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[602,620,686,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[686,620,770,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[770,620,854,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[854,620,938,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[938,620,1022,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}

{点击 | ['T',378,710,50,'L',1]}
{移动 | [378,785,25,10]}
{移动 | [520,{'仪表盘1'},75,10]}
{移动 | [616,{'仪表盘2'},75,10]}
{移动 | [712,{'仪表盘3'},25,10]}
{移动 | [808,{'仪表盘4'},75,10]}
{移动 | [904,{'仪表盘5'},75,10]}
{移动 | [1000,{'仪表盘6'},25,10]}
{点击 | ['T',1149,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测A','检测']}

{空参 | A3}
{找图 | 1 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[410,785,512,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 2 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[512,785,614,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 3 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[614,785,716,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 4 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[716,785,818,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 5 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[818,785,920,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 6 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[920,785,1022,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 7 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[1022,785,1124,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}

{空参 | A02}
{找图 | 1 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[410,785,512,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 2 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[512,785,614,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 3 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[614,785,716,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 4 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[716,785,818,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 5 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[818,785,920,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 6 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[920,785,1022,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 7 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[1022,785,1124,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}


{赋值 | [[{'守备'},0]]}
{赋值 | [[{'中指反击'},0]]}
{移动 | [565,732,200,2]}
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[476,620,560,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[560,620,644,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[644,620,728,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[728,620,812,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[812,620,896,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[896,620,980,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[980,620,1064,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}

{点击 | ['T',331,710,50,'L',1]}
{移动 | [331,785,25,10]}
{移动 | [466,{'仪表盘1'},75,10]}
{移动 | [562,{'仪表盘2'},75,10]}
{移动 | [658,{'仪表盘3'},25,10]}
{移动 | [754,{'仪表盘4'},75,10]}
{移动 | [850,{'仪表盘5'},75,10]}
{移动 | [946,{'仪表盘6'},25,10]}
{移动 | [1042,{'仪表盘7'},25,10]}
{点击 | ['T',1191,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测A','检测']}

{空参 | A4}
{移动 | [611,732,200,2]}
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[434,620,518,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[518,620,602,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[602,620,686,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[686,620,770,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[770,620,854,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[854,620,938,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[938,620,1022,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 8 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[1022,620,1106,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{点击 | ['T',283,710,50,'L',1]}
{移动 | [283,785,25,10]}
{移动 | [418,{'仪表盘1'},75,10]}
{移动 | [514,{'仪表盘2'},75,10]}
{移动 | [610,{'仪表盘3'},25,10]}
{移动 | [706,{'仪表盘4'},75,10]}
{移动 | [802,{'仪表盘5'},75,10]}
{移动 | [898,{'仪表盘6'},25,10]}
{移动 | [994,{'仪表盘7'},75,10]}
{移动 | [1090,{'仪表盘8'},25,10]}
{点击 | ['T',1239,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测A','检测']}

{空参 | A5}
{移动 | [565,732,200,2]}
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[392,620,476,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[476,620,560,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[560,620,644,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[644,620,728,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[728,620,812,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[812,620,896,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[896,620,980,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 8 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[980,620,1064,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 9 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[1064,620,1148,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{点击 | ['T',236,710,50,'L',1]}
{移动 | [236,785,25,10]}
{移动 | [371,{'仪表盘1'},75,10]}
{移动 | [467,{'仪表盘2'},75,10]}
{移动 | [563,{'仪表盘3'},25,10]}
{移动 | [659,{'仪表盘4'},75,10]}
{移动 | [755,{'仪表盘5'},75,10]}
{移动 | [851,{'仪表盘6'},25,10]}
{移动 | [947,{'仪表盘7'},75,10]}
{移动 | [1043,{'仪表盘8'},75,10]}
{移动 | [1139,{'仪表盘9'},25,10]}
{点击 | ['T',1288,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测A','检测']}

{空参 | A6}
{移动 | [611,732,200,2]}
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[350,620,434,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[434,620,518,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[518,620,602,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[602,620,686,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[686,620,770,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[770,620,854,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[854,620,938,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 8 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[938,620,1022,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 9 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[1022,620,1106,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 10 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1106,620,1190,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{点击 | ['T',189,710,50,'L',1]}
{移动 | [189,785,25,10]}
{移动 | [324,{'仪表盘1'},75,10]}
{移动 | [420,{'仪表盘2'},75,10]}
{移动 | [516,{'仪表盘3'},25,10]}
{移动 | [612,{'仪表盘4'},75,10]}
{移动 | [708,{'仪表盘5'},75,10]}
{移动 | [804,{'仪表盘6'},25,10]}
{移动 | [900,{'仪表盘7'},75,10]}
{移动 | [996,{'仪表盘8'},75,10]}
{移动 | [1092,{'仪表盘9'},25,10]}
{移动 | [1188,{'仪表盘10'},25,10]}
{点击 | ['T',1337,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测A','检测']}

{空参 | A7}
{移动 | [565,732,200,2]}
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[308,620,392,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[392,620,476,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[476,620,560,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[560,620,644,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[644,620,728,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[728,620,812,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[812,620,896,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 8 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[896,620,980,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 9 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[980,620,1064,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 10 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1064,620,1148,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 11 | 赋值=['T',[{'仪表盘11'},840]] | 范围=[[1148,620,1232,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{点击 | ['T',142,710,50,'L',1]}
{移动 | [142,785,25,10]}
{移动 | [277,{'仪表盘1'},75,10]}
{移动 | [373,{'仪表盘2'},75,10]}
{移动 | [469,{'仪表盘3'},25,10]}
{移动 | [565,{'仪表盘4'},75,10]}
{移动 | [661,{'仪表盘5'},75,10]}
{移动 | [757,{'仪表盘6'},25,10]}
{移动 | [853,{'仪表盘7'},75,10]}
{移动 | [949,{'仪表盘8'},75,10]}
{移动 | [1045,{'仪表盘9'},25,10]}
{移动 | [1141,{'仪表盘10'},75,10]}
{移动 | [1237,{'仪表盘11'},25,10]}
{点击 | ['T',1385,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测A','检测']}

{空参 | A8}
{移动 | [611,732,200,2]}
{延时 | 100}
{找图 | 1 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[266,620,350,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 2 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[350,620,434,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 3 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[434,620,518,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 4 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[518,620,602,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 5 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[602,620,686,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 6 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[686,620,770,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 7 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[770,620,854,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 8 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[854,620,938,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 9 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[938,620,1022,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 10 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1022,620,1106,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 11 | 赋值=['T',[{'仪表盘11'},840]] | 范围=[[1106,620,1190,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{找图 | 12 | 赋值=['T',[{'仪表盘12'},840]] | 范围=[[1190,620,1274,680]] | 图片=['愤怒三技能','色欲三技能','嫉妒三技能','怠惰三技能','忧郁三技能','暴食三技能','傲慢三技能',54]}
{点击 | ['T',93,710,50,'L',1]}
{移动 | [93,785,25,10]}
{移动 | [228,{'仪表盘1'},75,10]}
{移动 | [324,{'仪表盘2'},75,10]}
{移动 | [420,{'仪表盘3'},25,10]}
{移动 | [516,{'仪表盘4'},75,10]}
{移动 | [612,{'仪表盘5'},75,10]}
{移动 | [708,{'仪表盘6'},25,10]}
{移动 | [804,{'仪表盘7'},75,10]}
{移动 | [900,{'仪表盘8'},75,10]}
{移动 | [996,{'仪表盘9'},25,10]}
{移动 | [1092,{'仪表盘10'},75,10]}
{移动 | [1188,{'仪表盘11'},75,10]}
{移动 | [1284,{'仪表盘12'},25,10]}
{点击 | ['T',1385,779,50,'L',2]}
{按键 | ['ENTER',50]}
{计算 | [[{'拉条回合'},'-',1,{'拉条回合'},{'拉条回合'}]]}
{延时 | 1000}
{跳至 | ['道中检测A','检测']}
)
[道中检测B]=(
{空参 | 准备}
{找图 | 死亡重开 | 跳转=['T死亡重开'] | 范围=[[403,774,1587,897]] | 图片=['死亡',75] | 开关={'死亡重开'}}
{找图 | 战斗中 | 跳至=['T','道中检测B','开拉'] | 计算=['T',[{'拉条回合'},'+',1,{'拉条回合'}]] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 我说结束了 | 点击=['T',0,0,50] | 范围=[[588,305,999,613]] | 图片=['我说我赢了','我说我输了',70]}
{找图 | 死完了 | 跳转=['T全灭'] | 范围=[[437,368,742,573]] | 图片=['死完了',85]}

{找图 | 重连尝试 | 跳转=['T经验结算'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85] | 开关={'经验'}}
{找图 | 加载中 | 跳转=['T经验结算'] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',85] | 开关={'经验'}}
{延时 | 200 | 开关={'经验'}}
{跳至 | ['道中检测B','准备'] | 开关={'经验'}}
{找图 | 暂时性处理 | 跳转=['T房间检索'] | 范围=[[466,27,1581,784]] | 图片=['地图','地图2','地图3','战后奖励选择','EGO饰品选择',85]}
{找图 | 重连尝试 | 跳转=['T房间检索'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 加载中 | 跳转=['T房间检索'] | 范围=[[1163,821,1532,866]] | 图片=['加载中1','加载中2',85]}
{延时 | 200}
{跳至 | ['道中检测B','准备']}

{空参 | 检测}
{找图 | 战斗中 | 跳转=['T经验战斗'] | 跳转=['F仪表盘重新赋值'] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75] | 开关={'经验'}}
{找图 | 战斗中 | 跳转=['T战斗N'] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{组 | '仪表盘重新赋值'}
{空参 | 开拉}
{找图 | 1 | 判断=['T',[{'拉条回合'},'等于',1],{跳至=['T','道中检测B','B1']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 2 | 判断=['T',[{'拉条回合'},'等于',2],{跳至=['T','道中检测B','B2']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 3 | 判断=['T',[{'拉条回合'},'等于',3],{跳至=['T','道中检测B','B3']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 4 | 判断=['T',[{'拉条回合'},'等于',4],{跳至=['T','道中检测B','B4']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 5 | 判断=['T',[{'拉条回合'},'等于',5],{跳至=['T','道中检测B','B5']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 6 | 判断=['T',[{'拉条回合'},'等于',6],{跳至=['T','道中检测B','B6']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 7 | 判断=['T',[{'拉条回合'},'等于',7],{跳至=['T','道中检测B','B7']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{找图 | 8 | 判断=['T',[{'拉条回合'},'等于',8],{跳至=['T','道中检测B','B8']}] | 范围=[[1250,8,1475,85]] | 图片=['战斗中',75]}
{跳至 | ['道中检测B','准备']}

{空参 | B1}
//这里没有存在的意义了

{空参 | B2}
{找图 | 1 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[459,785,561,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 2 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[561,785,663,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 3 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[663,785,765,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 4 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[765,785,867,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 5 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[867,785,969,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 6 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[969,785,1071,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}

{空参 | B01}
{找图 | 1 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[459,785,561,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 2 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[561,785,663,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 3 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[663,785,765,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 4 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[765,785,867,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 5 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[867,785,969,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 6 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[969,785,1071,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}

{赋值 | [[{'守备'},0]]}
{赋值 | [[{'中指反击'},0]]}
{延时 | 200}
{点击 | ['T',400,710,50,'L',1]}
{移动 | [400,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[510,670,575,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [520,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[615,670,675,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [615,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[710,670,775,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [710,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[805,670,865,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [805,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[900,670,960,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [900,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[995,670,1065,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [995,{'仪表盘6'},75,10] | 延时=40}
{点击 | ['T',1085,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测B','检测']}

{空参 | B3}
{找图 | 1 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[410,785,512,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 2 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[512,785,614,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 3 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[614,785,716,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 4 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[716,785,818,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 5 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[818,785,920,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 6 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[920,785,1022,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}
{找图 | 7 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[1022,785,1124,870]] | 图片=[{'守备选人1'},{'守备选人2'},{'守备选人3'},{'守备选人4'},{'守备选人5'},{'守备选人6'},{'守备选人7'},{'守备选人8'},80] | 开关={'守备'}}

{空参 | B02}
{找图 | 1 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[410,785,512,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 2 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[512,785,614,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 3 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[614,785,716,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 4 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[716,785,818,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 5 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[818,785,920,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 6 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[920,785,1022,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}
{找图 | 7 | 点击=['T',0,0,25] | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[1022,785,1124,870]] | 图片=['中指_堂','中指_默','中指_夫','中指_玛','中指_辛','中指_奥',80] | 开关={'中指反击'}}

{赋值 | [[{'守备'},0]]}
{赋值 | [[{'中指反击'},0]]}
{延时 | 200}
{点击 | ['T',340,710,50,'L',1]}
{移动 | [340,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[470,670,520,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [470,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[560,670,620,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [565,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[660,670,710,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [660,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[755,670,805,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [755,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[850,670,900,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [850,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[945,670,995,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [945,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[1040,670,1090,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1040,{'仪表盘7'},75,10] | 延时=40}
{点击 | ['T',1166,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测B','检测']}

{空参 | B4}
{延时 | 200}
{点击 | ['T',305,710,50,'L',1]}
{移动 | [305,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[425,670,475,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [425,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[520,670,570,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [520,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[615,670,665,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [615,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[710,670,760,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [710,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[805,670,855,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [805,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[895,670,970,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [895,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[990,670,1070,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [990,{'仪表盘7'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[1085,670,1170,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1085,{'仪表盘8'},75,10] | 延时=40}
{点击 | ['T',1200,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测B','检测']}

{空参 | B5}
{延时 | 200}
{点击 | ['T',261,714,50,'L',1]}
{移动 | [261,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[380,670,430,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [380,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[475,670,525,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [475,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[570,670,620,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [570,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[665,670,715,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [665,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[760,670,810,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [760,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[855,670,905,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [855,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[950,670,1000,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [950,{'仪表盘7'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[1045,670,1095,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1045,{'仪表盘8'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[1140,670,1190,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1140,{'仪表盘9'},75,10] | 延时=40}
{点击 | ['T',1267,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测B','检测']}

{空参 | B6}
{延时 | 200}
{点击 | ['T',210,713,50,'L',1]}
{移动 | [210,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[330,670,380,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [330,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[425,670,475,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [425,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[520,670,570,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [520,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[615,670,665,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [615,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[710,670,760,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [710,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[805,670,866,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [805,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[900,670,950,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [900,{'仪表盘7'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[95,670,10745,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [995,{'仪表盘8'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[1090,670,1140,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1090,{'仪表盘9'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1185,670,1235,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1185,{'仪表盘10'},75,10] | 延时=40}
{点击 | ['T',1310,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测B','检测']}

{空参 | B7}
{延时 | 200}
{点击 | ['T',160,710,50,'L',1]}
{移动 | [160,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[285,670,335,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [285,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[380,670,430,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [380,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[475,670,525,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [475,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[570,670,620,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [570,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[665,670,715,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [665,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[760,670,810,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [760,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[855,670,905,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [855,{'仪表盘7'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[950,670,1000,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [950,{'仪表盘8'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[1045,670,1095,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1045,{'仪表盘9'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1140,670,1285,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1140,{'仪表盘10'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘11'},840]] | 范围=[[1235,670,1380,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1235,{'仪表盘11'},75,10] | 延时=40}
{点击 | ['T',1370,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{跳至 | ['道中检测B','检测']}

{空参 | B8}
{延时 | 200}
{点击 | ['T',112,710,50,'L',1]}
{移动 | [112,785,25,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘1'},840]] | 范围=[[230,670,280,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [230,{'仪表盘1'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘2'},840]] | 范围=[[325,670,375,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [325,{'仪表盘2'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘3'},840]] | 范围=[[420,670,470,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [420,{'仪表盘3'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘4'},840]] | 范围=[[515,670,565,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [515,{'仪表盘4'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘5'},840]] | 范围=[[610,670,660,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [610,{'仪表盘5'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘6'},840]] | 范围=[[705,670,755,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [705,{'仪表盘6'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘7'},840]] | 范围=[[800,670,850,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [800,{'仪表盘7'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘8'},840]] | 范围=[[895,670,945,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [895,{'仪表盘8'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘9'},840]] | 范围=[[990,670,1040,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [990,{'仪表盘9'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘10'},840]] | 范围=[[1085,670,1135,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1085,{'仪表盘10'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘11'},840]] | 范围=[[1180,670,1275,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1180,{'仪表盘11'},75,10] | 延时=40}
{找图 | 三技能 | 赋值=['T',[{'仪表盘12'},840]] | 范围=[[1280,670,1330,754]] | 图片=['愤怒三技能2','色欲三技能2','嫉妒三技能2','怠惰三技能2','忧郁三技能2','暴食三技能2','傲慢三技能2',50]}
{移动 | [1280,{'仪表盘12'},75,10] | 延时=40}
{点击 | ['T',1410,779,50,'L',2]}
{按键 | ['ENTER',50]}
{延时 | 1000}
{计算 | [[{'拉条回合'},'-',1,{'拉条回合'},{'拉条回合'}]]}
{跳至 | ['道中检测B','检测']}
)
[仪表盘重新赋值]=(
//无法加载的通知太坏了
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=200 | 范围=[[507,592,1093,649]] | 图片=['确认3','确认2','确认1',85]}
{赋值 | [[{'仪表盘1'},710]]}
{赋值 | [[{'仪表盘2'},710]]}
{赋值 | [[{'仪表盘3'},710]]}
{赋值 | [[{'仪表盘4'},710]]}
{赋值 | [[{'仪表盘5'},710]]}
{赋值 | [[{'仪表盘6'},710]]}
{赋值 | [[{'仪表盘7'},710]]}
{赋值 | [[{'仪表盘8'},710]]}
{赋值 | [[{'仪表盘9'},710]]}
{赋值 | [[{'仪表盘10'},710]]}
{赋值 | [[{'仪表盘11'},710]]}
{赋值 | [[{'仪表盘12'},710]]}
{移动 | [1195,30,200,2]}

{跳至 | ['仪表盘重新赋值','2'] | 开关={'经验拉条'}}
{空参 | 1}
{判断 | [[{'拉条A'},'等于',1],{跳转=['T道中检测A'] | 计算=['T',[{'经验拉条回合'},'+',1,{'经验拉条回合'}]]}] | 开关={'经验'}}
{判断 | [[{'拉条B'},'等于',1],{跳转=['T道中检测B'] | 计算=['T',[{'经验拉条回合'},'+',1,{'经验拉条回合'}]]}] | 开关={'经验'}}
{判断 | [[{'拉条A'},'等于',0],{跳转=['T道中检测A'] | 计算=['T',[{'经验拉条回合'},'+',1,{'经验拉条回合'}]]}] | 开关={'经验'}}
{跳转 | '道中检测A' | 开关={'拉条A'}}
{跳转 | '道中检测B' | 开关={'拉条B'}}
{空参 | 2}
{空参 | 斩击 | 判断=['TF',[{'斩击经验'},'大于',{'斩击拉条'}],{跳至=['T','仪表盘重新赋值','刺击']}]}
{判断 | [[{'经验拉条回合'},'大于等于',{'斩击拉条回合'}],{跳转=['T经验战斗'] | 赋值=['T',[{'经验拉条回合'},0]] | 跳至=['F','仪表盘重新赋值','1']}] | 开关={'斩击经验'}}
{空参 | 刺击 | 判断=['TF',[{'刺击经验'},'大于',{'刺击拉条'}],{跳至=['T','仪表盘重新赋值','打击']}]}
{判断 | [[{'经验拉条回合'},'大于等于',{'刺击拉条回合'}],{跳转=['T经验战斗'] | 赋值=['T',[{'经验拉条回合'},0]] | 跳至=['F','仪表盘重新赋值','1']}] | 开关={'刺击经验'}}
{空参 | 打击 | 判断=['TF',[{'打击经验'},'大于',{'打击拉条'}],{跳转=['T经验战斗']}]}
{判断 | [[{'经验拉条回合'},'大于等于',{'打击拉条回合'}],{跳转=['T经验战斗'] | 赋值=['T',[{'经验拉条回合'},0]] | 跳至=['F','仪表盘重新赋值','1']}] | 开关={'打击经验'}}
{跳转 | '经验战斗' | 开关={'经验'}}
{跳至 | ['仪表盘重新赋值','1']}
)

[死亡重开]=(
{点击 | [1544,51,50] | 延时=500}
{点击 | [795,467,50] | 延时=500}
{赋值 | [[{'困难战斗'},1],[{'释放EGO'},1]]}
{延时 | 2000}
{找图 | 我说结束了 | 点击=['T',0,0,50] | 循环=['T',99,100] | 范围=[[588,305,999,613]] | 图片=['我说我赢了','我说我输了',80]}
{延时 | 5000}
{跳转 | '房间检索'}
)
[全灭]=(
{延时 | 500}
{计算 | [[{'全灭次数'},'+',1,{'全灭次数'}]]}
{判断 | [[{'全灭次数'},'大于',3],{跳至=['T','全灭','重开']}]}
{点击 | [1026,420,50,'2L'] | 延时=500}
{点击 | [874,663,50]}
{找图 | 房间检索 | 循环=['F',999,100] | 范围=[[1250,8,1475,85],[361,59,512,181]] | 图片=['战斗中','事件',75]}
{跳转 | '房间检索'}

{空参 | 重开}
{点击 | [1026,557,50,'2L'] | 延时=500}
{点击 | [874,663,50]}
{找图 | 地图 | 循环=['F',999,100] | 范围=[[1457,6,1571,387]] | 图片=['地图','地图2','地图3',85]}
{跳转 | '重新开始这一把'}
)

[-=-=地牢商店处理=-=-]=()

[商店各楼层功能生效]=(
{赋值 | [[{'饰品升级'},0],[{'饰品合成'},0],[{'饰品购买'},0],[{'技能替换'},0]]}
{判断 | [[{'楼层'},'等于',0],{组=['T楼层判断']}]}
{判断 | [[{'楼层'},'等于',1],{跳至=['T','商店各楼层功能生效','第一层']}]}
{判断 | [[{'楼层'},'等于',2],{跳至=['T','商店各楼层功能生效','第二层']}]}
{判断 | [[{'楼层'},'等于',3],{跳至=['T','商店各楼层功能生效','第三层']}]}
{判断 | [[{'楼层'},'等于',4],{跳至=['T','商店各楼层功能生效','第四层']}]}
{判断 | [[{'楼层'},'等于',5],{跳至=['T','商店各楼层功能生效','第五层']}]}
{空参 | 第一层}
{赋值 | [[{'饰品升级'},1]] | 开关={'升级-第一层'}}
{赋值 | [[{'饰品合成'},1]] | 开关={'合成-第一层'}}
{赋值 | [[{'饰品购买'},1]] | 开关={'购买-第一层'}}
{赋值 | [[{'技能替换'},1]] | 开关={'技能-第一层'}}
{跳至 | ['商店','开始']}
{空参 | 第二层}
{赋值 | [[{'饰品升级'},1]] | 开关={'升级-第二层'}}
{赋值 | [[{'饰品合成'},1]] | 开关={'合成-第二层'}}
{赋值 | [[{'饰品购买'},1]] | 开关={'购买-第二层'}}
{赋值 | [[{'技能替换'},1]] | 开关={'技能-第二层'}}
{跳至 | ['商店','开始']}
{空参 | 第三层}
{赋值 | [[{'饰品升级'},1]] | 开关={'升级-第三层'}}
{赋值 | [[{'饰品合成'},1]] | 开关={'合成-第三层'}}
{赋值 | [[{'饰品购买'},1]] | 开关={'购买-第三层'}}
{赋值 | [[{'技能替换'},1]] | 开关={'技能-第三层'}}
{跳至 | ['商店','开始']}
{空参 | 第四层}
{赋值 | [[{'饰品升级'},1]] | 开关={'升级-第四层'}}
{赋值 | [[{'饰品合成'},1]] | 开关={'合成-第四层'}}
{赋值 | [[{'饰品购买'},1]] | 开关={'购买-第四层'}}
{赋值 | [[{'技能替换'},1]] | 开关={'技能-第四层'}}
{跳至 | ['商店','开始']}
{空参 | 第五层}
{赋值 | [[{'饰品升级'},1]] | 开关={'升级-第五层'}}
{赋值 | [[{'饰品合成'},1]] | 开关={'合成-第五层'}}
{赋值 | [[{'饰品购买'},1]] | 开关={'购买-第五层'}}
{赋值 | [[{'技能替换'},1]] | 开关={'技能-第五层'}}
{跳至 | ['商店','开始']}
)
[商店]=(
{延时 | 300}
{判断 | [[{'商店终止'},'等于',1],{跳至=['T','运行','结束了']}]}
{判断 | [[{'商店启用'},'等于',0],{跳至=['T','商店','直接跑']}]}
{跳转 | '商店各楼层功能生效'}
{空参 | 开始}
{判断 | [[{'楼层'},'小于',5],{赋值=['T',[{'技能替换'},0]]}] | 开关={'防红玫瑰'}}
{移动 | [1022,38,100]}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 循环=['T',3,500] | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{判断 | [[{'喵的选人判断'},'等于',0],{跳至=['T','商店','非困难']}]}
{判断 | [[{'楼层'},'小于',4],{跳至=['T','商店','非困难']}]}
{赋值 | [[{'困难战斗'},1],[{'释放EGO'},1]] | 开关={'困难镜牢'}}
{空参 | 非困难}
{组 | '商店回复判断' | 开关={'商店回复'}}
{空参 | 升级}
{组 | '升级EGO饰品' | 开关={'饰品升级'}}
{空参 | 购买}
{组 | '商店坐标' | 开关={'饰品购买'}}
{组 | '商店坐标' | 开关={'技能替换'}}
{空参 | 合成}
{组 | '合成EGO饰品' | 开关={'启用合成'}}
{空参 | 退出}
{赋值 | [[{'商店已刷新次数'},0],[{'坐标X'},0],[{'坐标Y'},0],[{'升级合成'},0]]}
{空参 | 直接跑}
{找色 | 继续 | 点击=['T',1506,826,50] | 延时=500 | 范围=[[1144,604,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}
{按键 | ['ENTER',50]}
{延时 | 200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 800}
{跳转 | '房间检索'}
)
[技能观测]=(
{找图 | 观测罪人选择 | 跳出='F' | 延时=100 | 范围=[[622,3,736,85]] | 图片=['观测罪人选择',85]}
//算了懒得做,没啥用还容易出bug

)
[技能组]=(
{找图 | 技能交换 | 跳出='F' | 延时=100 | 范围=[[510,119,647,222]] | 图片=['技能交换',85]}
{点击 | [385,420,50] | 延时=150 | 开关={'技能1→2'}}
{点击 | [828,427,50] | 延时=150 | 开关={'技能2→3'}}
{点击 | [1203,430,50] | 延时=150 | 开关={'技能1→3'}}
{点击 | [996,664,50] | 延时=500}
{点击 | [996,664,50] | 延时=500}
{找图 | 技能交换 | 点击=['T',752,91,50] | 跳出='F' | 延时=100 | 范围=[[510,119,647,222]] | 图片=['技能交换',85]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 200}
{判断 | [[{'饰品购买'},'等于',0],{跳至=['T','商店','合成']}]}
{跳出 | 'TF'}
)
[商店回复判断]=(

{找图 | 商店回复1 | 组=['F商店回复'] | 范围=[[84,823,111,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回复2 | 组=['F商店回复'] | 范围=[[176,823,209,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回复3 | 组=['F商店回复'] | 范围=[[278,823,306,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回复4 | 组=['F商店回复'] | 范围=[[375,823,400,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回复5 | 组=['F商店回复'] | 范围=[[462,823,496,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回复6 | 组=['F商店回复'] | 范围=[[565,823,591,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回复7 | 组=['F商店回复'] | 范围=[[656,823,689,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回复8 | 组=['F商店回复'] | 范围=[[754,823,786,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回复9 | 组=['F商店回复'] | 范围=[[852,823,883,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回复11 | 组=['F商店回复'] | 范围=[[949,823,977,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回复12 | 组=['F商店回复'] | 范围=[[1043,823,1074,857]] | 图片=['商店血量1','商店血量2',80]}
{找图 | 商店回复13 | 组=['F商店回复'] | 范围=[[1143,823,1171,857]] | 图片=['商店血量1','商店血量2',80]}
{跳出 | 'TF'}
)


[商店回复]=(
{点击 | [255,600,50] | 延时=500}
{点击 | [1174,417,50] | 延时=500}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{点击 | [748,383,50] | 延时=300}
{点击 | [1208,586,50] | 延时=300}
{找色 | 继续 | 点击=['T',1506,826,50] | 延时=500 | 范围=[[1144,604,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}
{按键 | ['ENTER',50]}
{找图 | 地图 | 组=['T地图'] | 范围=[[1457,6,1571,387]] | 图片=['地图','地图2','地图3',85]}
{找图 | 商店 | 跳至=['T','商店','升级'] | 范围=[[248,115,670,443]] | 图片=['商店',75]}
{跳出 | 'TF'}
)
[-=购买饰品=-]=()
[商店坐标]=(
{赋值 | [[{'商店范围坐标X1'},473],[{'商店范围坐标Y1'},239],[{'商店范围坐标X2'},697],[{'商店范围坐标Y2'},476]]}
{组 | '商店坐标X'}
)

[商店坐标X]=(
{赋值 | [[{'脏东西'},0],[{'买过了'},0]]}
{计算 | [[{'商店范围坐标X1'},'+',194,{'商店范围坐标X1'}],[{'商店范围坐标X2'},'+',194,{'商店范围坐标X2'}],[{'坐标X'},'+',1,{'坐标X'}]]}
{判断 | [[{'坐标X'},'等于',5],{组=['T商店坐标Y']}]}
{找图 | 白棉花 | 判断=['T',[{'流血'},'等于',0],{赋值=['T',[{'脏东西'},1]]}] | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-白棉花',85]}
{找图 | 已购买 | 赋值=['T',[{'买过了'},1]] | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-已购买',75]}
{找色 | 存在 | 组=['F商店坐标X'] | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 颜色=['#624028','9,37,#422C18',80]}
{组 | '商店坐标X' | 开关={'脏东西'}}
{组 | '商店坐标X' | 开关={'买过了'}}
{组 | '购买饰品'}
{组 | '商店坐标X'}
)

[商店坐标Y]=(
{计算 | [[{'商店范围坐标Y1'},'+',213,{'商店范围坐标Y1'}],[{'商店范围坐标Y2'},'+',213,{'商店范围坐标Y2'}],[{'坐标Y'},'+',1,{'坐标Y'}]]}
{赋值 | [[{'商店范围坐标X1'},473],[{'商店范围坐标X2'},697]]}
{赋值 | [[{'坐标X'},0]]}
{判断 | [[{'坐标Y'},'等于',2],{组=['T商店刷新']}] | 开关={'商店刷新'}}
{组 | '商店坐标X' | 开关={'商店刷新'}}
{判断 | [[{'坐标Y'},'等于',2],{跳至=['T','商店','合成']}]}
{组 | '商店坐标X'}
)


[商店刷新]=(
{找图 | 商店-没钱 | 跳至=['T','商店','合成'] | 范围=[[681,230,1472,663]] | 图片=['商店-没钱',75]}

{判断 | [[{'商店刷新次数'},'小于等于',{'商店已刷新次数'}],{跳至=['T','商店','合成']}]}
{点击 | [1250,150,50] | 延时=300 | 开关={'经费刷新'}}
{点击 | [1420,150,50] | 延时=500 | 开关={'定向刷新'}}
{组 | '定向刷新' | 开关={'定向刷新'}}
{空参 | 确认刷新 | 点击=[980,700,50] | 延时=500 | 开关={'定向刷新'}}
{计算 | [[{'商店已刷新次数'},'+',1,{'商店已刷新次数'}]]}
{赋值 | [[{'坐标X'},0],[{'坐标Y'},0]]}
{移动 | [1200,10,200,2]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}

{按键 | ['F12',50] | 开关={'商店截图'}}

{组 | '商店坐标'}
)

[定向刷新]=(
{组 | {'体系1'}}
{跳出 | 'TF'}
)
[良·技]=(
{找图 | 良·技 | 点击=['T',0,0,50] | 偏移=[20,-100] | 组=['T技能组'] | 赋值=['T',[{'防红玫瑰'},1]] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['良',85]}
{跳至 | ['购买饰品','111']}
)
[购买饰品]=(
{移动 | [949,139,200]}
//{找图|技能观测|点击=['T',0,0,50]|偏移=[20,-100]|组=['T技能观测']|延时=300|范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]]|图片=['技能观测',85]|开关={'技能替换'}}
{找图 | 良技能 | 判断=['T',[{'技能替换'},'等于',1],{组=['T良·技']}] | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['良',85] | 开关={'良秀死全家[地牢]'}}
{找图 | 技能组 | 点击=['T',0,0,50] | 偏移=[20,-100] | 组=['T技能组'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=[{'角色顺位1'},{'角色顺位2'},{'角色顺位3'},{'角色顺位4'},{'角色顺位5'},{'角色顺位6'},{'角色顺位7'},85] | 开关={'技能替换'}}
{空参 | 111}

{判断 | [[{'坐标X'},'等于',3],{跳至=['T','购买饰品','技能组刷新']}]}
{判断 | [[{'饰品购买'},'等于',0],{跳转=['T商店坐标X']}] | 开关={'技能替换'}}
{空参 | 技能组刷新}
{判断 | [[{'饰品购买'},'等于',0],{跳转=['T商店刷新']}] | 开关={'商店刷新'}}

{找图 | 已购买 | 判断=['T',[{'饰品购买'},'等于',0],{跳至=['T','商店','合成']}] | 范围=[[718,247,838,316]] | 图片=['商店-已购买',85]}
{找图 | 没钱 | 跳至=['T','商店','合成'] | 范围=[[681,230,1472,663]] | 图片=['商店-没钱',75]}
//算了吧
//{找图|月之记忆|点击=['T',0,0,50]|延时=300|组=['T购买确认']|范围=[[667,241,1464,642]]|图片=['商店-月之记忆',85]}
//{找图|炎鳞|点击=['T',0,0,50]|延时=300|组=['T购买确认']|范围=[[667,241,1464,642]]|图片=['商店-炎鳞',85]|开关={'烧伤'}}
//{找图|红染棉花|点击=['T',0,0,50]|延时=300|组=['T购买确认']|范围=[[667,241,1464,642]]|图片=['商店-红染棉花',85]|开关={'流血'}}
//{找图|暴雨|点击=['T',0,0,50]|延时=300|组=['T购买确认']|范围=[[667,241,1464,642]]|图片=['商店-暴雨',85]|开关={'震颤'}}
//{找图|快感|点击=['T',0,0,50]|延时=300|组=['T购买确认']|范围=[[667,241,1464,642]]|图片=['商店-快感',85]|开关={'破裂'}}
//{找图|美感|点击=['T',0,0,50]|延时=300|组=['T购买确认']|范围=[[667,241,1464,642]]|图片=['商店-美感',85]|开关={'沉沦'}}
//{找图|明镜止水|点击=['T',0,0,50]|延时=300|组=['T购买确认']|范围=[[667,241,1464,642]]|图片=['商店-明镜止水',85]|开关={'呼吸'}}
//{找图|充能式手套|点击=['T',0,0,50]|延时=300|组=['T购买确认']|范围=[[667,241,1464,642]]|图片=['商店-充能式手套',85]|开关={'充能'}}

//{找图|至高无上的破裂|点击=['T',0,0,50]|延时=300|组=['T购买确认']|范围=[[667,241,1464,642]]|图片=['商店-干巴柴涩鸡胸肉','商店-雷击木','商店-破伞','商店-成捆的符咒',85]|开关={'破裂'}}
//{找图|卡蜜拉/探戈鸡酱料|点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50]|偏移=[100,68]|组=['T购买确认']|延时=300|范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]]|图片=['商店-卡蜜拉','商店-探戈鸡酱料',85]}

{找图 | 三级 | 判断=['T',[{'已合成2'},'等于',1],{跳至=['T','购买饰品','别的']}] | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-三级',80] | 开关={'已合成1'}}
{找图 | 二级 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-二级',80] | 开关={'启用合成'}}
{空参 | 别的}
{判断 | [[{'公式合成'},'等于',0],{跳转=['T商店坐标X']}] | 开关={'仅获取与升级白名单饰品'}}
{找图 | 烧伤 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['烧伤标识-商店',70] | 开关={'烧伤'}}
{找图 | 流血 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['流血标识-商店',70] | 开关={'流血'}}
{找图 | 震颤 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['震颤标识-商店',70] | 开关={'震颤'}}
{找图 | 破裂 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['破裂标识-商店',70] | 开关={'破裂'}}
{找图 | 沉沦 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['沉沦标识-商店',70] | 开关={'沉沦'}}
{找图 | 呼吸 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['呼吸标识-商店',70] | 开关={'呼吸'}}
{找图 | 充能 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['充能标识-商店',70] | 开关={'充能'}}
{跳转 | '商店坐标X' | 开关={'仅获取与升级白名单饰品'}}

{找图 | 斩击 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['斩击标识-商店',70] | 开关={'斩击'}}
{找图 | 刺击 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['刺击标识-商店',70] | 开关={'刺击'}}
{找图 | 打击 | 点击=['T',0,0,50] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['打击标识-商店',70] | 开关={'打击'}}

{判断 | [[{'经济类'},'等于',0],{跳至=['T','购买饰品','经济']}]}
{找图 | 贪婪之锤/生存的里程标 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-贪婪之锤','商店-生存的里程标',85] | 开关={'经济类'}}
{找图 | 金瓮/返利礼券 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-金瓮','商店-返利礼券',85] | 开关={'经济类'}}
{找图 | 新品小册/提前预约优惠券 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-新品小册','商店-提前预约优惠券',85] | 开关={'经济类'}}
{找图 | 翻新的商品/声望卡 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-翻新的商品','商店-声望卡',85] | 开关={'经济类'}}
{空参 | 经济}


{判断 | [[{'回复类'},'等于',0],{跳至=['T','购买饰品','回复']}]}
{找图 | 止痛药/石版字符 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-止痛药','商店-石版字符',85] | 开关={'回复类'}}
{找图 | 采血包/便携式急救包 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-采血包','商店-便携式急救包',85] | 开关={'回复类'}}
{找图 | 归途 | 点击=['T',{'商店范围坐标X1'},{'商店范围坐标Y1'},50] | 偏移=[100,68] | 组=['T购买确认'] | 延时=300 | 范围=[[{'商店范围坐标X1'},{'商店范围坐标Y1'},{'商店范围坐标X2'},{'商店范围坐标Y2'}]] | 图片=['商店-归途',85] | 开关={'回复类'}}
{空参 | 回复}


{跳转 | '商店坐标X'}
)
[购买确认]=(
{延时 | 200}
{找图 | 饰品购入 | 点击=['T',0,0,50] | 跳出='F' | 延时=200 | 范围=[[535,387,1101,710]] | 图片=['饰品购入',75]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 300}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=500 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
//为了适配商店购买后的变化
{计算 | [[{'商店范围坐标X1'},'-',194,{'商店范围坐标X1'}],[{'商店范围坐标X2'},'-',194,{'商店范围坐标X2'}],[{'坐标X'},'-',1,{'坐标X'}]]}
{组 | '商店坐标X'}
)
[-=升级饰品=-]=()

[升级EGO饰品]=(
{点击 | [200,490,50] | 延时=300}
{移动 | [1045,10,200,2]}

{跳至 | ['升级EGO饰品','其他饰品'] | 开关={'初始饰品升级完毕'}}
{空参 | 初始饰品1 | 点击=['TF',849,312,50,'2L'] | 延时=100 | 组=['T升级确认']}
{空参 | 初始饰品2 | 点击=['TF',967,312,50,'2L'] | 延时=100 | 组=['T升级确认'] | 开关={'星恩4'}}
{判断 | [[{'星恩4'},'等于',0],{点击=['T',967,312,50,'2L'] | 组=['T升级确认'] | 延时=100}] | 开关={'星恩10'}}
{判断 | [[{'星恩4'},'等于',1],{点击=['T',1085,312,50,'2L'] | 组=['T升级确认'] | 延时=100}] | 开关={'星恩10'}}
{赋值 | [[{'初始饰品升级完毕'},1]]}
{空参 | 其他饰品}

{判断 | [[{'仅升四级'},'等于',1],{跳至=['T','升级EGO饰品','仅4级']}]}
{判断 | [[{'仅获取与升级白名单饰品'},'等于',0],{跳至=['T','升级EGO饰品','通用']}]}
{跳至 | ['升级EGO饰品',{'体系1'}]}
{空参 | 烧伤}
{找图 | 升级-炎鳞 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-炎鳞',80]}
{找图 | 升级-土归土 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-土归土',80]}
{找图 | 升级-炽热的羽毛 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-炽热的羽毛',80]}
{找图 | 升级-炼狱炎蝶之梦 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-炼狱炎蝶之梦',80]}
{空参 | 名称 | 计次=['T','升级体系',2,{跳至=['T','升级EGO饰品','通用']}]}
{跳至 | ['升级EGO饰品',{'体系2'}]}

{空参 | 流血}
{找图 | 升级-红染棉花 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-红染棉花',80]}
{找图 | 升级-嗜伤甲虫 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-嗜伤甲虫',80]}
{找图 | 升级-烟霾与铁丝网 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-烟霾与铁丝网',80]}
{找图 | 升级-白棉花 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-白棉花',80]}
{空参 | 名称 | 计次=['T','升级体系',2,{跳至=['T','升级EGO饰品','通用']}]}
{跳至 | ['升级EGO饰品',{'体系2'}]}

{空参 | 震颤}
{找图 | 升级-暴雨 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-暴雨',80]}
{找图 | 升级-生物剧毒药瓶 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-生物剧毒药瓶',75]}
{找图 | 升级-真理之钟 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-真理之钟',80]}
{找图 | 升级-残响 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-残响',80]}
{空参 | 名称 | 计次=['T','升级体系',2,{跳至=['T','升级EGO饰品','通用']}]}
{跳至 | ['升级EGO饰品',{'体系2'}]}

{空参 | 破裂}
{找图 | 升级-快感 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-快感',80]}
{找图 | 升级-雷击木 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-雷击木',80]}
{找图 | 升级-破伞 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-破伞',80]}
{找图 | 升级-成捆的符咒 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-成捆的符咒',80]}
{空参 | 名称 | 计次=['T','升级体系',2,{跳至=['T','升级EGO饰品','通用']}]}
{跳至 | ['升级EGO饰品',{'体系2'}]}

{空参 | 沉沦}
{找图 | 升级-美感 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-美感',80]}
{找图 | 升级-破碎罗盘 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-破碎罗盘',80]}
{找图 | 升级-荆棘之路 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-荆棘之路',80]}
{空参 | 名称 | 计次=['T','升级体系',2,{跳至=['T','升级EGO饰品','通用']}]}
{跳至 | ['升级EGO饰品',{'体系2'}]}

{空参 | 呼吸}
{找图 | 升级-明镜止水 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-明镜止水',80]}
{找图 | 升级-内啡肽试剂组 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-内啡肽试剂组',80]}
{找图 | 升级-雾化吸入器 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-雾化吸入器',80]}
{找图 | 升级-绿色鞘翅 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-绿色鞘翅',80]}
{找图 | 升级-追忆吊坠 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-追忆吊坠',80]}
{找图 | 升级-马蹄铁饰物 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-马蹄铁饰物',80]}
{空参 | 名称 | 计次=['T','升级体系',2,{跳至=['T','升级EGO饰品','通用']}]}
{跳至 | ['升级EGO饰品',{'体系2'}]}

{空参 | 充能}
{找图 | 升级-充能式手套 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-充能式手套',80]}
{找图 | 升级-避雷针 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-避雷针',80]}
{找图 | 升级-便携式电源插座 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-便携式电源插座',80]}
{找图 | 升级-护腕 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-护腕',80]}
{找图 | 升级-不间断电源装置 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-不间断电源装置',80]}
{找图 | 升级-简历 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-简历',80]}
{空参 | 名称 | 计次=['T','升级体系',2,{跳至=['T','升级EGO饰品','通用']}]}
{跳至 | ['升级EGO饰品',{'体系2'}]}

{空参 | 斩击}
{找图 | 升级-决意 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-决意',80]}
{空参 | 名称 | 计次=['T','升级体系',2,{跳至=['T','升级EGO饰品','通用']}]}
{跳至 | ['升级EGO饰品',{'体系2'}]}

{空参 | 刺击}
{找图 | 升级-撕裂的弹带 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-撕裂的弹带',80]}
{空参 | 名称 | 计次=['T','升级体系',2,{跳至=['T','升级EGO饰品','通用']}]}
{跳至 | ['升级EGO饰品',{'体系2'}]}

{空参 | 打击}
{找图 | 升级-时间的枷锁 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-时间的枷锁',80]}
{空参 | 名称 | 计次=['T','升级体系',2,{跳至=['T','升级EGO饰品','通用']}]}
{跳至 | ['升级EGO饰品',{'体系2'}]}

{空参 | 通用}
//{找图|升级-卡蜜拉|点击=['T',0,0,50]|延时=150|组=['T升级确认']|范围=[[749,214,1431,672]]|图片=['升级-卡蜜拉','升级-卡蜜拉2',85]}

{跳至 | ['升级EGO饰品','退出'] | 开关={'仅获取与升级白名单饰品'}}

{赋值 | [[{'升级范围坐标X1'},683],[{'升级范围坐标Y1'},272],[{'升级范围坐标X2'},800],[{'升级范围坐标Y2'},384]]}
{组 | '升级坐标X'}


{空参 | 退出}
{重置计次 | '升级体系'}
{赋值 | [[{'坐标X'},0],[{'坐标Y'},0]]}
{点击 | [614,727,50] | 延时=300}
{点击 | [614,727,50] | 延时=300}

{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}

{判断 | [[{'升级合成'},'等于',1],{跳至=['T','商店','退出']}]}
{跳至 | ['商店','购买']}

{空参 | 仅4级}
{找图 | 升级-炎鳞 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-炎鳞',80] | 开关={'烧伤'}}
{找图 | 升级-红染棉花 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-红染棉花',80] | 开关={'流血'}}
{找图 | 升级-暴雨 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-暴雨',80] | 开关={'震颤'}}
{找图 | 升级-快感 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-快感',80] | 开关={'破裂'}}
{找图 | 升级-美感 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-美感',80] | 开关={'沉沦'}}
{找图 | 升级-明镜止水 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-明镜止水',80] | 开关={'呼吸'}}
{找图 | 升级-充能式手套 | 点击=['T',0,0,50,'2L'] | 延时=150 | 组=['T升级确认'] | 范围=[[777,226,1408,657]] | 图片=['升级-充能式手套',80] | 开关={'充能'}}

{跳至 | ['升级EGO饰品','退出']}

)
[升级坐标X]=(
{计算 | [[{'升级范围坐标X1'},'+',117,{'升级范围坐标X1'}],[{'升级范围坐标X2'},'+',117,{'升级范围坐标X2'}],[{'坐标X'},'+',1,{'坐标X'}]]}
{判断 | [[{'坐标X'},'大于',5],{组=['T升级坐标Y']}]}
{判断 | [[{'坐标Y'},'大于',3],{跳至=['T','升级EGO饰品','退出']}]}
{找图 | 已升级 | 组=['T升级坐标X'] | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['饰品++',65]}
{组 | '升级检测'}
{组 | '升级坐标X'}
)
[升级坐标Y]=(
{计算 | [[{'升级范围坐标Y1'},'+',112,{'升级范围坐标Y1'}],[{'升级范围坐标Y2'},'+',112,{'升级范围坐标Y2'}],[{'坐标Y'},'+',1,{'坐标Y'}]]}
{赋值 | [[{'升级范围坐标X1'},800],[{'升级范围坐标X2'},910],[{'坐标X'},0]]}
{判断 | [[{'坐标Y'},'大于',3],{跳至=['T','升级EGO饰品','退出']}]}
{组 | '升级检测'}
{组 | '升级坐标X'}
)
[升级确认]=(
{延时 | 50}
{按键 | ['ENTER',50]}
{延时 | 300}
{找图 | 强化不可 | 跳出='T' | 范围=[[1142,20,1526,177]] | 图片=['强化不可',80]}
{找图 | 没钱 | 跳至=['T','升级EGO饰品','退出'] | 范围=[[164,564,446,714]] | 图片=['没钱',90]}
{点击 | [1289,641,15] | 延时=50}

{按键 | ['ENTER',50]}
{延时 | 100}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 200}


{跳出 | 'TF'}
)
[升级检测]=(
{找图 | 饰品升级-烧伤 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级确认'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['饰品升级-烧伤','饰品升级-烧伤2',85] | 开关={'烧伤'}}
{找图 | 饰品升级-流血 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级确认'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['饰品升级-流血','饰品升级-流血2',85] | 开关={'流血'}}
{找图 | 饰品升级-震颤 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级确认'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['饰品升级-震颤','饰品升级-震颤2',85] | 开关={'震颤'}}
{找图 | 饰品升级-破裂 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级确认'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['饰品升级-破裂','饰品升级-破裂2',85] | 开关={'破裂'}}
{找图 | 饰品升级-沉沦 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级确认'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['饰品升级-沉沦','饰品升级-沉沦2',85] | 开关={'沉沦'}}
{找图 | 饰品升级-呼吸 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级确认'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['饰品升级-呼吸','饰品升级-呼吸2',85] | 开关={'呼吸'}}
{找图 | 饰品升级-充能 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级确认'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['饰品升级-充能','饰品升级-充能2',85] | 开关={'充能'}}
{找图 | 饰品升级-斩击 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级确认'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['饰品升级-斩击','饰品升级-斩击2',85] | 开关={'斩击'}}
{找图 | 饰品升级-刺击 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级确认'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['饰品升级-刺击','饰品升级-刺击2',85] | 开关={'刺击'}}
{找图 | 饰品升级-打击 | 点击=['T',0,0,50] | 偏移=[-40,-40] | 组=['T升级确认'] | 延时=250 | 范围=[[{'升级范围坐标X1'},{'升级范围坐标Y1'},{'升级范围坐标X2'},{'升级范围坐标Y2'}]] | 图片=['饰品升级-打击','饰品升级-打击2',85] | 开关={'打击'}}
{跳出 | 'TF'}
)

[-=合成饰品=-]=()
[合成纠错]=(

{判断 | [[{'已合成1'},'等于',1],{跳至=['T','合成纠错','第二位']}]}
{找图 | 烧伤合成 | 赋值=['T',[{'已合成1'},1],[{'烧伤合成1'},0],[{'升级合成'},1]] | 跳至=['T','合成纠错','第二位'] | 跳转=['F合成准备'] | 范围=[[785,264,1393,622]] | 图片=['合成-炎鳞',75] | 开关={'烧伤合成1'}}
{找图 | 流血合成 | 赋值=['T',[{'已合成1'},1],[{'流血合成1'},0],[{'升级合成'},1]] | 跳至=['T','合成纠错','第二位'] | 跳转=['F合成准备'] | 范围=[[785,264,1393,622]] | 图片=['合成-红染棉花',75] | 开关={'流血合成1'}}
{找图 | 震颤合成 | 赋值=['T',[{'已合成1'},1],[{'震颤合成1'},0],[{'升级合成'},1]] | 跳至=['T','合成纠错','第二位'] | 跳转=['F合成准备'] | 范围=[[785,264,1393,622]] | 图片=['合成-暴雨',75] | 开关={'震颤合成1'}}
{找图 | 破裂合成 | 赋值=['T',[{'已合成1'},1],[{'破裂合成1'},0],[{'升级合成'},1]] | 跳至=['T','合成纠错','第二位'] | 跳转=['F合成准备'] | 范围=[[785,264,1393,622]] | 图片=['合成-快感',75] | 开关={'破裂合成1'}}
{找图 | 沉沦合成 | 赋值=['T',[{'已合成1'},1],[{'沉沦合成1'},0],[{'升级合成'},1]] | 跳至=['T','合成纠错','第二位'] | 跳转=['F合成准备'] | 范围=[[785,264,1393,622]] | 图片=['合成-美感',75] | 开关={'沉沦合成1'}}
{找图 | 呼吸合成 | 赋值=['T',[{'已合成1'},1],[{'呼吸合成1'},0],[{'升级合成'},1]] | 跳至=['T','合成纠错','第二位'] | 跳转=['F合成准备'] | 范围=[[785,264,1393,622]] | 图片=['合成-明镜止水',75] | 开关={'呼吸合成1'}}
{找图 | 充能合成 | 赋值=['T',[{'已合成1'},1],[{'充能合成1'},0],[{'升级合成'},1]] | 跳至=['T','合成纠错','第二位'] | 跳转=['F合成准备'] | 范围=[[785,264,1393,622]] | 图片=['合成-充能式手套',75] | 开关={'充能合成1'}}
{找图 | 斩击合成 | 赋值=['T',[{'已合成1'},1],[{'斩击合成1'},0]] | 跳至=['T','合成纠错','第二位'] | 跳转=['F合成准备'] | 范围=[[785,264,1393,622]] | 图片=['合成-切开的记忆',75] | 开关={'斩击合成1'}}
{找图 | 刺击合成 | 赋值=['T',[{'已合成1'},1],[{'刺击合成1'},0]] | 跳至=['T','合成纠错','第二位'] | 跳转=['F合成准备'] | 范围=[[785,264,1393,622]] | 图片=['合成-洞穿的记忆',75] | 开关={'刺击合成1'}}
{找图 | 打击合成 | 赋值=['T',[{'已合成1'},1],[{'打击合成1'},0]] | 跳至=['T','合成纠错','第二位'] | 跳转=['F合成准备'] | 范围=[[785,264,1393,622]] | 图片=['合成-粉碎的记忆',75] | 开关={'打击合成1'}}
{赋值 | [[{'已合成1'},1]]}

{空参 | 第二位}
{判断 | [[{'已合成2'},'等于',1],{跳至=['T','合成纠错','继续']}]}
{找图 | 烧伤合成 | 赋值=['T',[{'已合成2'},1],[{'烧伤合成2'},0],[{'升级合成'},1]] | 跳至=['F','合成EGO饰品','第二位'] | 范围=[[785,264,1393,622]] | 图片=['合成-炎鳞',75] | 开关={'烧伤合成2'}}
{找图 | 流血合成 | 赋值=['T',[{'已合成2'},1],[{'流血合成2'},0],[{'升级合成'},1]] | 跳至=['F','合成EGO饰品','第二位'] | 范围=[[785,264,1393,622]] | 图片=['合成-红染棉花',75] | 开关={'流血合成2'}}
{找图 | 震颤合成 | 赋值=['T',[{'已合成2'},1],[{'震颤合成2'},0],[{'升级合成'},1]] | 跳至=['F','合成EGO饰品','第二位'] | 范围=[[785,264,1393,622]] | 图片=['合成-暴雨',75] | 开关={'震颤合成2'}}
{找图 | 破裂合成 | 赋值=['T',[{'已合成2'},1],[{'破裂合成2'},0],[{'升级合成'},1]] | 跳至=['F','合成EGO饰品','第二位'] | 范围=[[785,264,1393,622]] | 图片=['合成-快感',75] | 开关={'破裂合成2'}}
{找图 | 沉沦合成 | 赋值=['T',[{'已合成2'},1],[{'沉沦合成2'},0],[{'升级合成'},1]] | 跳至=['F','合成EGO饰品','第二位'] | 范围=[[785,264,1393,622]] | 图片=['合成-美感',75] | 开关={'沉沦合成2'}}
{找图 | 呼吸合成 | 赋值=['T',[{'已合成2'},1],[{'呼吸合成2'},0],[{'升级合成'},1]] | 跳至=['F','合成EGO饰品','第二位'] | 范围=[[785,264,1393,622]] | 图片=['合成-明镜止水',75] | 开关={'呼吸合成2'}}
{找图 | 充能合成 | 赋值=['T',[{'已合成2'},1],[{'充能合成2'},0],[{'升级合成'},1]] | 跳至=['F','合成EGO饰品','第二位'] | 范围=[[785,264,1393,622]] | 图片=['合成-充能式手套',75] | 开关={'充能合成2'}}
{找图 | 斩击合成 | 赋值=['T',[{'已合成2'},1],[{'斩击合成2'},0]] | 跳至=['F','合成EGO饰品','第二位'] | 范围=[[785,264,1393,622]] | 图片=['合成-切开的记忆',75] | 开关={'斩击合成2'}}
{找图 | 刺击合成 | 赋值=['T',[{'已合成2'},1],[{'刺击合成2'},0]] | 跳至=['F','合成EGO饰品','第二位'] | 范围=[[785,264,1393,622]] | 图片=['合成-洞穿的记忆',75] | 开关={'刺击合成2'}}
{找图 | 打击合成 | 赋值=['T',[{'已合成2'},1],[{'打击合成2'},0]] | 跳至=['F','合成EGO饰品','第二位'] | 范围=[[785,264,1393,622]] | 图片=['合成-粉碎的记忆',75] | 开关={'打击合成2'}}
{赋值 | [[{'已合成2'},1]]}
{空参 | 继续}
{跳至 | ['确认合成','继续'] | 开关={'返回确认'}}
{跳至 | ['合成EGO饰品','合三级']}
)
[合成EGO饰品]=(
{判断 | [[{'饰品合成'},'等于',0],{跳出='T'}]}
{点击 | [350,490,50] | 延时=100}
{找图 | 合成 | 循环=['F',5,100] | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}

{赋值 | [[{'三级合成1'},0],[{'三级数量'},0],[{'未合完'},1],[{'返回确认'},0]]}
{空参 | 赋值}
{赋值 | [[{'公式合成'},1]] | 开关={'公式合成'}}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}

{空参 | 第一位}
{判断 | [[{'已合成1'},'等于',1],{跳至=['T','合成EGO饰品','第二位']}]}
{组 | {'合成体系1'}}
{判断 | [[{'已合成2'},'等于',0],{组=['T合成纠错']}]}

{空参 | 第二位}
{判断 | [[{'已合成2'},'等于',1],{跳至=['T','合成EGO饰品','合三级']}]}
{组 | {'合成体系2'}}

{空参 | 合三级}
{赋值 | [[{'三级合成1'},1],[{'三级数量'},0]] | 开关={'三级合成'}}
{组 | {'合成体系1'} | 开关={'三级合成1'}}

{空参 | 退出}
{点击 | [614,727,50] | 延时=300}
{点击 | [614,727,50] | 延时=300}
{赋值 | [[{'回炉合成'},0],[{'三级合成1'},0]]}
{赋值 | [[{'坐标X'},0],[{'坐标Y'},0]]}
{判断 | [[{'升级合成'},'等于',1],{跳至=['T','商店','升级']}] | 开关={'饰品升级'}}
{跳至 | ['商店','退出']}
)
[合成准备]=(
{找图 | 公式启用 | 跳至=['T','合成准备','合成赋值'] | 范围=[[769,233,931,339]] | 图片=['公式合成',85] | 开关={'公式合成'}}
{空参 | 非公式对齐}
//归位
{找图 | 对齐 | 点击=['F',1406,279,200] | 范围=[[754,234,1024,339]] | 图片=['对齐',85]}
{找图 | 对齐 | 点击=['T',0,0,50,'L',1] | 跳至=['F','合成准备','1'] | 范围=[[772,414,1036,493]] | 图片=['对齐',85]}
{移动 | [816,281,8]}
{点击 | [816,281,400,'L',2]}
{空参 | 1}
{赋值 | [[{'对齐Y'},288]]}
{找图 | 对齐 | 赋值=['T',[{'对齐Y'},{'y'}]] | 范围=[[754,234,1024,339]] | 图片=['对齐',85]}
{计算 | [[{'对齐Y'},'+',17,{'合成Y1'}],[{'对齐Y'},'+',133,{'合成Y2'}]]}
{赋值 | [[{'合成X1'},771],[{'合成X2'},906],[{'坐标X'},0],[{'坐标Y'},0]]}
{赋值 | [[{'素材1'},1],[{'素材2'},1],[{'素材3'},1],[{'素材4'},0],[{'合成失败'},1],[{'素材数量'},0],[{'回炉合成'},0]]}
{赋值 | [[{'未合完'},0]] | 开关={'已合成2'}}
{判断 | [[{'未合完'},'等于',0],{赋值=['T',[{'三级合成1'},1]]}]}
{跳转 | '三级合成' | 开关={'三级合成1'}}
{跳转 | '开始合成'}

{空参 | 合成赋值}
{赋值 | [[{'合成X1'},771],[{'合成X2'},906]]}
{找图 | 公式全完 | 跳至=['F','合成准备','非公式对齐'] | 范围=[[769,233,931,339]] | 图片=['公式合成',85]}
{空参 | 公式合成}
{找图 | 无法合成 | 跳至=['T','合成准备','就绪'] | 范围=[[{'合成X1'},305,{'合成X2'},421]] | 图片=['无法合成',80]}
{找图 | 烧伤合成 | 点击=['T',0,0,50] | 跳至=['T','合成准备','就绪'] | 范围=[[{'合成X1'},305,{'合成X2'},421]] | 图片=['饰品升级-烧伤',70] | 开关={'烧伤'}}
{找图 | 流血合成 | 点击=['T',0,0,50] | 跳至=['T','合成准备','就绪'] | 范围=[[{'合成X1'},305,{'合成X2'},421]] | 图片=['饰品升级-流血',70] | 开关={'流血'}}
{找图 | 震颤合成 | 点击=['T',0,0,50] | 跳至=['T','合成准备','就绪'] | 范围=[[{'合成X1'},305,{'合成X2'},421]] | 图片=['饰品升级-震颤',70] | 开关={'震颤'}}
{找图 | 破裂合成 | 点击=['T',0,0,50] | 跳至=['T','合成准备','就绪'] | 范围=[[{'合成X1'},305,{'合成X2'},421]] | 图片=['饰品升级-破裂',70] | 开关={'破裂'}}
{找图 | 沉沦合成 | 点击=['T',0,0,50] | 跳至=['T','合成准备','就绪'] | 范围=[[{'合成X1'},305,{'合成X2'},421]] | 图片=['饰品升级-沉沦',70] | 开关={'沉沦'}}
{找图 | 呼吸合成 | 点击=['T',0,0,50] | 跳至=['T','合成准备','就绪'] | 范围=[[{'合成X1'},305,{'合成X2'},421]] | 图片=['饰品升级-呼吸',70] | 开关={'呼吸'}}
{找图 | 充能合成 | 点击=['T',0,0,50] | 跳至=['T','合成准备','就绪'] | 范围=[[{'合成X1'},305,{'合成X2'},421]] | 图片=['饰品升级-充能',70] | 开关={'充能'}}
{找图 | 斩击合成 | 点击=['T',0,0,50] | 跳至=['T','合成准备','就绪'] | 范围=[[{'合成X1'},305,{'合成X2'},421]] | 图片=['饰品升级-斩击',70] | 开关={'斩击'}}
{找图 | 刺击合成 | 点击=['T',0,0,50] | 跳至=['T','合成准备','就绪'] | 范围=[[{'合成X1'},305,{'合成X2'},421]] | 图片=['饰品升级-突刺',70] | 开关={'刺击'}}
{找图 | 打击合成 | 点击=['T',0,0,50] | 跳至=['T','合成准备','就绪'] | 范围=[[{'合成X1'},305,{'合成X2'},421]] | 图片=['饰品升级-打击',70] | 开关={'打击'}}
{空参 | 就绪}
{延时 | 50}
{计算 | [[{'合成X1'},'+',120,{'合成X1'}]]}
{计算 | [[{'合成X2'},'+',120,{'合成X2'}]]}
{判断 | [[{'合成X1'},'大于',1275],{跳至=['T','合成准备','非公式对齐']}]}

{找图 | 可合成 | 跳至=['F','合成准备','公式合成'] | 范围=[[490,540,630,627]] | 图片=['可合成',80]}
{点击 | [1004,729,50] | 延时=500}
{点击 | [1004,729,50] | 延时=200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{点击 | [902,663,50] | 延时=500}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 循环=['T',3,500] | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{跳至 | ['合成准备','合成赋值']}


)
[开始合成]=(
{组 | '合成检查'}
{找图 | 黑名单 | 赋值=['T',[{'回炉合成'},1]] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['回炉-骄傲残片','回炉-摩擦残片','回炉-蚕食残片','回炉-惰性残片','回炉-欲望残片','回炉-魅惑残片','回炉-业火残片','合成-四级饰品',85]}
{组 | '回炉合成' | 开关={'回炉合成'}}
{找图 | 素材1 | 计算=['T',[{'素材数量'},'+',1,{'素材数量'}]] | 赋值=['T',[{'素材1'},0],[{'合成点击X1'},{'合成X2'}],[{'合成点击Y1'},{'合成Y2'}]] | 跳至=['T','开始合成','检查'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-三级饰品',85] | 开关={'素材1'}}
{找图 | 素材2 | 计算=['T',[{'素材数量'},'+',1,{'素材数量'}]] | 赋值=['T',[{'素材2'},0],[{'合成点击X2'},{'合成X2'}],[{'合成点击Y2'},{'合成Y2'}]] | 跳至=['T','开始合成','检查'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-三级饰品',85] | 开关={'素材2'}}
{找图 | 素材3 | 计算=['T',[{'素材数量'},'+',1,{'素材数量'}]] | 赋值=['T',[{'素材3'},0],[{'合成点击X3'},{'合成X2'}],[{'合成点击Y3'},{'合成Y2'}]] | 跳至=['T','开始合成','检查'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-二级饰品',85] | 开关={'素材3'}}
{找图 | 素材4 | 赋值=['T',[{'素材4'},1],[{'合成点击X3'},{'合成X2'}],[{'合成点击Y3'},{'合成Y2'}]] | 跳至=['T','开始合成','检查'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-三级饰品',85] | 开关={'素材3'}}
{空参 | 检查}
{空参 | 找到 | 判断=['F',[{'素材数量'},'等于',3],{组=['T合成坐标X']}]}
{空参 | 找到 | 判断=['T',[{'素材数量'},'等于',3],{组=['T确认合成'] | 赋值=['T',[{'合成失败'},0]]}]}
{组 | '合成坐标X'}
)
[回炉合成]=(
{组 | '合成检查'}
{找图 | 素材1 | 计算=['T',[{'素材数量'},'+',1,{'素材数量'}]] | 赋值=['T',[{'素材1'},0],[{'合成点击X1'},{'合成X2'}],[{'合成点击Y1'},{'合成Y2'}]] | 跳至=['T','回炉合成','检查'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-四级饰品',85] | 开关={'素材1'}}
{找图 | 素材2 | 计算=['T',[{'素材数量'},'+',1,{'素材数量'}]] | 赋值=['T',[{'素材2'},0],[{'合成点击X2'},{'合成X2'}],[{'合成点击Y2'},{'合成Y2'}]] | 跳至=['T','回炉合成','检查'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-二级饰品',85] | 开关={'素材2'}}
{找图 | 素材3 | 计算=['T',[{'素材数量'},'+',1,{'素材数量'}]] | 赋值=['T',[{'素材3'},0],[{'合成点击X3'},{'合成X2'}],[{'合成点击Y3'},{'合成Y2'}]] | 跳至=['T','回炉合成','检查'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-二级饰品',85] | 开关={'素材3'}}
{找图 | 素材4 | 赋值=['T',[{'素材4'},1],[{'合成点击X3'},{'合成X2'}],[{'合成点击Y3'},{'合成Y2'}]] | 跳至=['T','回炉合成','检查'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-三级饰品',85] | 开关={'素材3'}}
{空参 | 检查}
{空参 | 找到 | 判断=['F',[{'素材数量'},'等于',3],{组=['T合成坐标X']}]}
{空参 | 找到 | 判断=['T',[{'素材数量'},'等于',3],{组=['T确认合成'] | 赋值=['T',[{'合成失败'},0]]}]}
{组 | '合成坐标X'}
)
[三级合成]=(
{组 | '合成检查'}
{找图 | 确认 | 计算=['T',[{'三级数量'},'+',1,{'三级数量'}]] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-三级饰品',85]}
{赋值 | [[{'未合完'},0]] | 开关={'已合成2'}}
{判断 | [[{'三级数量'},'大于',1],{赋值=['T',[{'三级合成1'},0]] | 跳至=['T','合成EGO饰品','第一位']}] | 开关={'未合完'}}
{找图 | 素材1 | 计算=['T',[{'素材数量'},'+',1,{'素材数量'}]] | 赋值=['T',[{'素材1'},0],[{'合成点击X1'},{'合成X2'}],[{'合成点击Y1'},{'合成Y2'}]] | 跳至=['T','三级合成','检查'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-二级饰品',85] | 开关={'素材1'}}
{找图 | 素材2 | 计算=['T',[{'素材数量'},'+',1,{'素材数量'}]] | 赋值=['T',[{'素材2'},0],[{'合成点击X2'},{'合成X2'}],[{'合成点击Y2'},{'合成Y2'}]] | 跳至=['T','三级合成','检查'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-二级饰品',85] | 开关={'素材2'}}
{找图 | 素材3 | 计算=['T',[{'素材数量'},'+',1,{'素材数量'}]] | 赋值=['T',[{'素材3'},0],[{'合成点击X3'},{'合成X2'}],[{'合成点击Y3'},{'合成Y2'}]] | 跳至=['T','三级合成','检查'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-二级饰品',85] | 开关={'素材3'}}
{空参 | 检查}
{空参 | 找到 | 判断=['F',[{'素材数量'},'等于',3],{组=['T合成坐标X']}]}
{空参 | 找到 | 判断=['T',[{'素材数量'},'等于',3],{组=['T确认合成'] | 赋值=['T',[{'合成失败'},0]]}]}
{组 | '合成坐标X'}
)
[合成坐标X]=(
{计算 | [[{'合成X1'},'+',120,{'合成X1'}]]}
{计算 | [[{'合成X2'},'+',120,{'合成X2'}]]}
{计算 | [[{'坐标X'},'+',1,{'坐标X'}]]}
{判断 | [[{'坐标X'},'大于等于',5],{组=['T合成坐标Y']}]}
{判断 | [[{'坐标Y'},'大于',2],{跳至=['T','合成坐标Y','XXX']}]}
{组 | '三级合成' | 开关={'三级合成1'}}
{组 | '回炉合成' | 开关={'回炉合成'}}
{组 | '开始合成'}
)
[合成坐标Y]=(

{空参 | 计算}
{计算 | [[{'合成Y1'},'+',114,{'合成Y1'}]]}
{计算 | [[{'合成Y2'},'+',114,{'合成Y2'}]]}
{赋值 | [[{'合成X1'},771],[{'合成X2'},906]]}

{计算 | [[{'坐标Y'},'+',1,{'坐标Y'}]]}
{空参 | XXX}
{赋值 | [[{'坐标X'},0]]}
{赋值 | [[{'回炉确认'},0]]}
{赋值 | [[{'三级确认'},0]]}
{判断 | [[{'素材2'},'等于',0],{赋值=['T',[{'回炉确认'},1]]}] | 开关={'素材4'}}

{空参 | 哈基1}
{跳至 | ['合成坐标Y','哈基2'] | 开关={'三级合成'}}
{判断 | [[{'坐标Y'},'大于',2],{组=['T确认合成']}] | 开关={'回炉确认'}}
{判断 | [[{'坐标Y'},'大于',2],{跳至=['T','合成EGO饰品','退出']}] | 开关={'合成失败'}}

{空参 | 哈基2}
{跳至 | ['合成坐标Y','哈基3'] | 开关={'三级合成1'}}
{跳至 | ['合成坐标Y','哈基3'] | 开关={'回炉合成'}}
{判断 | [[{'坐标Y'},'大于',2],{赋值=['T',[{'三级确认'},1]]}] | 开关={'合成失败'}}
{判断 | [[{'素材3'},'等于',0],{赋值=['T',[{'坐标X'},0],[{'坐标Y'},0]] | 跳至=['T','合成EGO饰品','合三级']}] | 开关={'三级确认'}}

{空参 | 哈基3}
{判断 | [[{'坐标Y'},'大于',2],{组=['T确认合成']}] | 开关={'回炉确认'}}
{判断 | [[{'坐标Y'},'大于',2],{跳至=['T','合成EGO饰品','退出']}]}

{判断 | [[{'素材3'},'等于',0],{组=['T三级合成']}] | 开关={'三级合成1'}}
{组 | '开始合成'}
)
[确认合成]=(

{点击 | [{'合成点击X1'},{'合成点击Y1'},50] | 偏移=[-44,-66] | 延时=100}
{点击 | [{'合成点击X2'},{'合成点击Y2'},50] | 偏移=[-44,-66] | 延时=100}
{点击 | [{'合成点击X3'},{'合成点击Y3'},50] | 偏移=[-44,-66] | 延时=100}
{跳至 | ['确认合成','确认'] | 开关={'三级合成1'}}
{找图 | 星光合成 | 点击=['T',342,626,50] | 范围=[[304,592,378,675]] | 延时=200 | 图片=['星光合成',85] | 开关={'星光合成'}}
{找图 | 星光确认 | 点击=['T',0,0,50] | 范围=[[799,519,1062,641]] | 延时=200 | 图片=['确认3','确认2','确认1',85] | 开关={'星光合成'}}

{空参 | 确认}
{点击 | [1004,729,50] | 延时=500}
{点击 | [1004,729,50] | 延时=200}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{点击 | [902,663,50] | 延时=500}
{找图 | 确认1 | 点击=['T',0,0,50] | 偏移=[25,0] | 循环=['T',3,500] | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{判断 | [[{'三级数量'},'大于',1],{赋值=['T',[{'三级合成1'},0]] | 跳至=['F','合成准备','1']}] | 开关={'三级合成1'}}
{赋值 | [[{'返回确认'},1]]}
{跳转 | '合成纠错'}

{空参 | 继续}
{赋值 | [[{'三级合成1'},1]] | 开关={'三级合成'}}
{组 | {'合成体系1'} | 开关={'三级合成1'}}
{跳至 | ['合成EGO饰品','退出']}
)
[合成检查]=(
{判断 | [[{'坐标Y'},'大于等于',1],{跳至=['F','合成检查','开始']}]}
{找图 | 2 | 跳转=['F合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-素材饰品',85]}

{空参 | 开始}

{找图 | 观测1 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=[{'观测白名1'},70] | 开关={'观测启用1'}}
{找图 | 观测2 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=[{'观测白名2'},70] | 开关={'观测启用2'}}
{找图 | 观测3 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=[{'观测白名3'},70] | 开关={'观测启用3'}}

{找图 | 烧伤白名单 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-火热多汁琵琶腿','合成-土归土','合成-炽热的羽毛','合成-炼狱炎蝶之梦',75] | 开关={'烧伤'}}
{找图 | 流血白名单 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-烟霾与铁丝网','合成-嗜伤甲虫','合成-白棉花','合成-又小又可能很坏的玩偶',75] | 开关={'流血'}}
{找图 | 震颤白名单 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-生物剧毒药瓶','合成-真理之钟','合成-残响',75] | 开关={'震颤'}}
{找图 | 破裂白名单 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-干巴柴涩鸡胸肉','合成-雷击木','合成-雷击木2','合成-破伞',75] | 开关={'破裂'}}
{找图 | 沉沦白名单 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-仲冬夜之噩梦','合成-破碎罗盘','合成-彼方之星','合成-遗骸碎片',75] | 开关={'沉沦'}}
{找图 | 呼吸白名单 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-内啡肽试剂组','合成-雾化吸入器','合成-烟斗',75] | 开关={'呼吸'}}
{找图 | 充能白名单 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-避雷针','合成-便携式电源插座','合成-夜视仪',75] | 开关={'充能'}}
{找图 | 斩击白名单 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-决意',75] | 开关={'斩击'}}
{找图 | 刺击白名单 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-撕裂的弹带',75] | 开关={'刺击'}}
{找图 | 打击白名单 | 判断=['T',[{'合成避开白名单饰品'},'等于',1],{组=['T合成坐标X']}] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-时间的枷锁',75] | 开关={'打击'}}

{找图 | 烧伤合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-炎鳞',75] | 开关={'烧伤'}}
{找图 | 流血合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-红染棉花',75] | 开关={'流血'}}
{找图 | 震颤合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-暴雨',75] | 开关={'震颤'}}
{找图 | 破裂合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-快感',75] | 开关={'破裂'}}
{找图 | 沉沦合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-美感',75] | 开关={'沉沦'}}
{找图 | 呼吸合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-明镜止水',75] | 开关={'呼吸'}}
{找图 | 充能合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-充能式手套',75] | 开关={'充能'}}
{找图 | 斩击合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-切开的记忆',75] | 开关={'斩击'}}
{找图 | 刺击合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-洞穿的记忆',75] | 开关={'刺击'}}
{找图 | 打击合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-粉碎的记忆',75] | 开关={'打击'}}

{空参 | 继续}
{组 | '避开公式' | 开关={'公式合成'}}
{组 | '避开同系' | 开关={'避开同系'}}

{跳出 | 'TF'}
)
[避开公式]=(
{找图 | 烧伤公式 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-土归土','合成-烧伤公式1','合成-烧伤公式2','合成-烧伤公式3','合成-烧伤素材1','合成-烧伤素材2','合成-烧伤素材3',75] | 开关={'烧伤'}}
{找图 | 流血公式 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-烟霾与铁丝网','合成-流血公式1','合成-流血公式2','合成-流血公式3','合成-流血素材1','合成-流血素材2','合成-流血素材3',75] | 开关={'流血'}}
{找图 | 震颤公式 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-真理之钟','合成-震颤公式1','合成-震颤公式2','合成-震颤公式3','合成-震颤素材1','合成-震颤素材2','合成-震颤素材3',75] | 开关={'震颤'}}
{找图 | 破裂公式 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-雷击木','合成-雷击木2','合成-破裂公式1','合成-破裂公式2','合成-破裂公式3','合成-破裂素材1','合成-破裂素材2','合成-破裂素材3',75] | 开关={'破裂'}}
{找图 | 沉沦公式 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-仲冬夜之噩梦','合成-彼方之星','合成-沉沦公式1','合成-沉沦公式2','合成-沉沦公式3','合成-沉沦素材1','合成-沉沦素材2',75] | 开关={'沉沦'}}
{找图 | 呼吸公式 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-内啡肽试剂组','合成-呼吸公式1','合成-呼吸公式2','合成-呼吸公式3','合成-呼吸素材1','合成-呼吸素材2','合成-呼吸素材3',75] | 开关={'呼吸'}}
{找图 | 充能公式 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['合成-避雷针','合成-充能公式1','合成-充能公式2','合成-充能公式3','合成-充能素材1','合成-充能素材2','合成-充能素材3',75] | 开关={'充能'}}

{跳出 | 'TF'}
)
[避开同系]=(

{找图 | 黑名单 | 跳出='T' | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['回炉-傲慢残片','回炉-摩擦残片','回炉-蚕食残片','回炉-惰性残片','回炉-欲望残片','回炉-魅惑残片','回炉-业火残片','合成-四级饰品',85]}
{找图 | ++ | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['饰品++','饰品+',80]}
{找图 | 烧伤合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['饰品升级-烧伤','饰品升级-烧伤2',70] | 开关={'烧伤'}}
{找图 | 流血合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['饰品升级-流血','饰品升级-流血2',70] | 开关={'流血'}}
{找图 | 震颤合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['饰品升级-震颤','饰品升级-震颤2',70] | 开关={'震颤'}}
{找图 | 破裂合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['饰品升级-破裂','饰品升级-破裂2',70] | 开关={'破裂'}}
{找图 | 沉沦合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['饰品升级-沉沦','饰品升级-沉沦2',70] | 开关={'沉沦'}}
{找图 | 呼吸合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['饰品升级-呼吸','饰品升级-呼吸2',70] | 开关={'呼吸'}}
{找图 | 充能合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['饰品升级-充能','饰品升级-充能2',70] | 开关={'充能'}}
{找图 | 斩击合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['饰品升级-斩击','饰品升级-斩击2',70] | 开关={'斩击'}}
{找图 | 刺击合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['饰品升级-突刺','饰品升级-突刺2',70] | 开关={'刺击'}}
{找图 | 打击合成 | 组=['T合成坐标X'] | 范围=[[{'合成X1'},{'合成Y1'},{'合成X2'},{'合成Y2'}]] | 图片=['饰品升级-打击','饰品升级-打击2',70] | 开关={'打击'}}
{跳出 | 'TF'}

)
[-=-=地牢事件处理=-=-]=()
[事件离去]=(
{判断 | [[{'良秀死全家[纺锤]'},'等于',1],{跳转=['T良秀全家活暗暗-纺锤']}] | 开关={'纺锤'}}
{跳转 | '纺锤战斗' | 开关={'纺锤'}}
{跳转 | '房间检索'}
)

[事件]=(

{延时 | 100}
{空参 | 第一次}
{找图 | 问号 | 组=['F事件离去'] | 范围=[[361,59,512,181]] | 图片=['事件',85]}
{点击 | [1419,807,50] | 延时=50}
{点击 | [1419,807,50] | 延时=50}
{点击 | [1560,713,50] | 延时=50}
{点击 | [1560,713,50] | 延时=50}
{点击 | [1560,713,50] | 延时=400}
{找图 | 判定 | 延时=800 | 范围=[[1069,46,1302,184]] | 图片=['判定',85] | 开关={'战斗中'}}
{赋值 | [[{'战斗中'},0]] | 开关={'战斗中'}}
{找图 | 判定 | 组=['T判定'] | 范围=[[1069,46,1302,184]] | 图片=['判定',85]}
{组 | '特殊异想体事件'}
{空参 | 按钮}
{点击 | [1390,267,20] | 延时=10}
{点击 | [1390,390,20] | 延时=10}
{点击 | [1390,460,20] | 延时=10}

{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 300}

{找色 | 继续 | 点击=['T',1506,826,50] | 延时=500 | 范围=[[1144,604,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}

{找图 | 问号 | 组=['F事件离去'] | 范围=[[361,59,512,181]] | 图片=['事件',85]}
//进行判定
{点击 | [1419,807,50] | 延时=50}
{点击 | [1419,807,50] | 延时=50}
{点击 | [1560,713,50] | 延时=50}
{点击 | [1560,713,50] | 延时=50}
{点击 | [1560,713,50] | 延时=400}
{找色 | 继续 | 点击=['T',1506,826,50] | 延时=500 | 范围=[[1144,604,1597,897]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 判定 | 组=['T判定'] | 跳至=['F','事件','第一次'] | 范围=[[1069,46,1302,184]] | 图片=['判定',85]}
)

[判定]=(
//判定
{赋值 | [[{'反转'},0]]}
{找图 | 非常高 | 点击=['T',0,0,50] | 赋值=['F',[{'反转'},1]] | 偏移=[0,50] | 延时=500 | 范围=[[49,737,1098,807]] | 图片=['非常高','高','一般','低',75]}
{找图 | 事件-员工证 | 赋值=['T',[{'反转'},1]] | 范围=[[263,169,542,372]] | 图片=['事件-员工证',85]}
{找图 | 非常低 | 点击=['T',0,0,50] | 偏移=[0,50] | 延时=500 | 范围=[[49,737,1098,807]] | 图片=['非常低','低','一般','高','非常高',75] | 开关={'反转'}}


{找色 | 继续 | 点击=['T',1506,826,50] | 延时=200 | 范围=[[1144,604,1577,867]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}


{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{找图 | 判定 | 循环=['F',43,100] | 范围=[[1034,541,1290,678]] | 图片=['判定结束1','判定结束2',85]}
//skip
{点击 | [1419,807,50] | 延时=50}
{点击 | [1419,807,50] | 延时=50}
{点击 | [1560,713,50] | 延时=50}
{点击 | [1560,713,50] | 延时=50}
{点击 | [1560,713,50] | 延时=400}

{找色 | 继续 | 点击=['T',1506,826,50] | 延时=200 | 范围=[[1144,604,1577,867]] | 颜色=['#A93625','-1,15,#AB3521/166,2,#973022/166,17,#8F2E20',70]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{跳转 | '事件离去'}
)

[特殊异想体事件]=(

{找图 | 未知 | 点击=['T',0,0,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[842,208,1467,642]] | 图片=['事件结果未知',70]}
{找图 | 事件-财富 | 点击=['T',1135,407,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[299,101,568,317]] | 图片=['事件-财富',75]}
{找图 | 事件-遗骸碎片 | 点击=['T',1068,556,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-遗骸碎片',85]}
{找图 | 事件-蜘蛛巢 | 点击=['T',1068,593,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-蜘蛛巢',85]}
{找图 | 事件-安保部 | 点击=['T',1068,593,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-安保部',85]}
{找图 | 事件-卡蜜拉 | 点击=['T',1147,407,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-卡蜜拉',85]}
{找图 | 事件-雷击木 | 点击=['T',1135,407,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-雷击木',85]}
{找图 | 事件-冬夜梦 | 点击=['T',1135,407,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-冬夜梦',85]}
{找图 | 事件-跳舞鸡 | 点击=['T',1135,407,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-跳舞鸡',85]}
{找图 | 事件-时间缰绳 | 点击=['T',1135,407,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-时间缰绳',85]}
{找图 | 升级 | 点击=['T',0,0,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[842,208,1467,642]] | 图片=['事件升级',70]}
{跳至 | ['特殊异想体事件','不躲棉花'] | 开关={'流血'}}
{找图 | 事件-浸染棉花 | 点击=['T',1068,556,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[40,39,835,453]] | 图片=['事件-浸染棉花',85]}
{空参 | 不躲棉花}
{组 | '异想体事件选项1'}
{组 | '异想体事件选项2'}
{组 | '异想体事件选项3'}
{跳出 | 'TF'}
)

[异想体事件选项1]=(
{找图 | 事件战斗 | 跳出='T' | 范围=[[842,208,1472,357]] | 图片=['事件战斗',70]}
{找图 | 事件饰品获取 | 点击=['T',0,0,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[842,208,1472,357]] | 图片=['事件饰品获取',70]}
{跳出 | 'TF'}
)

[异想体事件选项2]=(
{找图 | 事件战斗 | 跳出='T' | 范围=[[859,345,1469,501]] | 图片=['事件战斗',70]}
{找图 | 事件饰品获取 | 点击=['T',0,0,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[859,345,1469,501]] | 图片=['事件饰品获取',70]}
{找图 | 强化终止 | 点击=['T',0,0,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[824,338,1380,497]] | 图片=['强化终止',85]}
{跳出 | 'TF'}
)

[异想体事件选项3]=(
{找图 | 事件战斗 | 跳出='T' | 范围=[[852,485,1467,642]] | 图片=['事件战斗',70]}
{找图 | 事件饰品获取 | 点击=['T',0,0,50] | 跳至=['T','事件','按钮'] | 延时=100 | 范围=[[852,485,1467,642]] | 图片=['事件饰品获取',70]}
{跳出 | 'TF'}
)

[-=-=地牢饰品获取=-=-]=()
[饰品坐标规定]=(
{空参 | 次数1 | 计次=['T','苦难次数',3,{赋值=['T',[{'选择苦难'},0]]}]}
{跳至 | ['饰品坐标规定','计次完'] | 开关={'选择苦难'}}
{空参 | 次数2 | 计次=['T','饰品坐标次数',3,{赋值=['T',[{'避开已拥有'},0]]}]}
{空参 | 次数3 | 计次=['T','离开白名',5,{赋值=['T',[{'离开白名'},1]]}] | 开关={'仅获取与升级白名单饰品'}}
{空参 | 计次完}
{赋值 | [[{'饰品坐标Y1'},175],[{'饰品坐标Y2'},370],[{'饰品坐标Y3'},175],[{'饰品坐标Y4'},370],[{'饰品坐标Y5'},175],[{'饰品坐标Y6'},370],[{'饰品坐标Y7'},175],[{'饰品坐标Y8'},370]]}
{赋值 | [[{'饰品坐标Y2'},600],[{'饰品坐标Y4'},600],[{'饰品坐标Y6'},600],[{'饰品坐标Y8'},600]] | 开关={'选择苦难'}}

{跳至 | ['饰品坐标规定','困难'] | 开关={'困难选择'}}
{空参 | 普通}
{赋值 | [[{'饰品坐标X1'},312],[{'饰品坐标X2'},622],[{'饰品坐标X3'},643],[{'饰品坐标X4'},953],[{'饰品坐标X5'},973],[{'饰品坐标X6'},1283],[{'饰品坐标X7'},973],[{'饰品坐标X8'},1283],[{'饰品坐标Y7'},0],[{'饰品坐标Y8'},130]]}

{空参 | 普通-已有}
{判断 | [[{'避开已拥有'},'等于',0],{跳至=['T','饰品坐标规定','普通-待选']}]}
{判断 | [[{'选择苦难'},'等于',1],{跳至=['T','饰品坐标规定','普通-待选']}]}
{找图 | 已有1 | 赋值=['T',[{'饰品坐标Y1'},0],[{'饰品坐标Y2'},130]] | 范围=[[312,175,622,370]] | 图片=['选择-已拥有',80]}
{找图 | 已有2 | 赋值=['T',[{'饰品坐标Y3'},0],[{'饰品坐标Y4'},130]] | 范围=[[643,175,953,370]] | 图片=['选择-已拥有',80]}
{找图 | 已有3 | 赋值=['T',[{'饰品坐标Y5'},0],[{'饰品坐标Y6'},130]] | 范围=[[973,175,1283,370]] | 图片=['选择-已拥有',80]}

{空参 | 普通-待选}
{找图 | 待选1 | 赋值=['T',[{'饰品坐标Y1'},0],[{'饰品坐标Y2'},130]] | 范围=[[312,175,622,370]] | 图片=['选择-待拿取',85]}
{找图 | 待选2 | 赋值=['T',[{'饰品坐标Y3'},0],[{'饰品坐标Y4'},130]] | 范围=[[643,175,953,370]] | 图片=['选择-待拿取',85]}
{找图 | 待选3 | 赋值=['T',[{'饰品坐标Y5'},0],[{'饰品坐标Y6'},130]] | 范围=[[973,175,1283,370]] | 图片=['选择-待拿取',85]}

{空参 | 普通-垃圾}
{判断 | [[{'流血'},'等于',1],{跳至=['T','饰品坐标规定','完成']}]}
{判断 | [[{'选择苦难'},'等于',1],{跳至=['T','饰品坐标规定','完成']}]}
{找图 | 垃圾1 | 赋值=['T',[{'饰品坐标Y1'},0],[{'饰品坐标Y2'},130]] | 范围=[[312,175,622,370]] | 图片=['选择-白棉花',80]}
{找图 | 垃圾2 | 赋值=['T',[{'饰品坐标Y3'},0],[{'饰品坐标Y4'},130]] | 范围=[[643,175,953,370]] | 图片=['选择-白棉花',80]}
{找图 | 垃圾3 | 赋值=['T',[{'饰品坐标Y5'},0],[{'饰品坐标Y6'},130]] | 范围=[[973,175,1283,370]] | 图片=['选择-白棉花',80]}
{跳至 | ['饰品坐标规定','完成']}

{空参 | 困难}
{赋值 | [[{'饰品坐标X1'},146],[{'饰品坐标X2'},456],[{'饰品坐标X3'},477],[{'饰品坐标X4'},787],[{'饰品坐标X5'},808],[{'饰品坐标X6'},1118],[{'饰品坐标X7'},1138],[{'饰品坐标X8'},1448]]}

{空参 | 困难-已有}
{判断 | [[{'避开已拥有'},'等于',0],{跳至=['T','饰品坐标规定','困难-待选']}]}
{判断 | [[{'选择苦难'},'等于',1],{跳至=['T','饰品坐标规定','困难-待选']}]}
{找图 | 已有1 | 赋值=['T',[{'饰品坐标Y1'},0],[{'饰品坐标Y2'},130]] | 范围=[[146,175,456,370]] | 图片=['选择-已拥有',80]}
{找图 | 已有2 | 赋值=['T',[{'饰品坐标Y3'},0],[{'饰品坐标Y4'},130]] | 范围=[[477,175,787,370]] | 图片=['选择-已拥有',80]}
{找图 | 已有3 | 赋值=['T',[{'饰品坐标Y5'},0],[{'饰品坐标Y6'},130]] | 范围=[[808,175,1118,370]] | 图片=['选择-已拥有',80]}
{找图 | 已有4 | 赋值=['T',[{'饰品坐标Y7'},0],[{'饰品坐标Y8'},130]] | 范围=[[1138,175,1448,370]] | 图片=['选择-已拥有',80]}

{空参 | 困难-待选}
{找图 | 待选1 | 赋值=['T',[{'饰品坐标Y1'},0],[{'饰品坐标Y2'},130]] | 范围=[[146,175,456,370]] | 图片=['选择-待拿取',85]}
{找图 | 待选2 | 赋值=['T',[{'饰品坐标Y3'},0],[{'饰品坐标Y4'},130]] | 范围=[[477,175,787,370]] | 图片=['选择-待拿取',85]}
{找图 | 待选3 | 赋值=['T',[{'饰品坐标Y5'},0],[{'饰品坐标Y6'},130]] | 范围=[[808,175,1118,370]] | 图片=['选择-待拿取',85]}
{找图 | 待选4 | 赋值=['T',[{'饰品坐标Y7'},0],[{'饰品坐标Y8'},130]] | 范围=[[1138,175,1448,370]] | 图片=['选择-待拿取',85]}

{空参 | 困难-垃圾}
{判断 | [[{'流血'},'等于',1],{跳至=['T','饰品坐标规定','完成']}]}
{判断 | [[{'选择苦难'},'等于',1],{跳至=['T','饰品坐标规定','完成']}]}
{找图 | 垃圾1 | 赋值=['T',[{'饰品坐标Y1'},0],[{'饰品坐标Y2'},130]] | 范围=[[146,175,456,370]] | 图片=['选择-白棉花',80]}
{找图 | 垃圾2 | 赋值=['T',[{'饰品坐标Y3'},0],[{'饰品坐标Y4'},130]] | 范围=[[477,175,787,370]] | 图片=['选择-白棉花',80]}
{找图 | 垃圾3 | 赋值=['T',[{'饰品坐标Y5'},0],[{'饰品坐标Y6'},130]] | 范围=[[808,175,1118,370]] | 图片=['选择-白棉花',80]}
{找图 | 垃圾4 | 赋值=['T',[{'饰品坐标Y7'},0],[{'饰品坐标Y8'},130]] | 范围=[[1138,175,1448,370]] | 图片=['选择-白棉花',80]}
{跳至 | ['饰品坐标规定','完成']}


{空参 | 完成}
{跳至 | ['EGO饰品选择','选择饰品']}
)

[EGO饰品选择]=(
{移动 | [1216,18,200]}
{延时 | 300}
{按键 | ['F12',50] | 开关={'选择截图'}}
{赋值 | [[{'已选择'},0],[{'避开已拥有'},1],[{'选择苦难'},0],[{'离开白名'},0]]}
{跳至 | ['EGO饰品选择','规定坐标'] | 开关={'星恩选择10'}}
{跳至 | ['EGO饰品选择','规定坐标'] | 开关={'星恩选择6'}}
{找图 | 四选一 | 赋值=['T',[{'困难选择'},1]] | 范围=[[125,314,230,480]] | 图片=['只有一个饰品',75]}
{找图 | 三选一 | 赋值=['T',[{'困难选择'},0]] | 范围=[[297,326,383,608]] | 图片=['只有一个饰品',75]}
{找图 | 只有一个饰品 | 跳至=['F','EGO饰品选择','中间'] | 赋值=['F',[{'困难选择'},0]] | 范围=[[792,206,1395,627]] | 图片=['只有一个饰品',75]}
{判断 | [[{'楼层'},'大于',2],{赋值=['T',[{'选择苦难'},1]]}] | 开关={'2层后选择苦难'}}
{空参 | 规定坐标}
{组 | '饰品坐标规定'}
{空参 | 选择饰品}
{找图 | 苦难 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['苦难-坚韧','苦难-生长','苦难-顽强',80] | 开关={'选择苦难'}}
{跳转 | '饰品坐标规定' | 开关={'选择苦难'}}
{找图 | 月之记忆 | 点击=['T',0,0,50] | 按键=['T','F12',50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-月之记忆',85]}

{判断 | [[{'仅获取与升级白名单饰品'},'等于',0],{跳至=['T','EGO饰品选择','白名单结束']}]}
{判断 | [[{'避开已拥有'},'等于',0],{跳至=['T','EGO饰品选择','白名单结束']}]}
{找图 | 烧伤 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-火热多汁琵琶腿','选择-土归土','选择-炽热的羽毛','选择-炼狱炎蝶之梦',80] | 开关={'烧伤'}}
{找图 | 流血 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-烟霾与铁丝网','选择-嗜伤甲虫','选择-白棉花','选择-又小又可能很坏的玩偶',80] | 开关={'流血'}}
{找图 | 震颤 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-生物剧毒药瓶','选择-真理之钟','选择-残响',80] | 开关={'震颤'}}
{找图 | 破裂 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-干巴柴涩鸡胸肉','选择-雷击木','选择-破伞','选择-成捆的符咒',80] | 开关={'破裂'}}
{找图 | 沉沦 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-仲冬夜之噩梦','选择-彼方之星','选择-破碎罗盘','选择-遗骸碎片''选择-荆棘之路',80] | 开关={'沉沦'}}
{找图 | 呼吸 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-内啡肽试剂组','选择-雾化吸入器','选择-烟斗','选择-绿色鞘翅','选择-追忆吊坠','选择-马蹄铁饰物',80] | 开关={'呼吸'}}
{找图 | 充能 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-避雷针','选择-便携式电源插座','选择-夜视仪','选择-护腕','选择-简历','选择-不间断电源装置',80] | 开关={'充能'}}
{找图 | 斩击 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-决意',80] | 开关={'斩击'}}
{找图 | 刺击 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-撕裂的弹带',80] | 开关={'刺击'}}
{找图 | 打击 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-时间的枷锁',80] | 开关={'打击'}}

{空参 | 白名单结束}
//{找图|探戈鸡酱料|点击=['T',0,0,50]|跳转=['T饰品选择判断']|范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]]|图片=['选择-探戈鸡酱料',85]}
{判断 | [[{'仅获取与升级白名单饰品'},'等于',1],{跳转=['T饰品坐标规定']}] | 开关={'避开已拥有'}}
{找图 | 等级 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-五级','选择-四级','选择-三级','选择-二级',85] | 开关={'仅获取与升级白名单饰品'}}
{跳至 | ['EGO饰品选择','不白名单'] | 开关={'星恩选择6'}}
{跳至 | ['EGO饰品选择','不白名单'] | 开关={'离开白名'}}
{跳转 | '饰品坐标规定' | 开关={'仅获取与升级白名单饰品'}}
{空参 | 不白名单}
{组 | {'体系1'}}
{组 | {'体系2'} | 开关={'体系二'}}
{组 | '回复类EGO饰品选择' | 开关={'回复类'}}
{组 | '经济类EGO饰品选择' | 开关={'经济类'}}
{找图 | 卡蜜拉 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-卡蜜拉',85]}
{跳转 | '饰品坐标规定' | 开关={'避开已拥有'}}
{找图 | 等级 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-五级','选择-四级','选择-三级','选择-二级','选择-一级',85]}
{跳转 | '饰品坐标规定'}

{空参 | 中间}
{找图 | 等级 | 点击=['T',0,0,50] | 跳至=['T','EGO饰品选择','确定'] | 范围=[[129,177,1459,380]] | 图片=['选择-一级',85] | 开关={'仅获取与升级白名单饰品'}}
{跳至 | ['EGO饰品选择','不躲'] | 开关={'流血'}}
{找图 | 白棉花 | 点击=['T',1192,722,50] | 延时=600 | 范围=[[519,170,1103,453]] | 图片=['选择-白棉花',85]}
{空参 | 不躲}
{找图 | 确认 | 点击=['T',0,0,50,'2L'] | 跳至=['T','EGO饰品选择','重置'] | 延时=200 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',75]}

{点击 | [887,326,50] | 延时=200}
{空参 | 确定}
{点击 | [1427,723,50] | 延时=100}
{延时 | 100}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 100}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 循环=['T',3,500] | 范围=[[638,610,944,712]] | 图片=['确认3','确认2','确认1',85]}
{延时 | 500}
{空参 | 重置}
{重置计次 | '苦难次数'}
{重置计次 | '饰品坐标次数'}
{重置计次 | '离开白名'}
{赋值 | [[{'饰品坐标X1'},0],[{'饰品坐标X2'},50],[{'饰品坐标X3'},0],[{'饰品坐标X4'},50],[{'饰品坐标X5'},0],[{'饰品坐标X6'},50],[{'饰品坐标X7'},0],[{'饰品坐标X8'},50]]}
{空参 | 星恩选择10 | 赋值=['T',[{'星恩选择10'},0]] | 跳转=['T房间检索'] | 开关={'星恩选择10'}}
{空参 | 星恩选择6 | 赋值=['T',[{'星恩选择6'},0]] | 跳转=['T房间检索'] | 开关={'星恩选择6'}}
{跳转 | '房间检索'}
)
[饰品选择判断]=(
{延时 | 200}
{计算 | [[{'星恩10已选择'},'+',1,{'星恩10已选择'}]] | 开关={'星恩选择10'}}
{判断 | [[{'星恩10已选择'},'等于',3],{跳至=['T','EGO饰品选择','确定']}] | 开关={'星恩选择10'}}
{组 | '饰品坐标规定' | 开关={'星恩选择10'}}
{计算 | [[{'星恩6已选择'},'+',1,{'星恩6已选择'}]] | 开关={'星恩选择6'}}
{判断 | [[{'星恩6已选择'},'等于',3],{跳至=['T','EGO饰品选择','确定']}] | 开关={'星恩选择6'}}
{组 | '饰品坐标规定' | 开关={'星恩选择6'}}
{计算 | [[{'已选择'},'+',1,{'已选择'}]]}
{判断 | [[{'已选择'},'等于',2],{跳至=['T','EGO饰品选择','确定']}]}
{判断 | [[{'困难选择'},'等于',1],{组=['T饰品坐标规定']}]}
{跳至 | ['EGO饰品选择','确定']}
)
[回复类EGO饰品选择]=(
//急救包未截取
{找图 | 止痛药 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-止痛药',85]}
{找图 | 石版字符 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-石版字符',85]}
{找图 | 采血包 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-采血包',85]}
{找图 | 便携式急救包 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-便携式急救包',85]}
{找图 | 归途 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-归途',85]}
{跳出 | 'TF'}
)

[经济类EGO饰品选择]=(
//贪婪之锤未截取
{找图 | 贪婪之锤 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-贪婪之锤',85]}
{找图 | 生存的里程标 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-生存的里程标',75]}
{找图 | 金瓮 | 点击=['T',0,0,50] | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['选择-金瓮',75]}
{跳出 | 'TF'}
)

[■■■■星恩■■■■]=()

[星恩10]=(
{点击 | [1260,741,50] | 延时=20 | 开关={'星恩10+'}}
{点击 | [1353,741,50] | 延时=20 | 开关={'星恩10++'}}
{点击 | [1303,536,50] | 延时=200}
{跳出 | 'TF'}
)

[星恩9]=(
{点击 | [1004,741,50] | 延时=20 | 开关={'星恩9+'}}
{点击 | [1107,741,50] | 延时=20 | 开关={'星恩9++'}}
{点击 | [1056,536,50] | 延时=200}
{跳出 | 'TF'}
)

[星恩8]=(
{点击 | [728,741,50] | 延时=20 | 开关={'星恩8+'}}
{点击 | [859,741,50] | 延时=20 | 开关={'星恩8++'}}
{点击 | [808,536,50] | 延时=200}
{跳出 | 'TF'}
)

[星恩7]=(
{点击 | [510,741,50] | 延时=20 | 开关={'星恩7+'}}
{点击 | [612,741,50] | 延时=20 | 开关={'星恩7++'}}
{点击 | [562,536,50] | 延时=200}
{跳出 | 'TF'}
)

[星恩6]=(
{点击 | [261,741,50] | 延时=20 | 开关={'星恩6+'}}
{点击 | [364,741,50] | 延时=20 | 开关={'星恩6++'}}
{点击 | [310,536,50] | 延时=200}
{跳出 | 'TF'}
)

[星恩5]=(
{点击 | [1260,440,50] | 延时=20 | 开关={'星恩5+'}}
{点击 | [1353,440,50] | 延时=20 | 开关={'星恩5++'}}
{点击 | [1303,256,50] | 延时=200}
{跳出 | 'TF'}
)

[星恩4]=(
{点击 | [1004,440,50] | 延时=20 | 开关={'星恩4+'}}
{点击 | [1107,440,50] | 延时=20 | 开关={'星恩4++'}}
{点击 | [1056,256,50] | 延时=200}
{跳出 | 'TF'}
)

[星恩3]=(
{点击 | [757,440,50] | 延时=20 | 开关={'星恩3+'}}
{点击 | [859,440,50] | 延时=20 | 开关={'星恩3++'}}
{点击 | [808,256,50] | 延时=200}
{跳出 | 'TF'}
)

[星恩2]=(
{点击 | [510,440,50] | 延时=20 | 开关={'星恩2+'}}
{点击 | [612,440,50] | 延时=20 | 开关={'星恩2++'}}
{点击 | [562,256,50] | 延时=200}
{跳出 | 'TF'}
)

[星恩1]=(
{点击 | [244,440,50] | 延时=20 | 开关={'星恩1+'}}
{点击 | [336,440,50] | 延时=20 | 开关={'星恩1++'}}
{点击 | [310,256,50] | 延时=200}
{跳出 | 'TF'}
)

[■■■■观测组■■■■]=()

[喵派观测法则]=(

{空参 | 选页}
{判断 | [[{'观测数量'},'等于',0],{跳至=['T','喵派观测法则','无']}]}

{重置计次 | '下拉'}

{判断 | [[{'当前观测'},'大于',{'观测数量'}],{跳至=['T','喵派观测法则','完成']}]}
{空参 | 判断1 | 判断=['T',[{'当前观测'},'等于',1],{跳至=['T','喵派观测法则','体系1']}]}
{空参 | 判断2 | 判断=['T',[{'当前观测'},'等于',2],{跳至=['T','喵派观测法则','体系2']}]}
{空参 | 判断3 | 判断=['T',[{'当前观测'},'等于',3],{跳至=['T','喵派观测法则','体系3']}]}
//放一条不生效太蠢了
{找图 | 体系1 | 点击=['T',0,0,50] | 跳至=['T','喵派观测法则','延时'] | 范围=[[81,176,873,293]] | 图片=[{'观测体系1'},75] | 开关={'观测启用1'}}
{找图 | 体系11 | 跳至=['F','喵派观测法则','完成'] | 范围=[[81,176,873,293]] | 图片=[{'观测体系1'},75] | 开关={'观测启用1'}}
{找图 | 体系2 | 点击=['T',0,0,50] | 跳至=['T','喵派观测法则','延时'] | 范围=[[81,176,873,293]] | 图片=[{'观测体系2'},75] | 开关={'观测启用2'}}
{找图 | 体系22 | 跳至=['F','喵派观测法则','完成'] | 范围=[[81,176,873,293]] | 图片=[{'观测体系2'},75] | 开关={'观测启用2'}}
{找图 | 体系3 | 点击=['T',0,0,50] | 跳至=['T','喵派观测法则','延时'] | 范围=[[81,176,873,293]] | 图片=[{'观测体系3'},75] | 开关={'观测启用3'}}
{找图 | 体系32 | 跳至=['F','喵派观测法则','完成'] | 范围=[[81,176,873,293]] | 图片=[{'观测体系3'},75] | 开关={'观测启用3'}}
{空参 | 延时}
{延时 | 800}
{空参 | 抓取}
{找图 | 观测1 | 点击=['T',0,0,50] | 赋值=['T',[{'观测启用1-1'},0]] | 计算=['T',[{'已观测数量'},'+',1,{'已观测数量'}]] | 范围=[[97,281,985,776]] | 图片=[{'观测饰品1'},80] | 开关={'观测启用1-1'}}
{找图 | 观测2 | 点击=['T',0,0,50] | 赋值=['T',[{'观测启用2-1'},0]] | 计算=['T',[{'已观测数量'},'+',1,{'已观测数量'}]] | 范围=[[97,281,985,776]] | 图片=[{'观测饰品2'},80] | 开关={'观测启用2-1'}}
{找图 | 观测3 | 点击=['T',0,0,50] | 赋值=['T',[{'观测启用3-1'},0]] | 计算=['T',[{'已观测数量'},'+',1,{'已观测数量'}]] | 范围=[[97,281,985,776]] | 图片=[{'观测饰品3'},80] | 开关={'观测启用3-1'}}

{判断 | [[{'已观测数量'},'等于',{'观测数量'}],{跳至=['T','喵派观测法则','完成']}]}
{空参 | 计次次数-1=下拉次数 | 计次=['T','下拉',3,{计算=['T',[{'当前观测'},'+',1,{'当前观测'}]] | 跳至=['T','喵派观测法则','选页']}]}

{点击 | ['T',960,724,50,'L',1]}
{移动 | [960,281,7]}
{点击 | ['T',960,281,500,'L',2]}
{跳至 | ['喵派观测法则','抓取']}

{空参 | 完成}

{判断 | [[{'已观测数量'},'等于',0],{跳至=['T','喵派观测法则','无']}]}
{点击 | [1364,719,50] | 延时=500}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=100 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{延时 | 300}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=400 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=400 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=400 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}

{跳至 | ['入场','最终处理']}

{空参 | 无}
{点击 | [1146,709,50] | 延时=500}
{找图 | 确认 | 点击=['T',0,0,50] | 偏移=[25,0] | 延时=100 | 范围=[[419,125,1568,871]] | 图片=['确认3','确认2','确认1',85]}
{找图 | 重连尝试 | 组=['T重连'] | 范围=[[1280,43,1541,143],[730,337,1005,494]] | 图片=['重连','重连尝试',85]}
{跳至 | ['入场','最终处理']}

)

[■■■■变量组■■■■]=()

[烧伤]=(
{赋值 | [[{'烧伤'},1]] | 开关={'体系赋值'}}
{判断 | [[{'合成1'},'等于',1],{赋值=['T',[{'烧伤合成1'},1]]}] | 开关={'合成赋值'}}
{判断 | [[{'合成2'},'等于',1],{赋值=['T',[{'烧伤合成2'},1]]}] | 开关={'合成赋值'}}
{跳出 | 'TF' | 开关={'体系赋值'}}
{跳出 | 'TF' | 开关={'合成赋值'}}
{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['烧伤标识',80]}
{找图 | 定向刷新 | 点击=['T',400,350,50] | 范围=[[691,120,827,208]] | 图片=['定向刷新',85]}
{找图 | 合成 | 跳出='F' | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}
{点击 | [464,437,50] | 延时=100}
{找图 | 确认 | 循环=['F',10,100] | 范围=[[886,652,1090,758]] | 图片=['确认3','确认2','确认1',80]}

{点击 | [400,350,50,'2L'] | 延时=200}
{点击 | [1000,705,50] | 延时=100}
{点击 | [1404,633,50]}
{组 | '合成准备' | 开关={'三级合成1'}}
{找图 | 烧伤合成 | 跳转=['F合成准备'] | 范围=[[757,240,1438,665]] | 图片=['合成-炎鳞',75]}
{跳出 | 'TF'}
)
[流血]=(
{赋值 | [[{'流血'},1]] | 开关={'体系赋值'}}
{赋值 | [[{'流血合成'},1]] | 开关={'合成赋值'}}
{判断 | [[{'合成1'},'等于',1],{赋值=['T',[{'流血合成1'},1]]}] | 开关={'合成赋值'}}
{判断 | [[{'合成2'},'等于',1],{赋值=['T',[{'流血合成2'},1]]}] | 开关={'合成赋值'}}
{跳出 | 'TF' | 开关={'体系赋值'}}
{跳出 | 'TF' | 开关={'合成赋值'}}
{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['流血标识',80]}
{找图 | 定向刷新 | 点击=['T',600,350,50] | 范围=[[691,120,827,208]] | 图片=['定向刷新',85]}
{找图 | 合成 | 跳出='F' | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}
{点击 | [464,437,50] | 延时=100}
{找图 | 确认 | 循环=['F',10,100] | 范围=[[886,652,1090,758]] | 图片=['确认3','确认2','确认1',80]}

{点击 | [600,350,50,'2L'] | 延时=200}
{点击 | [1000,705,50] | 延时=100}
{点击 | [1404,633,50]}
{组 | '合成准备' | 开关={'三级合成1'}}
{找图 | 流血合成 | 跳转=['F合成准备'] | 范围=[[757,240,1438,665]] | 图片=['合成-红染棉花',75]}
{跳出 | 'TF'}
)
[震颤]=(
{赋值 | [[{'震颤'},1]] | 开关={'体系赋值'}}
{判断 | [[{'合成1'},'等于',1],{赋值=['T',[{'震颤合成1'},1]]}] | 开关={'合成赋值'}}
{判断 | [[{'合成2'},'等于',1],{赋值=['T',[{'震颤合成2'},1]]}] | 开关={'合成赋值'}}
{跳出 | 'TF' | 开关={'体系赋值'}}
{跳出 | 'TF' | 开关={'合成赋值'}}
{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['震颤标识',80]}
{找图 | 定向刷新 | 点击=['T',800,350,50] | 范围=[[691,120,827,208]] | 图片=['定向刷新',85]}
{找图 | 合成 | 跳出='F' | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}
{点击 | [464,437,50] | 延时=100}
{找图 | 确认 | 循环=['F',10,100] | 范围=[[886,652,1090,758]] | 图片=['确认3','确认2','确认1',80]}

{点击 | [800,350,50,'2L'] | 延时=200}
{点击 | [1000,705,50] | 延时=100}
{点击 | [1404,633,50]}
{组 | '合成准备' | 开关={'三级合成1'}}
{找图 | 震颤合成 | 跳转=['F合成准备'] | 范围=[[757,240,1438,665]] | 图片=['合成-暴雨',75]}
{跳出 | 'TF'}
)
[破裂]=(
{赋值 | [[{'破裂'},1]] | 开关={'体系赋值'}}
{判断 | [[{'合成1'},'等于',1],{赋值=['T',[{'破裂合成1'},1]]}] | 开关={'合成赋值'}}
{判断 | [[{'合成2'},'等于',1],{赋值=['T',[{'破裂合成2'},1]]}] | 开关={'合成赋值'}}
{跳出 | 'TF' | 开关={'体系赋值'}}
{跳出 | 'TF' | 开关={'合成赋值'}}
{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['破裂标识',80]}
{找图 | 定向刷新 | 点击=['T',1000,350,50] | 范围=[[691,120,827,208]] | 图片=['定向刷新',85]}
{找图 | 合成 | 跳出='F' | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}
{点击 | [464,437,50] | 延时=100}
{找图 | 确认 | 循环=['F',10,100] | 范围=[[886,652,1090,758]] | 图片=['确认3','确认2','确认1',80]}

{点击 | [1000,350,50,'2L'] | 延时=200}
{点击 | [1000,705,50] | 延时=100}
{点击 | [1404,633,50]}
{组 | '合成准备' | 开关={'三级合成1'}}
{找图 | 破裂合成 | 跳转=['F合成准备'] | 范围=[[757,240,1438,665]] | 图片=['合成-快感',75]}
{跳出 | 'TF'}
)
[沉沦]=(
{赋值 | [[{'沉沦'},1]] | 开关={'体系赋值'}}
{判断 | [[{'合成1'},'等于',1],{赋值=['T',[{'沉沦合成1'},1]]}] | 开关={'合成赋值'}}
{判断 | [[{'合成2'},'等于',1],{赋值=['T',[{'沉沦合成2'},1]]}] | 开关={'合成赋值'}}
{跳出 | 'TF' | 开关={'体系赋值'}}
{跳出 | 'TF' | 开关={'合成赋值'}}
{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['沉沦标识',80]}
{找图 | 定向刷新 | 点击=['T',1200,350,50] | 范围=[[691,120,827,208]] | 图片=['定向刷新',85]}
{找图 | 合成 | 跳出='F' | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}
{点击 | [464,437,50] | 延时=100}
{找图 | 确认 | 循环=['F',10,100] | 范围=[[886,652,1090,758]] | 图片=['确认3','确认2','确认1',80]}

{点击 | [1200,350,50,'2L'] | 延时=200}
{点击 | [1000,705,50] | 延时=100}
{点击 | [1404,633,50]}
{组 | '合成准备' | 开关={'三级合成1'}}
{找图 | 沉沦合成 | 跳转=['F合成准备'] | 范围=[[757,240,1438,665]] | 图片=['合成-美感',75]}
{跳出 | 'TF'}
)
[呼吸]=(
{赋值 | [[{'呼吸'},1]] | 开关={'体系赋值'}}
{判断 | [[{'合成1'},'等于',1],{赋值=['T',[{'呼吸合成1'},1]]}] | 开关={'合成赋值'}}
{判断 | [[{'合成2'},'等于',1],{赋值=['T',[{'呼吸合成2'},1]]}] | 开关={'合成赋值'}}
{跳出 | 'TF' | 开关={'体系赋值'}}
{跳出 | 'TF' | 开关={'合成赋值'}}
{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['呼吸标识',80]}
{找图 | 定向刷新 | 点击=['T',400,550,50] | 范围=[[691,120,827,208]] | 图片=['定向刷新',85]}
{找图 | 合成 | 跳出='F' | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}
{点击 | [464,437,50] | 延时=100}
{找图 | 确认 | 循环=['F',10,100] | 范围=[[886,652,1090,758]] | 图片=['确认3','确认2','确认1',80]}

{点击 | [400,550,50,'2L'] | 延时=200}
{点击 | [1000,705,50] | 延时=100}
{点击 | [1404,633,50]}
{组 | '合成准备' | 开关={'三级合成1'}}
{找图 | 呼吸合成 | 跳转=['F合成准备'] | 范围=[[757,240,1438,665]] | 图片=['合成-明镜止水',75]}
{跳出 | 'TF'}
)
[充能]=(
{赋值 | [[{'充能'},1]] | 开关={'体系赋值'}}
{判断 | [[{'合成1'},'等于',1],{赋值=['T',[{'充能合成1'},1]]}] | 开关={'合成赋值'}}
{判断 | [[{'合成2'},'等于',1],{赋值=['T',[{'充能合成2'},1]]}] | 开关={'合成赋值'}}
{跳出 | 'TF' | 开关={'体系赋值'}}
{跳出 | 'TF' | 开关={'合成赋值'}}
{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['充能标识',80]}
{找图 | 定向刷新 | 点击=['T',600,550,50] | 范围=[[691,120,827,208]] | 图片=['定向刷新',85]}
{找图 | 合成 | 跳出='F' | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}
{点击 | [464,437,50] | 延时=100}
{找图 | 确认 | 循环=['F',10,100] | 范围=[[886,652,1090,758]] | 图片=['确认3','确认2','确认1',80]}

{点击 | [600,550,50,'2L'] | 延时=200}
{点击 | [1000,705,50] | 延时=100}
{点击 | [1404,633,50]}
{组 | '合成准备' | 开关={'三级合成1'}}
{找图 | 充能合成 | 跳转=['F合成准备'] | 范围=[[757,240,1438,665]] | 图片=['合成-充能式手套',75]}
{跳出 | 'TF'}
)
[斩击]=(
{赋值 | [[{'斩击'},1]] | 开关={'体系赋值'}}
{判断 | [[{'合成1'},'等于',1],{赋值=['T',[{'斩击合成1'},1]]}] | 开关={'合成赋值'}}
{判断 | [[{'合成2'},'等于',1],{赋值=['T',[{'斩击合成2'},1]]}] | 开关={'合成赋值'}}
{跳出 | 'TF' | 开关={'体系赋值'}}
{跳出 | 'TF' | 开关={'合成赋值'}}
{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['斩击标识',80]}
{找图 | 定向刷新 | 点击=['T',800,550,50] | 范围=[[691,120,827,208]] | 图片=['定向刷新',85]}
{找图 | 合成 | 跳出='F' | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}
{点击 | [464,437,50] | 延时=100}
{找图 | 确认 | 循环=['F',10,100] | 范围=[[886,652,1090,758]] | 图片=['确认3','确认2','确认1',80]}

{点击 | [800,550,50,'2L'] | 延时=200}
{点击 | [1000,705,50] | 延时=100}
{点击 | [1404,633,50]}
{组 | '合成准备' | 开关={'三级合成1'}}
{找图 | 斩击合成 | 跳转=['F合成准备'] | 范围=[[757,240,1438,665]] | 图片=['合成-切开的记忆',75]}
{跳出 | 'TF'}
)
[刺击]=(
{赋值 | [[{'刺击'},1]] | 开关={'体系赋值'}}
{判断 | [[{'合成1'},'等于',1],{赋值=['T',[{'刺击合成1'},1]]}] | 开关={'合成赋值'}}
{判断 | [[{'合成2'},'等于',1],{赋值=['T',[{'刺击合成2'},1]]}] | 开关={'合成赋值'}}
{跳出 | 'TF' | 开关={'体系赋值'}}
{跳出 | 'TF' | 开关={'合成赋值'}}
{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['刺击标识',80]}
{找图 | 定向刷新 | 点击=['T',1000,550,50] | 范围=[[691,120,827,208]] | 图片=['定向刷新',85]}
{找图 | 合成 | 跳出='F' | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}
{点击 | [464,437,50] | 延时=100}
{找图 | 确认 | 循环=['F',10,100] | 范围=[[886,652,1090,758]] | 图片=['确认3','确认2','确认1',80]}

{点击 | [1000,550,50,'2L'] | 延时=200}
{点击 | [1000,705,50] | 延时=100}
{点击 | [1404,633,50]}
{组 | '合成准备' | 开关={'三级合成1'}}
{找图 | 刺击合成 | 跳转=['F合成准备'] | 范围=[[757,240,1438,665]] | 图片=['合成-洞穿的记忆',75]}
{跳出 | 'TF'}
)
[打击]=(
{赋值 | [[{'打击'},1]] | 开关={'体系赋值'}}
{判断 | [[{'合成1'},'等于',1],{赋值=['T',[{'打击合成1'},1]]}] | 开关={'合成赋值'}}
{判断 | [[{'合成2'},'等于',1],{赋值=['T',[{'打击合成2'},1]]}] | 开关={'合成赋值'}}
{跳出 | 'TF' | 开关={'体系赋值'}}
{跳出 | 'TF' | 开关={'合成赋值'}}
{找图 | 图标 | 点击=['T',0,0,50] | 延时=50 | 跳转=['T饰品选择判断'] | 范围=[[{'饰品坐标X1'},{'饰品坐标Y1'},{'饰品坐标X2'},{'饰品坐标Y2'}],[{'饰品坐标X3'},{'饰品坐标Y3'},{'饰品坐标X4'},{'饰品坐标Y4'}],[{'饰品坐标X5'},{'饰品坐标Y5'},{'饰品坐标X6'},{'饰品坐标Y6'}],[{'饰品坐标X7'},{'饰品坐标Y7'},{'饰品坐标X8'},{'饰品坐标Y8'}]] | 图片=['打击标识',80]}
{找图 | 定向刷新 | 点击=['T',1200,550,50] | 范围=[[691,120,827,208]] | 图片=['定向刷新',85]}
{找图 | 合成 | 跳出='F' | 范围=[[1127,169,1230,229]] | 图片=['饰品合成',85]}
{点击 | [464,437,50] | 延时=100}
{找图 | 确认 | 循环=['F',10,100] | 范围=[[886,652,1090,758]] | 图片=['确认3','确认2','确认1',80]}

{点击 | [1200,550,50,'2L'] | 延时=200}
{点击 | [1000,705,50] | 延时=100}
{点击 | [1404,633,50]}
{组 | '合成准备' | 开关={'三级合成1'}}
{找图 | 打击合成 | 跳转=['F合成准备'] | 范围=[[757,240,1438,665]] | 图片=['合成-粉碎的记忆',75]}
{跳出 | 'TF'}
)
[禁用]=(
{跳出 | 'TF'}
)
[EGO_箱_WAW]=(
{找图 | 李箱 | 点击=['T',0,0,1200] | 跳出='F' | 范围=[[205,790,1417,871]] | 图片=['箱_环指','箱_六协',85]}
{找图 | EGO_箱_WAW | 点击=['T',0,0,50,'2L'] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_浮_HE]=(
{找图 | 浮士德 | 点击=['T',0,0,1200] | 跳出='F' | 范围=[[205,790,1417,871]] | 图片=['浮_剑契','浮_裂纹','浮_卯',80]}
{找图 | EGO_浮_HE | 点击=['T',0,0,50,'2L'] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['H级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_堂_WAW]=(
{找图 | 堂吉诃德 | 点击=['T',0,0,1200] | 跳出='F' | 范围=[[205,790,1417,871]] | 图片=['堂_拉曼却','堂_憎恶',75]}
{找图 | EGO_堂_WAW | 点击=['T',0,0,50,'2L'] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_堂_WAW_侵蚀]=(
{找图 | 堂吉诃德 | 点击=['T',0,0,1200] | 跳出='F' | 范围=[[205,790,1417,871]] | 图片=['堂_拉曼却','堂_憎恶',75]}
{找图 | EGO_堂_WAW_侵蚀 | 点击=['T',0,0,1200] | 偏移=[0,50] | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{找图 | EGO_堂_WAW_侵蚀 | 点击=['T',0,0,50] | 偏移=[0,50] | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_默_HE]=(
{找图 | 默尔索 | 点击=['T',0,0,1200] | 跳出='F' | 范围=[[205,790,1417,871]] | 图片=['默_剑契','默_五协','默_拇指',85]}
{找图 | EGO_默_HE | 点击=['T',0,0,50,'2L'] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['H级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_夫_WAW]=(
{找图 | 希斯克利夫 | 点击=['T',0,0,1200] | 跳出='F' | 范围=[[205,790,1417,871]] | 图片=['夫_狂猎','夫_句点','夫_黑云',80]}
{找图 | EGO_夫_WAW | 点击=['T',0,0,50,'2L'] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_玛_WAW]=(
{找图 | 以实玛利 | 点击=['T',0,0,1200] | 跳出='F' | 范围=[[205,790,1417,871]] | 图片=['玛_二协','玛_黑云',85]}
{找图 | EGO_玛_WAW | 点击=['T',0,0,50,'2L'] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_罗_HE]=(
{找图 | 罗佳 | 点击=['T',0,0,1200] | 跳出='F' | 范围=[[205,790,1417,871]] | 图片=['罗_十协','罗_九协','罗_拉曼却','罗_巳','罗_绝望',85]}
{找图 | EGO_罗_HE | 点击=['T',0,0,50,'2L'] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['H级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_辛_HE]=(
{找图 | 辛克莱 | 点击=['T',0,0,1200] | 跳出='F' | 范围=[[205,790,1417,871]] | 图片=['辛_五协','辛_蜡翼',85]}
{找图 | EGO_辛_HE | 点击=['T',0,0,50,'2L'] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['H级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_奥_HE]=(
{找图 | 奥提斯 | 点击=['T',0,0,1200] | 跳出='F' | 范围=[[205,790,1417,871]] | 图片=['奥_魔弹','奥_山庄','奥_卯',85]}
{找图 | EGO_奥_HE | 点击=['T',0,0,50,'2L'] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['H级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[EGO_奥_WAW]=(
{找图 | 奥提斯 | 点击=['T',0,0,1200] | 跳出='F' | 范围=[[205,790,1417,871]] | 图片=['奥_魔弹','奥_山庄','奥_卯',85]}
{找图 | EGO_奥_WAW | 点击=['T',0,0,50,'2L'] | 延时=500 | 范围=[[296,170,1303,214]] | 图片=['W级EGO',85]}
{点击 | [1500,800,50] | 延时=500}
{跳出 | 'TF'}
)
[箱]=(
{找图 | 选人 | 跳出='T' | 范围=[[294,293,449,332]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[77,857,136,894]] | 图片=['死亡确认',85]}
{点击 | [374,291,50] | 延时=50}
{跳出 | 'TF'}
)
[浮]=(
{找图 | 选人 | 跳出='T' | 范围=[[459,293,614,332]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[159,846,242,893]] | 图片=['死亡确认',85]}
{点击 | [534,291,50] | 延时=50}
{跳出 | 'TF'}
)
[堂]=(
{找图 | 选人 | 跳出='T' | 范围=[[624,293,779,332]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[264,845,345,895]] | 图片=['死亡确认',85]}
{点击 | [694,291,50] | 延时=50}
{跳出 | 'TF'}
)
[良]=(
{找图 | 选人 | 跳出='T' | 范围=[[789,293,944,332]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[369,851,433,885]] | 图片=['死亡确认',85]}
{点击 | [854,291,50] | 延时=50}
{跳出 | 'TF'}
)
[默]=(
{找图 | 选人 | 跳出='T' | 范围=[[954,293,1109,332]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[461,852,531,891]] | 图片=['死亡确认',85]}
{点击 | [1014,291,50] | 延时=50}
{跳出 | 'TF'}
)
[宝]=(
{找图 | 选人 | 跳出='T' | 范围=[[1119,293,1274,332]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[565,852,617,885]] | 图片=['死亡确认',85]}
{点击 | [1174,291,50] | 延时=50}
{跳出 | 'TF'}
)
[夫]=(
{找图 | 选人 | 跳出='T' | 范围=[[294,542,449,579]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[658,856,712,887]] | 图片=['死亡确认',85]}
{点击 | [374,542,50] | 延时=50}
{跳出 | 'TF'}
)
[玛]=(
{找图 | 选人 | 跳出='T' | 范围=[[459,542,614,579]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[751,854,810,885]] | 图片=['死亡确认',85]}
{点击 | [534,542,50] | 延时=50}
{跳出 | 'TF'}
)
[罗]=(
{找图 | 选人 | 跳出='T' | 范围=[[624,542,779,579]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[846,854,901,888]] | 图片=['死亡确认',85]}
{点击 | [694,542,50] | 延时=50}
{跳出 | 'TF'}
)
[辛]=(
{找图 | 选人 | 跳出='T' | 范围=[[789,542,944,579]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[945,854,999,885]] | 图片=['死亡确认',85]}
{点击 | [854,542,50] | 延时=50}
{跳出 | 'TF'}
)
[奥]=(
{找图 | 选人 | 跳出='T' | 范围=[[954,542,1109,579]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[1048,856,1095,885]] | 图片=['死亡确认',85]}
{点击 | [1014,542,50] | 延时=50}
{跳出 | 'TF'}
)
[虫]=(
{找图 | 选人 | 跳出='T' | 范围=[[1119,542,1274,579]] | 图片=['选人-蓝','选人-红',85]}
{找图 | 死亡检查 | 计算=['T',[{'死亡人数'},'+',1,{'死亡人数'}]] | 跳出='T' | 范围=[[1141,855,1198,889]] | 图片=['死亡确认',85]}
{点击 | [1174,542,50] | 延时=50}
{跳出 | 'TF'}
)
[空]=(
{跳出 | 'TF'}
)